<!DOCTYPE html>












  


<html class="theme-next pisces use-motion" lang="zh-CN">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge"/>
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=2"/>
<meta name="theme-color" content="#222"/>
























<link rel="stylesheet" href="/lib/font-awesome/css/font-awesome.min.css?v=4.6.2"/>

<link rel="stylesheet" href="/css/main.css?v=7.1.0"/>


  <link rel="apple-touch-icon" sizes="180x180" href="/images/apple-touch-icon-next.png?v=7.1.0">


  <link rel="icon" type="image/png" sizes="32x32" href="/images/favicon-32x32-next.png?v=7.1.0">


  <link rel="icon" type="image/png" sizes="16x16" href="/images/favicon-16x16-next.png?v=7.1.0">


  <link rel="mask-icon" href="/images/logo.svg?v=7.1.0" color="#222">







<script id="hexo.configurations">
  var NexT = window.NexT || {};
  var CONFIG = {
    root: '/',
    scheme: 'Pisces',
    version: '7.1.0',
    sidebar: {"position":"left","display":"post","offset":12,"onmobile":false,"dimmer":false},
    back2top: true,
    back2top_sidebar: false,
    fancybox: false,
    fastclick: false,
    lazyload: false,
    tabs: true,
    motion: {"enable":true,"async":false,"transition":{"post_block":"fadeIn","post_header":"slideDownIn","post_body":"slideDownIn","coll_header":"slideLeftIn","sidebar":"slideUpIn"}},
    algolia: {
      applicationID: '',
      apiKey: '',
      indexName: '',
      hits: {"per_page":10},
      labels: {"input_placeholder":"Search for Posts","hits_empty":"We didn't find any results for the search: ${query}","hits_stats":"${hits} results found in ${time} ms"}
    }
  };
</script>


  




  <meta name="description" content="&amp;#x6BCF;&amp;#x5230;&amp;#x4E00;&amp;#x4E2A;&amp;#x91CD;&amp;#x8981;&amp;#x4EBA;&amp;#x751F;&amp;#x8282;&amp;#x70B9;&amp;#xFF0C;&amp;#x90FD;&amp;#x65E0;&amp;#x6BD4;&amp;#x611F;&amp;#x6168;&amp;#xFF0C;&amp;#x65F6;&amp;#x95F4;&amp;#x8FC7;&amp;#x5F97;&amp;#x771F;&amp;#x5FEB;&amp;#xFF01;7&amp;#x6708">
<meta property="og:type" content="article">
<meta property="og:title" content="转眼间，研二了">
<meta property="og:url" content="https://xuxping.github.io/2019/08/23/20190823/index.html">
<meta property="og:site_name" content="Kavim">
<meta property="og:description" content="&amp;#x6BCF;&amp;#x5230;&amp;#x4E00;&amp;#x4E2A;&amp;#x91CD;&amp;#x8981;&amp;#x4EBA;&amp;#x751F;&amp;#x8282;&amp;#x70B9;&amp;#xFF0C;&amp;#x90FD;&amp;#x65E0;&amp;#x6BD4;&amp;#x611F;&amp;#x6168;&amp;#xFF0C;&amp;#x65F6;&amp;#x95F4;&amp;#x8FC7;&amp;#x5F97;&amp;#x771F;&amp;#x5FEB;&amp;#xFF01;7&amp;#x6708">
<meta property="og:updated_time" content="2019-08-23T13:56:11.463Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="转眼间，研二了">
<meta name="twitter:description" content="&amp;#x6BCF;&amp;#x5230;&amp;#x4E00;&amp;#x4E2A;&amp;#x91CD;&amp;#x8981;&amp;#x4EBA;&amp;#x751F;&amp;#x8282;&amp;#x70B9;&amp;#xFF0C;&amp;#x90FD;&amp;#x65E0;&amp;#x6BD4;&amp;#x611F;&amp;#x6168;&amp;#xFF0C;&amp;#x65F6;&amp;#x95F4;&amp;#x8FC7;&amp;#x5F97;&amp;#x771F;&amp;#x5FEB;&amp;#xFF01;7&amp;#x6708">





  
  
  <link rel="canonical" href="https://xuxping.github.io/2019/08/23/20190823/"/>



<script id="page.configurations">
  CONFIG.page = {
    sidebar: "",
  };
</script>

  <title>转眼间，研二了 | Kavim</title>
  












  <noscript>
  <style>
  .use-motion .motion-element,
  .use-motion .brand,
  .use-motion .menu-item,
  .sidebar-inner,
  .use-motion .post-block,
  .use-motion .pagination,
  .use-motion .comments,
  .use-motion .post-header,
  .use-motion .post-body,
  .use-motion .collection-title { opacity: initial; }

  .use-motion .logo,
  .use-motion .site-title,
  .use-motion .site-subtitle {
    opacity: initial;
    top: initial;
  }

  .use-motion .logo-line-before i { left: initial; }
  .use-motion .logo-line-after i { right: initial; }
  </style>
</noscript>

</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-CN">

  
  
    
  

  <div class="container sidebar-position-left page-post-detail">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-brand-wrapper">
  <div class="site-meta">
    

    <div class="custom-logo-site-title">
      <a href="/" class="brand" rel="start">
        <span class="logo-line-before"><i></i></span>
        <span class="site-title">Kavim</span>
        <span class="logo-line-after"><i></i></span>
      </a>
    </div>
    
      
        <p class="site-subtitle">一点一滴积累</p>
      
    
    
  </div>

  <div class="site-nav-toggle">
    <button aria-label="切换导航栏">
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
    </button>
  </div>
</div>



<nav class="site-nav">
  
    <ul id="menu" class="menu">
      
        
        
        
          
          <li class="menu-item menu-item-home">

    
    
    
      
    

    

    <a href="/" rel="section"><i class="menu-item-icon fa fa-fw fa-home"></i> <br/>首页</a>

  </li>
        
        
        
          
          <li class="menu-item menu-item-archives">

    
    
    
      
    

    

    <a href="/archives/" rel="section"><i class="menu-item-icon fa fa-fw fa-archive"></i> <br/>归档</a>

  </li>

      
      
    </ul>
  

  

  
</nav>



  



</div>
    </header>

    


    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          
            

          
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  

  
  
  

  

  <article class="post post-type-normal" itemscope itemtype="http://schema.org/Article">
  
  
  
  <div class="post-block">
    <link itemprop="mainEntityOfPage" href="https://xuxping.github.io/2019/08/23/20190823/"/>

    <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
      <meta itemprop="name" content="Kavim"/>
      <meta itemprop="description" content="生活不止眼前的苟且 还有诗和远方的田野"/>
      <meta itemprop="image" content="/images/avatar.gif"/>
    </span>

    <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
      <meta itemprop="name" content="Kavim"/>
    </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">转眼间，研二了

              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">

            
            
            

            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              
                <span class="post-meta-item-text">发表于</span>
              

              
                
              

              <time title="创建时间：2019-08-23 21:37:29 / 修改时间：21:56:11" itemprop="dateCreated datePublished" datetime="2019-08-23T21:37:29+08:00">2019-08-23</time>
            

            
              

              
            
          </span>

          
            <span class="post-category">
            
              <span class="post-meta-divider">|</span>
            
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              
                <span class="post-meta-item-text">分类于</span>
              
              
                <span itemprop="about" itemscope itemtype="http://schema.org/Thing"><a href="/categories/个人笔记/" itemprop="url" rel="index"><span itemprop="name">个人笔记</span></a></span>

                
                
              
            </span>
          

          
            
            
          

          
          

          

          

          

        </div>
      </header>
    

    
    
    
    <div class="post-body" itemprop="articleBody">

      
      

      
        <p>&#x6BCF;&#x5230;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x4EBA;&#x751F;&#x8282;&#x70B9;&#xFF0C;&#x90FD;&#x65E0;&#x6BD4;&#x611F;&#x6168;&#xFF0C;&#x65F6;&#x95F4;&#x8FC7;&#x5F97;&#x771F;&#x5FEB;&#xFF01;7&#x6708;&#x521D;&#xFF0C;&#x7814;&#x4E00;&#x751F;&#x6DAF;&#x7ED3;&#x675F;&#x540E;&#xFF0C;&#x672C;&#x60F3;&#x5199;&#x7BC7;&#x6587;&#x7AE0;&#x603B;&#x7ED3;&#x4E00;&#x4E0B;&#x6211;&#x662F;&#x5982;&#x4F55;&#x71AC;&#x8FC7;&#x8FD9;&#x4E00;&#x5E74;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x592A;&#x7D2F;&#x4E86;&#xFF0C;&#x60F3;&#x653E;&#x677E;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#xFF0C;&#x7ED3;&#x679C;&#x5C31;&#x62D6;&#x5230;&#x4E86;&#x73B0;&#x5728;&#xFF0C;&#x7814;&#x4E8C;&#x90FD;&#x5F00;&#x5B66;&#x4E86;&#x3002;</p>
<a id="more"></a>
<h2 id="&#x56DE;&#x987E;&#x548C;&#x603B;&#x7ED3;&#x7814;&#x4E00;"><a href="#&#x56DE;&#x987E;&#x548C;&#x603B;&#x7ED3;&#x7814;&#x4E00;" class="headerlink" title="&#x56DE;&#x987E;&#x548C;&#x603B;&#x7ED3;&#x7814;&#x4E00;"></a>&#x56DE;&#x987E;&#x548C;&#x603B;&#x7ED3;&#x7814;&#x4E00;</h2><p>&#x5145;&#x5B9E;&#x7684;&#x751F;&#x6D3B;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x505A;&#x4EFB;&#x4F55;&#x8BA1;&#x5212;&#xFF0C;&#x6BCF;&#x5929;&#x90FD;&#x4F1A;&#x6709;&#x5F88;&#x591A;&#x4E8B;&#x60C5;&#x5728;&#x63A8;&#x52A8;&#x4F60;&#x53BB;&#x505A;&#x3002;&#x8FD9;&#x5C31;&#x8DDF;&#x6324;&#x5730;&#x94C1;&#x4E00;&#x6837;&#xFF0C;&#x540E;&#x9762;&#x7684;&#x4EBA;&#x4F1A;&#x63A8;&#x7740;&#x4F60;&#x8D70;&#xFF0C;&#x60F3;&#x4E0D;&#x8D70;&#x90FD;&#x4E0D;&#x884C;&#x3002;&#x6211;&#x8981;&#x4E48;&#x662F;&#x5728;&#x516C;&#x53F8;&#x4E0A;&#x73ED;&#xFF0C;&#x8981;&#x4E48;&#x5C31;&#x662F;&#x5728;&#x5B66;&#x6821;&#x4E0A;&#x8BFE;&#x3002;&#x4E5F;&#x4E0D;&#x7528;&#x62C5;&#x5FC3;&#x5468;&#x672B;&#x65E0;&#x6240;&#x4E8B;&#x4E8B;&#xFF0C;&#x56E0;&#x4E3A;&#x8981;&#x4E48;&#x662F;&#x5728;&#x4E0A;&#x8BFE;&#xFF0C;&#x8981;&#x4E48;&#x5C31;&#x662F;&#x5728;&#x5199;&#x4F5C;&#x4E1A;&#x3002;&#x6211;&#x81EA;&#x5DF1;&#x662F;&#x4E00;&#x4E2A;&#x4E0D;&#x80FD;&#x95F2;&#x4E0B;&#x6765;&#x7684;&#x4EBA;&#xFF0C;&#x4E00;&#x65E6;&#x95F2;&#x4E0B;&#x6765;&#x5C31;&#x4F1A;&#x4EA7;&#x751F;&#x7126;&#x8651;&#x611F;&#x3002;&#x7D27;&#x51D1;&#x7684;&#x5DE5;&#x4F5C;&#x548C;&#x751F;&#x6D3B;&#x624D;&#x80FD;&#x8BA9;&#x6211;&#x6CA1;&#x6709;&#x7126;&#x8651;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x5145;&#x5B9E;&#x751F;&#x6D3B;&#x5F88;&#x9002;&#x5408;&#x6211;&#x3002;</p>
<p>&#x65F6;&#x5E38;&#x4F1A;&#x5411;&#x5973;&#x670B;&#x53CB;&#x81EA;&#x5632;&#x9053;&#xFF0C;&#x6211;&#x4E00;&#x4E2A;&#x4EBA;&#x9876;&#x4E86;&#x6574;&#x4E2A;&#x5927;&#x5B66;&#x5BA4;&#x53CB;&#x3002;&#x5DE5;&#x4F5C;&#x3001;&#x751F;&#x6D3B;&#x3001;&#x5B66;&#x4E60;&#x548C;&#x7231;&#x60C5;&#x6211;&#x5168;&#x90E8;&#x90FD;&#x5360;&#x6709;&#xFF0C;&#x5BA4;&#x53CB;&#x8981;&#x4E48;&#x53EA;&#x5DE5;&#x4F5C;&#xFF0C;&#x8981;&#x4E48;&#x53EA;&#x5B66;&#x4E60;&#x3002;&#x5B66;&#x4F1A;&#x5982;&#x4F55;&#x53BB;&#x5E73;&#x8861;&#x5DE5;&#x4F5C;&#xFF0C;&#x751F;&#x6D3B;&#x548C;&#x5B66;&#x4E60;&#xFF0C;&#x8FD9;&#x8BA9;&#x6211;&#x517B;&#x6210;&#x4E86;&#x6BCF;&#x5468;&#x63D0;&#x524D;&#x89C4;&#x5212;&#x4E0B;&#x5468;&#x4E8B;&#x60C5;&#x7684;&#x4E60;&#x60EF;&#xFF0C;&#x9AD8;&#x6548;&#x7684;&#x5B89;&#x6392;&#x597D;&#x81EA;&#x5DF1;&#x6BCF;&#x5929;&#x7684;&#x65F6;&#x95F4;&#x548C;&#x6BCF;&#x5468;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x6BCF;&#x5468;&#x4F1A;&#x505A;&#x4E00;&#x6B21;&#x603B;&#x7ED3;&#xFF0C;&#x672C;&#x5468;&#x5B66;&#x4E60;&#x5230;&#x4E86;&#x4EC0;&#x4E48;&#xFF0C;&#x6709;&#x4EC0;&#x4E48;&#x611F;&#x609F;&#xFF0C;&#x4EA7;&#x751F;&#x4E86;&#x4EC0;&#x4E48;&#x7075;&#x611F;&#x3002;&#x662F;&#x5426;&#x662F;&#x865A;&#x5EA6;&#x5149;&#x9634;&#xFF0C;&#x770B;&#x770B;&#x6BCF;&#x5929;&#x7684;&#x8BB0;&#x5F55;&#x5C31;&#x80FD;&#x591F;&#x77E5;&#x9053;&#x3002;</p>
<p>&#x901A;&#x8FC7;&#x4E0D;&#x65AD;&#x7684;&#x5B66;&#x4E60;&#xFF0C;&#x6DA8;&#x4E86;&#x5F88;&#x591A;&#x77E5;&#x8BC6;&#x3002;&#x4ECE;&#x7B97;&#x6CD5;&#xFF0C;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x5230;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#xFF0C;&#x5728;&#x6211;&#x7684;&#x5927;&#x8111;&#x91CC;&#x9010;&#x6E10;&#x5F62;&#x6210;&#x4E86;&#x4E00;&#x4E2A;&#x7EDF;&#x4E00;&#x7684;&#x77E5;&#x8BC6;&#x4F53;&#x7CFB;&#xFF0C;&#x77E5;&#x8BC6;&#x7684;&#x5E7F;&#x5EA6;&#x548C;&#x6DF1;&#x5EA6;&#x90FD;&#x6709;&#x6240;&#x63D0;&#x5347;&#x3002;&#x6709;&#x5F88;&#x591A;&#x7684;&#x77E5;&#x8BC6;&#xFF0C;&#x542C;&#x8001;&#x5E08;&#x5206;&#x4EAB;&#x7ECF;&#x9A8C;&#xFF0C;&#x6709;&#x79CD;&#x987F;&#x609F;&#x7684;&#x611F;&#x89C9;&#xFF0C;&#x8FDC;&#x6BD4;&#x81EA;&#x5DF1;&#x53BB;&#x7422;&#x78E8;&#x8981;&#x5FEB;&#x5F97;&#x5F88;&#x591A;&#x3002;&#x51FA;&#x53BB;&#x9762;&#x8BD5;&#xFF0C;&#x9762;&#x8BD5;&#x5B98;&#x90FD;&#x662F;&#x8BF4;&#x6211;&#x624D;&#x4E00;&#x5E74;NLP&#x7ECF;&#x9A8C;&#x548B;&#x77E5;&#x9053;&#x8FD9;&#x4E48;&#x591A;&#xFF0C;&#x6211;&#x5C31;&#x8DDF;&#x4ED6;&#x8BF4;&#xFF0C;&#x6211;&#x70ED;&#x7231;&#x5B66;&#x4E60;&#x1F604;&#x3002;</p>
<p>&#x4E5F;&#x7ED3;&#x8BC6;&#x4E86;&#x5F88;&#x591A;&#x4F18;&#x79C0;&#x7684;&#x5C0F;&#x4F19;&#x4F34;&#xFF0C;&#x4ED6;&#x4EEC;&#x4E2D;&#x6709;&#x5F88;&#x591A;&#x662F;&#x4ECE;&#x672C;&#x79D1;&#x5347;&#x4E0A;&#x6765;&#x7684;&#xFF0C;&#x6709;&#x5F88;&#x591A;&#x662F;&#x5DF2;&#x7ECF;&#x53C2;&#x52A0;&#x5DE5;&#x4F5C;&#x4E86;&#x7684;&#xFF0C;&#x662F;&#x7F18;&#x5206;&#x8BA9;&#x6211;&#x4EEC;&#x8D70;&#x5230;&#x4E86;&#x4E00;&#x8D77;&#xFF0C;&#x901A;&#x8FC7;&#x4E0D;&#x65AD;&#x7684;&#x4EA4;&#x6D41;&#xFF0C;&#x65E2;&#x80FD;&#x589E;&#x8FDB;&#x611F;&#x60C5;&#xFF0C;&#x4E5F;&#x80FD;&#x4E86;&#x89E3;&#x5404;&#x884C;&#x5404;&#x4E1A;&#x3002;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x5458;&#xFF0C;&#x4E00;&#x5E74;&#x80FD;&#x7ED3;&#x8BC6;&#x8FD9;&#x4E48;&#x591A;&#x65B0;&#x7684;&#x670B;&#x53CB;&#x65F6;&#x975E;&#x5E38;&#x96BE;&#x5F97;&#x7684;&#x3002;</p>
<h2 id="&#x7814;&#x4E8C;&#x7684;&#x5927;&#x81F4;&#x89C4;&#x5212;"><a href="#&#x7814;&#x4E8C;&#x7684;&#x5927;&#x81F4;&#x89C4;&#x5212;" class="headerlink" title="&#x7814;&#x4E8C;&#x7684;&#x5927;&#x81F4;&#x89C4;&#x5212;"></a>&#x7814;&#x4E8C;&#x7684;&#x5927;&#x81F4;&#x89C4;&#x5212;</h2><p>&#x6D88;&#x5316;&#x5438;&#x6536;&#x7814;&#x4E00;&#x7684;&#x4E00;&#x4E9B;&#x91CD;&#x8981;&#x77E5;&#x8BC6;&#xFF0C;&#x5B66;&#x79D1;&#x3002;&#x5305;&#x62EC;&#x7B97;&#x6CD5;&#xFF0C;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x548C;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x3002;&#x57FA;&#x7840;&#x6C38;&#x8FDC;&#x90FD;&#x662F;&#x6700;&#x91CD;&#x8981;&#x7684;&#xFF0C;&#x4E0D;&#x53BB;&#x5DE9;&#x56FA;&#xFF0C;&#x5F88;&#x5FEB;&#x5C31;&#x5FD8;&#x4E86;&#x3002;&#x6211;&#x53EF;&#x4E0D;&#x60F3;&#x767D;&#x5B66;&#x4E86;&#x4E00;&#x4E2A;&#x5927;&#x5B66;&#x540E;&#xFF0C;&#x518D;&#x767D;&#x5B66;&#x4E00;&#x4E2A;&#x7814;&#x7A76;&#x751F;&#xFF0C;&#x7B49;&#x5F85;&#x6BD5;&#x4E1A;&#x540E;&#x5565;&#x90FD;&#x5FD8;&#x8BB0;&#x4E86;&#x3002;&#x590D;&#x4E60;&#x7684;&#x540C;&#x65F6;&#x8865;&#x9F50;&#x81EA;&#x5DF1;&#x7684;&#x77ED;&#x677F;&#xFF0C;&#x6709;&#x65F6;&#x4F1A;&#x6709;&#x4E9B;&#x65B0;&#x7684;&#x611F;&#x609F;&#xFF0C;&#x6211;&#x51C6;&#x5907;&#x63A8;&#x51FA;&#x4E00;&#x4E2A;&#x4EBA;&#x77E5;&#x8BC6;&#x624B;&#x518C;&#xFF0C;&#x76EE;&#x524D;&#x6B63;&#x5728;&#x4E0D;&#x65AD;&#x4E30;&#x5BCC;&#x4E2D;&#x3002;</p>
<p>&#x627E;&#x5230;&#x5408;&#x9002;&#x7684;&#x5F00;&#x9898;&#x65B9;&#x5411;&#xFF0C;&#x5199;&#x5B8C;&#x6BD5;&#x4E1A;&#x8BBA;&#x6587;&#xFF0C;&#x53D1;&#x8868;&#x4E00;&#x7BC7;&#x9876;&#x4F1A;&#x8BBA;&#x6587;&#x3002;&#x91CD;&#x70B9;&#x662F;&#x5B8C;&#x6210;&#x6BD5;&#x4E1A;&#x8BBA;&#x6587;&#xFF0C;&#x8FD9;&#x662F;&#x6BD5;&#x4E1A;&#x7684;&#x524D;&#x63D0;&#x3002;&#x53D1;&#x8868;&#x4E00;&#x7BC7;&#x9876;&#x4F1A;&#x8BBA;&#x6587;&#x662F;&#x60F3;&#x7ED9;&#x81EA;&#x5DF1;&#x7814;&#x7A76;&#x751F;&#x6DAF;&#x7559;&#x4E0B;&#x4E00;&#x70B9;&#x6709;&#x4EF7;&#x503C;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x867D;&#x7136;&#x73B0;&#x5728;&#x5168;&#x56FD;&#x53D6;&#x6D88;&#x4E86;&#x7684;&#x7814;&#x7A76;&#x751F;&#x53D1;&#x8BBA;&#x6587;&#x7684;&#x8981;&#x6C42;&#xFF0C;&#x4F46;&#x81EA;&#x5DF1;&#x8FD8;&#x662F;&#x8981;&#x6709;&#x70B9;&#x8FFD;&#x6C42;&#x7684;&#x3002;</p>
<p>&#x79EF;&#x7D2F;&#x7ECF;&#x9A8C;&#xFF0C;&#x603B;&#x7ED3;&#x548C;&#x5B8C;&#x5584;&#x81EA;&#x5DF1;&#x7684;&#x505A;&#x4E8B;&#x98CE;&#x683C;&#xFF0C;&#x601D;&#x8003;&#x548C;&#x5B66;&#x4E60;&#x65B9;&#x5F0F;&#x3002;&#x7ECF;&#x9A8C;&#x5305;&#x62EC;&#x4EBA;&#x751F;&#x7ECF;&#x9A8C;&#xFF0C;&#x5B66;&#x4E60;&#x5982;&#x4F55;&#x4E3A;&#x4EBA;&#x5904;&#x4E16;&#xFF1B;&#x4E5F;&#x5305;&#x62EC;&#x6280;&#x672F;&#x7ECF;&#x9A8C;&#xFF0C;&#x6BD5;&#x7ADF;&#x8FD8;&#x662F;&#x8981;&#x9760;&#x6280;&#x672F;&#x5403;&#x996D;&#x7684;&#xFF0C;&#x5E94;&#x8BE5;&#x4F1A;&#x53BB;&#x4E2A;&#x4E2D;&#x7B49;&#x4EE5;&#x4E0A;&#x7684;&#x4E92;&#x8054;&#x7F51;&#x516C;&#x53F8;&#xFF0C;&#x79EF;&#x7D2F;&#x81EA;&#x5DF1;&#x7684;&#x6280;&#x672F;&#x7ECF;&#x9A8C;&#x3002;&#x8FD8;&#x6709;&#x5C31;&#x662F;&#x591A;&#x53BB;&#x53C2;&#x52A0;&#x4E00;&#x4E9B;&#x793E;&#x4F1A;&#x6D3B;&#x52A8;&#xFF0C;&#x5982;&#x5927;&#x516C;&#x53F8;&#x7684;&#x5206;&#x4EAB;&#xFF0C;&#x516C;&#x76CA;&#x8FD0;&#x52A8;&#x7B49;&#xFF0C;&#x522B;&#x5468;&#x672B;&#x6CA1;&#x4E8B;&#x5C31;&#x5B85;&#x5728;&#x5BB6;&#x91CC;&#x3002;</p>
<p>&#x5BFB;&#x627E;&#x672A;&#x6765;&#x4E94;&#x5E74;&#x7684;&#x89C4;&#x5212;&#xFF0C;&#x5E76;&#x4E3A;&#x6B64;&#x505A;&#x51C6;&#x5907;&#x3002;&#x4E5F;&#x5FEB;&#x5230;24&#x4E86;&#xFF0C;&#x8FD9;&#x76F8;&#x5F53;&#x4E8E;&#x662F;&#x5728;&#x89C4;&#x5212;30&#x5C81;&#x4EE5;&#x524D;&#x7684;&#x4EBA;&#x751F;&#x3002;&#x5176;&#x5B9E;&#x8FD9;&#x662F;&#x77ED;&#x671F;&#x7684;&#x4E09;&#x89C2;&#x95EE;&#x9898;&#xFF0C;&#x5728;&#x8FD9;&#x6BB5;&#x65F6;&#x95F4;&#x5185;&#xFF0C;&#x6211;&#x5E94;&#x8BE5;&#x6210;&#x4E3A;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x4EBA;&#xFF0C;&#x505A;&#x54EA;&#x4E9B;&#x6709;&#x4EF7;&#x503C;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x8FD9;&#x624D;&#x662F;&#x6700;&#x91CD;&#x8981;&#x7684;&#x4E00;&#x6761;&#xFF0C;&#x53EA;&#x8981;&#x60F3;&#x6E05;&#x695A;&#x8FD9;&#x4E00;&#x6761;&#xFF0C;&#x524D;&#x9762;&#x51E0;&#x6761;&#x90FD;&#x662F;&#x81EA;&#x7136;&#x7684;&#x4E8B;&#x60C5;&#x3002;</p>
<p>&#x5E0C;&#x671B;&#x81EA;&#x5DF1;&#x4E0D;&#x8981;&#x8352;&#x5E9F;&#x4E86;&#x8FD9;&#x77ED;&#x6682;&#x7684;&#x7814;&#x4E8C;&#x3002;</p>
<blockquote>
<p>&#x505C;&#x66F4;&#x4E86;&#x51E0;&#x4E2A;&#x6708;&#xFF0C;&#x90FD;&#x6CA1;&#x6709;&#x52C7;&#x6C14;&#x518D;&#x5199;&#x4E0B;&#x53BB;&#xFF0C;&#x4E0D;&#x8FC7;&#x8FD8;&#x662F;&#x8981;&#x65F6;&#x4E0D;&#x65F6;&#x8BB0;&#x5F55;&#x4E00;&#x4E0B;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x53D1;&#x73B0;&#xFF0C;&#x6211;&#x53EA;&#x6709;&#x5728;&#x5199;&#x6587;&#x5B57;&#x7684;&#x65F6;&#x5019;&#x624D;&#x4F1A;&#x601D;&#x8003;&#x3002;</p>
</blockquote>

      
    </div>

    

    
    
    

    

    
      
    
    

    

    <footer class="post-footer">
      

      
      
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2019/06/16/20190616_ASR_from_begin_to_abandoned/" rel="next" title="语音识别从入门到放弃">
                <i class="fa fa-chevron-left"></i> 语音识别从入门到放弃
              </a>
            
          </div>

          <span class="post-nav-divider"></span>

          <div class="post-nav-prev post-nav-item">
            
          </div>
        </div>
      

      
      
    </footer>
  </div>
  
  
  
  </article>


  </div>


          </div>
          

  



        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap">
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview-wrap">
            站点概览
          </li>
        </ul>
      

      <div class="site-overview-wrap sidebar-panel">
        <div class="site-overview">
          <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
            
              <p class="site-author-name" itemprop="name">Kavim</p>
              <div class="site-description motion-element" itemprop="description">生活不止眼前的苟且 还有诗和远方的田野</div>
          </div>

          
            <nav class="site-state motion-element">
              
                <div class="site-state-item site-state-posts">
                
                  <a href="/archives/">
                
                    <span class="site-state-item-count">49</span>
                    <span class="site-state-item-name">日志</span>
                  </a>
                </div>
              

              
                
                
                <div class="site-state-item site-state-categories">
                  
                    
                      <a href="/categories/">
                    
                  
                    
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                    <span class="site-state-item-count">23</span>
                    <span class="site-state-item-name">分类</span>
                  </a>
                </div>
              

              
                
                
                <div class="site-state-item site-state-tags">
                  
                    
                      <a href="/tags/">
                    
                  
                    
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                    <span class="site-state-item-count">18</span>
                    <span class="site-state-item-name">标签</span>
                  </a>
                </div>
              
            </nav>
          

          

          

          

          

          
          

          
            
          
          

        </div>
      </div>

      
      <!--noindex-->
        <div class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">

            
            
            
            

            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-2"><a class="nav-link" href="#回顾和总结研一"><span class="nav-number">1.</span> <span class="nav-text">回顾和总结研一</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#研二的大致规划"><span class="nav-number">2.</span> <span class="nav-text">研二的大致规划</span></a></li></ol></div>
            

          </div>
        </div>
      <!--/noindex-->
      

      

    </div>
  </aside>
  


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright">&copy; <span itemprop="copyrightYear">2019</span>
  <span class="with-love" id="animate">
    <i class="fa fa-user"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">Kavim</span>

  

  
</div>


  <div class="powered-by">由 <a href="https://hexo.io" class="theme-link" rel="noopener" target="_blank">Hexo</a> 强力驱动 v3.2.2</div>



  <span class="post-meta-divider">|</span>



  <div class="theme-info">主题 – <a href="https://theme-next.org" class="theme-link" rel="noopener" target="_blank">NexT.Pisces</a> v7.1.0</div>




        








        
      </div>
    </footer>

    
      <div class="back-to-top">
        <i class="fa fa-arrow-up"></i>
        
      </div>
    

    

    

    
  </div>

  

<script>
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>


























  
  <script src="/lib/jquery/index.js?v=2.1.3"></script>

  
  <script src="/lib/velocity/velocity.min.js?v=1.2.1"></script>

  
  <script src="/lib/velocity/velocity.ui.min.js?v=1.2.1"></script>


  


  <script src="/js/utils.js?v=7.1.0"></script>

  <script src="/js/motion.js?v=7.1.0"></script>



  
  


  <script src="/js/affix.js?v=7.1.0"></script>

  <script src="/js/schemes/pisces.js?v=7.1.0"></script>



  
  <script src="/js/scrollspy.js?v=7.1.0"></script>
<script src="/js/post-details.js?v=7.1.0"></script>



  


  <script src="/js/next-boot.js?v=7.1.0"></script>


  

  

  

  


  


  




  

  

  

  

  

  

  

  

  

  

  

  

  

  

</body>
</html>
