<!DOCTYPE html>



  


<html class="theme-next gemini use-motion" lang="zh-Hans">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=2"/>
<meta name="theme-color" content="#222">












<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />






















<link href="/lib/font-awesome/css/font-awesome.min.css?v=4.6.2" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=6.1.0" rel="stylesheet" type="text/css" />


  <link rel="apple-touch-icon" sizes="180x180" href="/images/apple-touch-icon-next.png?v=6.1.0">


  <link rel="icon" type="image/png" sizes="32x32" href="/images/favicon-32x32-next.png?v=6.1.0">


  <link rel="icon" type="image/png" sizes="16x16" href="/images/favicon-16x16-next.png?v=6.1.0">


  <link rel="mask-icon" href="/images/logo.svg?v=6.1.0" color="#222">









<script type="text/javascript" id="hexo.configurations">
  var NexT = window.NexT || {};
  var CONFIG = {
    root: '/',
    scheme: 'Gemini',
    version: '6.1.0',
    sidebar: {"position":"left","display":"post","offset":12,"b2t":false,"scrollpercent":false,"onmobile":false},
    fancybox: false,
    fastclick: false,
    lazyload: false,
    tabs: true,
    motion: {"enable":true,"async":false,"transition":{"post_block":"fadeIn","post_header":"slideDownIn","post_body":"slideDownIn","coll_header":"slideLeftIn","sidebar":"slideUpIn"}},
    algolia: {
      applicationID: '',
      apiKey: '',
      indexName: '',
      hits: {"per_page":10},
      labels: {"input_placeholder":"Search for Posts","hits_empty":"We didn't find any results for the search: ${query}","hits_stats":"${hits} results found in ${time} ms"}
    }
  };
</script>


  




  <meta name="description" content="&amp;#x91D1;&amp;#x79CB;&amp;#x5341;&amp;#x6708;&amp;#xFF0C;&amp;#x56FD;&amp;#x5E86;7&amp;#x5929;&amp;#x5047;&amp;#xFF0C;&amp;#x6BCF;&amp;#x5929;&amp;#x5728;&amp;#x5BB6;&amp;#x770B;&amp;#x5168;&amp;#x56FD;&amp;#x5835;&amp;#x8F66;&amp;#xFF0C;&amp;#x54E6;&amp;#x4E0D;&amp;#x3001;&amp;#x5728;&amp;#x590">
<meta property="og:type" content="article">
<meta property="og:title" content="2017年10月笔记">
<meta property="og:url" content="https://xuxping.github.io/2017/10/29/2017年10月笔记/index.html">
<meta property="og:site_name" content="Kavim">
<meta property="og:description" content="&amp;#x91D1;&amp;#x79CB;&amp;#x5341;&amp;#x6708;&amp;#xFF0C;&amp;#x56FD;&amp;#x5E86;7&amp;#x5929;&amp;#x5047;&amp;#xFF0C;&amp;#x6BCF;&amp;#x5929;&amp;#x5728;&amp;#x5BB6;&amp;#x770B;&amp;#x5168;&amp;#x56FD;&amp;#x5835;&amp;#x8F66;&amp;#xFF0C;&amp;#x54E6;&amp;#x4E0D;&amp;#x3001;&amp;#x5728;&amp;#x590">
<meta property="og:image" content="https://xuxping.github.io/2017/10/29/2017年10月笔记/%E5%B1%8F%E5%B9%95%E5%BF%AB%E7%85%A7%202017-10-29%20%E4%B8%8B%E5%8D%8810.59.44.png">
<meta property="og:updated_time" content="2017-10-29T15:07:17.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="2017年10月笔记">
<meta name="twitter:description" content="&amp;#x91D1;&amp;#x79CB;&amp;#x5341;&amp;#x6708;&amp;#xFF0C;&amp;#x56FD;&amp;#x5E86;7&amp;#x5929;&amp;#x5047;&amp;#xFF0C;&amp;#x6BCF;&amp;#x5929;&amp;#x5728;&amp;#x5BB6;&amp;#x770B;&amp;#x5168;&amp;#x56FD;&amp;#x5835;&amp;#x8F66;&amp;#xFF0C;&amp;#x54E6;&amp;#x4E0D;&amp;#x3001;&amp;#x5728;&amp;#x590">
<meta name="twitter:image" content="https://xuxping.github.io/2017/10/29/2017年10月笔记/%E5%B1%8F%E5%B9%95%E5%BF%AB%E7%85%A7%202017-10-29%20%E4%B8%8B%E5%8D%8810.59.44.png">






  <link rel="canonical" href="https://xuxping.github.io/2017/10/29/2017年10月笔记/"/>



<script type="text/javascript" id="page.configurations">
  CONFIG.page = {
    sidebar: "",
  };
</script>

  <title>2017年10月笔记 | Kavim</title>
  









  <noscript>
  <style type="text/css">
    .use-motion .motion-element,
    .use-motion .brand,
    .use-motion .menu-item,
    .sidebar-inner,
    .use-motion .post-block,
    .use-motion .pagination,
    .use-motion .comments,
    .use-motion .post-header,
    .use-motion .post-body,
    .use-motion .collection-title { opacity: initial; }

    .use-motion .logo,
    .use-motion .site-title,
    .use-motion .site-subtitle {
      opacity: initial;
      top: initial;
    }

    .use-motion {
      .logo-line-before i { left: initial; }
      .logo-line-after i { right: initial; }
    }
  </style>
</noscript>

</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  
  
    
  

  <div class="container sidebar-position-left page-post-detail">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"> 

<div class="site-brand-wrapper">
  <div class="site-meta ">
    

    <div class="custom-logo-site-title">
      <a href="/" class="brand" rel="start">
        <span class="logo-line-before"><i></i></span>
        <span class="site-title">Kavim</span>
        <span class="logo-line-after"><i></i></span>
      </a>
    </div>
      
        <p class="site-subtitle">一点一滴积累</p>
      
  </div>

  <div class="site-nav-toggle">
    <button aria-label="Toggle navigation bar">
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
    </button>
  </div>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        
          
  <li class="menu-item menu-item-home">
    <a href="/" rel="section">
      <i class="menu-item-icon fa fa-fw fa-home"></i> <br />Home</a>
</li>

      
        
        
          
  <li class="menu-item menu-item-archives">
    <a href="/archives/" rel="section">
      <i class="menu-item-icon fa fa-fw fa-archive"></i> <br />Archives</a>
</li>

      

      
    </ul>
  

  

  
</nav>


  



 </div>
    </header>

    


    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          
            

          
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  

  
  
  

  

  <article class="post post-type-normal" itemscope itemtype="http://schema.org/Article">
  
  
  
  <div class="post-block">
    <link itemprop="mainEntityOfPage" href="https://xuxping.github.io/2017/10/29/2017年10月笔记/">

    <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
      <meta itemprop="name" content="Kavim">
      <meta itemprop="description" content="">
      <meta itemprop="image" content="/images/avatar.gif">
    </span>

    <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
      <meta itemprop="name" content="Kavim">
    </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">2017年10月笔记</h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              
                <span class="post-meta-item-text">Posted on</span>
              
              <time title="Post created" itemprop="dateCreated datePublished" datetime="2017-10-29T23:12:29+08:00">2017-10-29</time>
            

            
            

            
          </span>

          
            <span class="post-category" >
            
              <span class="post-meta-divider">|</span>
            
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              
                <span class="post-meta-item-text">In</span>
              
              
                <span itemprop="about" itemscope itemtype="http://schema.org/Thing"><a href="/categories/个人笔记/" itemprop="url" rel="index"><span itemprop="name">个人笔记</span></a></span>

                
                
              
            </span>
          

          
            
          

          
          

          

          

          

        </div>
      </header>
    

    
    
    
    <div class="post-body" itemprop="articleBody">

      
      

      
        <p><img src="/2017/10/29/2017&#x5E74;10&#x6708;&#x7B14;&#x8BB0;/%E5%B1%8F%E5%B9%95%E5%BF%AB%E7%85%A7%202017-10-29%20%E4%B8%8B%E5%8D%8810.59.44.png" alt=""></p>
<p>&#x91D1;&#x79CB;&#x5341;&#x6708;&#xFF0C;&#x56FD;&#x5E86;7&#x5929;&#x5047;&#xFF0C;&#x6BCF;&#x5929;&#x5728;&#x5BB6;&#x770B;&#x5168;&#x56FD;&#x5835;&#x8F66;&#xFF0C;&#x54E6;&#x4E0D;&#x3001;&#x5728;&#x590D;&#x4E60;&#x9AD8;&#x6570;&#xFF1B;&#x521D;&#x5165;&#x80A1;&#x5E02;&#xFF0C;&#x5C0F;&#x8D5A;&#x4E24;&#x5F20;&#x7535;&#x5F71;&#x7968;&#x94B1;&#x3002;&#x5145;&#x5F53;&#x9762;&#x8BD5;&#x5B98;&#xFF0C;&#x8EAB;&#x5FC3;&#x4FF1;&#x7D2F;&#x3002;&#x672C;&#x6708;&#x4F9D;&#x7136;&#x53EA;&#x770B;&#x4E86;&#x4E00;&#x672C;&#x4E66;&#x2014;&#x2014;&#x2014;&#x2014;&#x300A;&#x7A77;&#x7238;&#x7238;&#xFF0C;&#x5BCC;&#x7238;&#x7238;&#x300B;&#xFF0C;&#x867D;&#x7136;&#x6CA1;&#x94B1;&#xFF0C;&#x4F46;&#x4F9D;&#x7136;&#x5F00;&#x542F;&#x4E86;&#x4E2A;&#x4EBA;&#x7406;&#x8D22;&#x4E4B;&#x8DEF;&#x3002;<br><a id="more"></a></p>
<h2 id="&#x300A;&#x7A77;&#x7238;&#x7238;&#xFF0C;&#x5BCC;&#x7238;&#x7238;&#x300B;"><a href="#&#x300A;&#x7A77;&#x7238;&#x7238;&#xFF0C;&#x5BCC;&#x7238;&#x7238;&#x300B;" class="headerlink" title="&#x300A;&#x7A77;&#x7238;&#x7238;&#xFF0C;&#x5BCC;&#x7238;&#x7238;&#x300B;"></a>&#x300A;&#x7A77;&#x7238;&#x7238;&#xFF0C;&#x5BCC;&#x7238;&#x7238;&#x300B;</h2><p>&#x7F57;&#x4F2F;&#x7279;&#xB7;T&#xB7;&#x6E05;&#x5D0E;&#x901A;&#x8FC7;&#x8BB2;&#x8FF0;&#x4ED6;&#x7684;&#x4E24;&#x4F4D;&#x7238;&#x7238;&#xFF0C;&#x7A77;&#x7238;&#x7238;&#x2014;&#x2014;&#x8EAB;&#x4E3A;&#x5927;&#x5B66;&#x6559;&#x6388;&#x7684;&#x751F;&#x7236;&#xFF0C;&#x5BCC;&#x7238;&#x7238;&#x2014;&#x2014;&#x5584;&#x4E8E;&#x6295;&#x8D44;&#x7406;&#x8D22;&#x7684;&#x670B;&#x53CB;&#x7684;&#x7236;&#x4EB2;&#xFF0C;&#x5728;&#x91D1;&#x94B1;&#x4EF7;&#x503C;&#x89C2;&#x3001;&#x6295;&#x8D44;&#x7406;&#x5FF5;&#x7684;&#x622A;&#x7136;&#x4E0D;&#x540C;&#xFF0C;&#x4EE5;&#x53CA;&#x6700;&#x7EC8;&#x751F;&#x6D3B;&#x65B9;&#x5F0F;&#x3001;&#x8D22;&#x52A1;&#x72B6;&#x51B5;&#x7684;&#x4E0D;&#x540C;&#x7ED3;&#x5C40;&#x3002;&#x63A8;&#x7FFB;&#x4E86;&#x201C;&#x9AD8;&#x85AA;=&#x8D22;&#x52A1;&#x81EA;&#x7531;&#x201D;&#x7684;&#x8D22;&#x5BCC;&#x6CD5;&#x5219;&#x3002;&#x4E66;&#x4E2D;&#x544A;&#x8BC9;&#x8BFB;&#x8005;&#x8981;&#x5206;&#x6E05;&#x8D44;&#x4EA7;&#x4E0E;&#x8D1F;&#x503A;&#xFF0C;&#x4ECE;&#x5BB9;&#x9762;&#x5BF9;&#x4E2A;&#x4EBA;&#x8D22;&#x5BCC;&#x7684;&#x53D8;&#x5316;&#xFF0C;&#x4E0D;&#x8981;&#x505A;&#x91D1;&#x94B1;&#x7684;&#x52AA;&#x529B;&#xFF0C;&#x8981;&#x8BA9;&#x91D1;&#x94B1;&#x4E3A;&#x6211;&#x4EEC;&#x5DE5;&#x4F5C;&#xFF0C;&#x4ECE;&#x800C;&#x6700;&#x7EC8;&#x8FBE;&#x5230;&#x8D22;&#x52A1;&#x81EA;&#x7531;&#x7684;&#x6700;&#x9AD8;&#x5883;&#x754C;&#x3002;</p>
<p>&#x770B;&#x8FD9;&#x672C;&#x4E66;&#xFF0C;&#x6211;&#x4E00;&#x76F4;&#x5728;&#x601D;&#x8003;&#x4E70;&#x623F;&#x5230;&#x5E95;&#x662F;&#x8D44;&#x4EA7;&#x8FD8;&#x8D1F;&#x503A;&#x3002;&#x5BF9;&#x4E8E;&#x5BCC;&#x4EBA;&#x6765;&#x8BF4;&#xFF0C;&#x623F;&#x5B50;&#x662F;&#x8D44;&#x4EA7;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x623F;&#x5B50;&#x4EA4;&#x6613;&#xFF0C;&#x83B7;&#x53D6;&#x91D1;&#x94B1;&#x3002;&#x5BF9;&#x4E8E;&#x7A77;&#x4EBA;&#x6765;&#x8BF4;&#xFF0C;&#x623F;&#x5B50;&#x7B97;&#x662F;&#x8D1F;&#x503A;&#x3002;&#x7A77;&#x4EBA;&#x4E70;&#x623F;&#x4E00;&#x822C;&#x8981;&#x4E3E;&#x503A;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x4F1A;&#x5438;&#x53BB;&#x5927;&#x90E8;&#x5206;&#x73B0;&#x6709;&#x8D44;&#x4EA7;&#xFF0C;&#x8FD8;&#x8981;&#x80CC;&#x8D1F;&#x51E0;&#x5341;&#x5E74;&#x7684;&#x8D1F;&#x503A;&#x3002;&#x4E00;&#x65E6;&#x80CC;&#x8D1F;&#x4E86;&#x94F6;&#x884C;&#x51E0;&#x5341;&#x5E74;&#x7684;&#x8D1F;&#x503A;&#xFF0C;&#x7A77;&#x4EBA;&#x57FA;&#x672C;&#x4E0A;&#x8FD9;&#x4E00;&#x751F;&#x7684;&#x8F68;&#x8FF9;&#x5C31;&#x786E;&#x5B9A;&#x4E86;&#xFF0C;&#x52AA;&#x529B;&#x5DE5;&#x4F5C;&#xFF0C;&#x7ED9;&#x94F6;&#x884C;&#x8D5A;&#x94B1;&#x3002;&#x4ED6;&#x4EEC;&#x4E0D;&#x6562;&#x8F9E;&#x804C;&#xFF0C;&#x4E0D;&#x6562;&#x53BB;&#x8FFD;&#x6C42;&#x81EA;&#x5DF1;&#x7684;&#x4E8B;&#x4E1A;&#xFF0C;&#x6015;&#x8FD8;&#x4E0D;&#x8D77;&#x8D37;&#x6B3E;&#x3002;&#x6709;&#x53EF;&#x80FD;&#x4E70;&#x4E86;&#x623F;&#x5B50;&#x4E4B;&#x540E;&#xFF0C;&#x81EA;&#x5DF1;&#x4E5F;&#x4F4F;&#x4E0D;&#x8D77;&#x3002;&#x6211;&#x4E00;&#x4E2A;&#x540C;&#x4E8B;&#xFF0C;&#x5728;&#x5317;&#x4EAC;&#x4E70;&#x623F;&#x540E;&#xFF0C;&#x4ECD;&#x7136;&#x79DF;&#x623F;&#x4F4F;&#xFF0C;&#x628A;&#x81EA;&#x5DF1;&#x7684;&#x623F;&#x5B50;&#x79DF;&#x51FA;&#x53BB;&#xFF0C;&#x8D5A;&#x53D6;&#x5DEE;&#x503C;&#x7528;&#x4E8E;&#x8FD8;&#x8D37;&#x3002;&#x90A3;&#x7A77;&#x4EBA;&#x4E5F;&#x53EF;&#x4EE5;&#x628A;&#x623F;&#x5B50;&#x5356;&#x4E86;&#x554A;&#xFF0C;&#x4F46;&#x662F;&#x5EF6;&#x7EED;&#x51E0;&#x5343;&#x5E74;&#x7684;&#x89C2;&#x5FF5;&#x57FA;&#x672C;&#x8BA9;&#x4ED6;&#x4EEC;&#x4E0D;&#x4F1A;&#x5356;&#x6389;&#x81EA;&#x5DF1;&#x7684;&#x623F;&#x5B50;&#x3002;</p>
<p>&#x6211;&#x60F3;&#x8981;&#x8D22;&#x5BCC;&#x81EA;&#x7531;&#xFF0C;10&#x5E74;&#x540E;&#x5C31;&#x4E0D;&#x4E3A;&#x4E07;&#x6076;&#x7684;&#x8D44;&#x672C;&#x4E3B;&#x4E49;&#x5DE5;&#x4F5C;&#x4E86;&#xFF0C;&#x800C;&#x662F;&#x5E72;&#x81EA;&#x5DF1;&#x60F3;&#x5E72;&#x7684;&#x4E8B;&#x3002;&#x5982;&#x679C;&#x6211;&#x4E5F;&#x4E70;&#x4E86;&#x623F;&#xFF0C;&#x6211;&#x4F30;&#x8BA1;&#x4E5F;&#x4F1A;&#x53D8;&#x6210;&#x7A77;&#x4EBA;&#x90A3;&#x6837;&#xFF0C;&#x6BCF;&#x6708;&#x8D5A;&#x70B9;&#x5DE5;&#x8D44;&#xFF0C;&#x7ED9;&#x653F;&#x5E9C;&#x4EA4;&#x7A0E;&#xFF0C;&#x4EA4;&#x516C;&#x79EF;&#x91D1;&#xFF0C;&#x7ED9;&#x94F6;&#x884C;&#x8FD8;&#x8D37;&#xFF0C;&#x7ED9;&#x5546;&#x5BB6;&#x4EA4;&#x94B1;&#xFF0C;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x624D;&#x662F;&#x7ED9;&#x81EA;&#x5DF1;&#x8D5A;&#x94B1;&#xFF1F;</p>
<p>&#x8FD9;&#x672C;&#x4E66;&#x5E94;&#x8BE5;&#x662F;&#x8BA9;&#x6211;&#x7684;&#x89C2;&#x5FF5;&#x6709;&#x4E86;&#x4E00;&#x4E2A;&#x5C0F;&#x5C0F;&#x7684;&#x8F6C;&#x53D8;&#x5427;&#xFF0C;&#x5B81;&#x613F;&#x79DF;&#x623F;&#x6216;&#x8005;&#x56DE;&#x5BB6;&#x4FEE;&#x4E5F;&#x4E0D;&#x4E70;&#x623F;&#xFF0C;&#x601D;&#x8003;&#x81EA;&#x5DF1;&#x5982;&#x4F55;&#x4E0D;&#x843D;&#x5165;&#x7A77;&#x4EBA;&#x7684;&#x601D;&#x7EF4;&#x9677;&#x9631;&#x4E2D;&#xFF0C;&#x601D;&#x8003;&#x5982;&#x4F55;&#x8BA9;&#x81EA;&#x5DF1;&#x73B0;&#x6709;&#x7684;&#x8D44;&#x4EA7;&#x4EA7;&#x751F;&#x6E90;&#x6E90;&#x4E0D;&#x65AD;&#x7684;&#x6536;&#x5165;&#x3002;&#x5982;&#x679C;&#x6709;&#x4E00;&#x5929;&#xFF0C;&#x6BCF;&#x5929;&#x73B0;&#x6709;&#x8D44;&#x4EA7;&#x4EA7;&#x751F;&#x7684;&#x6536;&#x76CA;&#x8FBE;&#x5230;&#x4E86;&#x5DE5;&#x4F5C;&#x4E00;&#x5929;&#x4EA7;&#x751F;&#x7684;&#x5DE5;&#x8D44;&#xFF0C;&#x6211;&#x5C31;&#x53EF;&#x4EE5;&#x53BB;&#x5E72;&#x81EA;&#x5DF1;&#x7684;&#x4E8B;&#x60C5;&#x4E86;&#x3002;&#x73B0;&#x5728;&#x6211;&#x5DF2;&#x7ECF;&#x5F00;&#x59CB;&#x884C;&#x52A8;&#x4E86;&#xFF0C;&#x5C06;&#x81EA;&#x5DF1;&#x6BCF;&#x6708;&#x5269;&#x4E0B;&#x7684;&#x94B1;&#x6295;&#x8D44;&#x57FA;&#x91D1;&#xFF0C;&#x6295;&#x8D44;&#x80A1;&#x7968;&#xFF0C;&#x6295;&#x8D44;&#x8BC1;&#x5238;&#x3002;&#x4E24;&#x5468;&#x4E0B;&#x6765;&#xFF0C;&#x4EA7;&#x751F;&#x4E86;&#x5DEE;&#x4E0D;&#x591A;150&#x5143;&#x7684;&#x6536;&#x5165;&#x5427;&#xFF0C;&#x867D;&#x7136;&#x5C11;&#xFF0C;&#x4F46;&#x662F;&#x6709;&#x70B9;&#x70B9;&#x611F;&#x89C9;&#x4E86;&#x3002;</p>
<p>&#x5173;&#x4E8E;&#x91D1;&#x94B1;&#x7684;&#x89C2;&#x5FF5;&#x7684;&#x662F;&#x5F88;&#x96BE;&#x8FDB;&#x884C;&#x8F6C;&#x53D8;&#x7684;&#xFF0C;&#x9700;&#x8981;&#x53CD;&#x590D;&#x7684;&#x8FDB;&#x884C;&#x52A0;&#x5F3A;&#xFF0C;&#x5F62;&#x6210;&#x81EA;&#x5DF1;&#x7684;&#x89C2;&#x5FF5;&#xFF0C;&#x4E0D;&#x968F;&#x5927;&#x6D41;&#xFF0C;&#x843D;&#x5165;&#x7A77;&#x4EBA;&#x7684;&#x89C2;&#x5FF5;&#x4E2D;&#x3002;&#x522B;&#x4EBA;&#x8D2B;&#x7A77;&#x9650;&#x5236;&#x4E86;&#x4F60;&#x7684;&#x601D;&#x60F3;&#x3002;</p>
<h2 id="&#x9762;&#x8BD5;&#x5B98;&#x8FD8;&#x4E0D;&#x5982;&#x641E;&#x7A0B;&#x5E8F;"><a href="#&#x9762;&#x8BD5;&#x5B98;&#x8FD8;&#x4E0D;&#x5982;&#x641E;&#x7A0B;&#x5E8F;" class="headerlink" title="&#x9762;&#x8BD5;&#x5B98;&#x8FD8;&#x4E0D;&#x5982;&#x641E;&#x7A0B;&#x5E8F;"></a>&#x9762;&#x8BD5;&#x5B98;&#x8FD8;&#x4E0D;&#x5982;&#x641E;&#x7A0B;&#x5E8F;</h2><p>&#x505A;&#x4E86;&#x4E00;&#x5468;&#x7684;&#x9762;&#x8BD5;&#x5B98;&#xFF0C;&#x603B;&#x5171;&#x770B;&#x4E86;40&#x591A;&#x4EFD;&#x7B80;&#x5386;&#xFF0C;&#x9762;&#x8BD5;&#x4E86;8&#x4E2A;&#x4EBA;&#xFF0C;&#x65E0;&#x4E00;&#x4EBA;&#x5408;&#x9002;&#x3002;&#x7B2C;&#x4E00;&#x5929;&#x9762;&#x4E86;3&#x4E2A;&#x4EBA;&#xFF0C;&#x611F;&#x89C9;&#x6574;&#x4E2A;&#x4EBA;&#x90FD;&#x61F5;&#x4E86;&#xFF0C;&#x4ECE;&#x6765;&#x6CA1;&#x6709;&#x611F;&#x89C9;&#x5230;&#x8FD9;&#x4E48;&#x7D2F;&#xFF0C;&#x5FC3;&#x7D2F;&#xFF0C;&#x8111;&#x7D2F;&#xFF0C;&#x8EAB;&#x4F53;&#x4E5F;&#x7D2F;&#xFF0C;&#x6BD4;&#x5199;&#x4E00;&#x5929;&#x7A0B;&#x5E8F;&#x8FD8;&#x7D2F;&#x3002;&#x5E73;&#x65F6;&#x4E00;&#x5929;&#x8BF4;&#x8BDD;&#x4E0D;&#x8D85;&#x8FC7;2000&#x4E2A;&#x5B57;&#x5427;&#xFF0C;&#x8FD9;&#x4E00;&#x5929;&#x8981;&#x54D4;&#x54D4;&#x4E00;&#x4E07;&#x5B57;&#x4EE5;&#x4E0A;&#xFF0C;&#x4E0D;&#x505C;&#x7684;&#x95EE;&#x95EE;&#x9898;&#xFF0C;&#x601D;&#x8003;&#x5BF9;&#x9762;&#x5750;&#x7684;&#x9762;&#x8BD5;&#x8005;&#x662F;&#x600E;&#x6837;&#x7684;&#x4E00;&#x4E2A;&#x4EBA;&#xFF0C;&#x662F;&#x5426;&#x80FD;&#x591F;&#x6EE1;&#x8DB3;&#x62DB;&#x8058;&#x7684;&#x8981;&#x6C42;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x90E8;&#x95E8;&#x4E3B;&#x8981;&#x62DB;&#x8058;&#x5177;&#x6709;&#x4E24;&#x5E74;&#x4EE5;&#x4E0A;&#x7684;&#x5168;&#x6808;&#x504F;&#x524D;&#x7AEF;&#x7684;&#x5DE5;&#x7A0B;&#x5E08;&#x3002;&#x603B;&#x7ED3;&#x4E00;&#x4E0B;&#x8FD9;&#x51E0;&#x5929;&#x9047;&#x5230;&#x7684;&#x95EE;&#x9898;&#xFF1A;<br>1&#x3001;&#x6295;&#x7B80;&#x5386;&#x7684;&#x4EBA;&#x90FD;&#x4E0D;&#x4ED4;&#x7EC6;&#x770B;&#x62DB;&#x8058;&#x8981;&#x6C42;&#xFF0C;&#x611F;&#x89C9;&#x90FD;&#x9ED8;&#x8BA4;&#x81EA;&#x5DF1;&#x6EE1;&#x8DB3;&#x804C;&#x4F4D;&#x8981;&#x6C42;&#x4E86;&#x3002;<br>2&#x3001;&#x5927;&#x90E8;&#x5206;&#x7B80;&#x5386;&#x5199;&#x7684;&#x6211;&#x90FD;&#x4E0D;&#x60F3;&#x770B;&#xFF0C;&#x4E07;&#x7CBE;&#x6CB9;&#x5F0F;&#x7684;&#x6280;&#x80FD;&#x5217;&#x8868;&#x548C;&#x81EA;&#x6211;&#x8BC4;&#x4EF7;&#xFF0C;&#x5404;&#x79CD;&#x7CBE;&#x901A;&#x7684;&#x8BED;&#x8A00;&#xFF0C;&#x91CD;&#x590D;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4E09;&#x56DB;&#x9875;&#x7684;&#x957F;&#x7BC7;&#x5927;&#x8BBA;&#xFF0C;&#x901A;&#x7528;&#x7684;&#x7B80;&#x5386;&#x3002;<br>3&#x3001;&#x5BF9;&#x4E8E;&#x6280;&#x80FD;&#xFF0C;&#x4E0D;&#x8981;&#x5199;&#x7CBE;&#x901A;&#x3002;&#x5BF9;&#x4E8E;&#x53EA;&#x4E86;&#x89E3;&#x8FC7;&#x5F97;&#x4E1C;&#x897F;&#xFF0C;&#x4E0D;&#x8981;&#x5199;&#x6210;&#x719F;&#x6089;&#x4F7F;&#x7528;&#xFF0C;&#x4E00;&#x95EE;&#x5C31;&#x61F5;&#x903C;&#x3002;<br>4&#x3001;&#x9762;&#x8BD5;&#x8005;&#x4E0D;&#x80FD;&#x5F88;&#x597D;&#x7684;&#x63CF;&#x8FF0;&#x81EA;&#x5DF1;&#x6240;&#x505A;&#x7684;&#x9879;&#x76EE;&#xFF0C;&#x8BA9;&#x4EBA;&#x611F;&#x89C9;&#x4ED6;&#x5C31;&#x662F;&#x5728;&#x91CC;&#x9762;&#x6253;&#x4E2A;&#x9171;&#x6CB9;&#x5440;&#x3002;<br>5&#x3001;&#x4E0D;&#x8981;&#x4E0A;&#x6765;&#x5C31;&#x55B7;&#x524D;&#x516C;&#x53F8;&#xFF0C;&#x5206;&#x5206;&#x949F;&#x5C31;&#x4E0D;&#x60F3;&#x804A;&#x4E86;&#xFF0C;&#x788D;&#x4E8E;&#x793C;&#x8C8C;&#xFF0C;&#x53EA;&#x80FD;&#x5C2C;&#x804A;&#x4E86;&#x3002;<br>6&#x3001;&#x673A;&#x8BD5;&#x76F4;&#x63A5;&#x5C31;&#x80FD;&#x53CD;&#x6620;&#x6C34;&#x5E73;&#xFF0C;&#x770B;&#x5230;&#x4F5C;&#x54C1;&#xFF0C;&#x6211;&#x5C31;&#x77E5;&#x9053;&#x4F60;&#x6EE1;&#x4E0D;&#x6EE1;&#x8DB3;&#x8981;&#x6C42;&#x4E86;&#xFF0C;&#x968F;&#x4FBF;&#x7CCA;&#x5F04;&#x4E00;&#x4E0B;&#x662F;&#x4E0D;&#x884C;&#x7684;&#x3002;<br>&#x8FD8;&#x6709;&#x5F88;&#x591A;&#xFF0C;&#x6211;&#x5C31;&#x4E0D;&#x4E00;&#x4E00;&#x5217;&#x4E3E;&#x4E86;&#x3002;</p>
<p>&#x5927;&#x81F4;&#x770B;&#x4E86;&#x4E00;&#x4E9B;&#xFF0C;&#x9762;&#x8BD5;&#x8005;&#x90FD;&#x662F;&#x5927;&#x4E13;&#x6587;&#x51ED;&#xFF0C;&#x5BF9;&#x9762;&#x8BD5;&#x90FD;&#x4E0D;&#x7528;&#x5FC3;&#xFF0C;&#x611F;&#x89C9;&#x5C31;&#x662F;&#x81EA;&#x5DF1;&#x968F;&#x4FBF;&#x9762;&#x9762;&#x5C31;&#x80FD;&#x8FC7;&#x7684;&#x4EBA;&#x3002;&#x62DB;&#x4EBA;&#x771F;&#x662F;&#x4E00;&#x4E2A;&#x9EBB;&#x70E6;&#x7684;&#x4E8B;&#xFF0C;&#x7EC8;&#x4E8E;&#x611F;&#x89C9;&#x5230;HR&#x7684;&#x4E0D;&#x5BB9;&#x6613;&#x4E86;&#x3002;</p>
<p>&#x5F53;&#x7136;&#x5F53;&#x9762;&#x8BD5;&#x5B98;&#x8FD9;&#x4E00;&#x5468;&#xFF0C;&#x81EA;&#x5DF1;&#x7684;&#x6536;&#x83B7;&#x8FD8;&#x662F;&#x5F88;&#x591A;&#x7684;&#x3002;<br>1&#x3001;&#x5728;&#x7F51;&#x4E0A;&#x63D0;&#x524D;&#x53BB;&#x8DDF;&#x9762;&#x8BD5;&#x8005;&#x804A;&#x4E00;&#x51E0;&#x53E5;&#xFF0C;&#x5982;&#x679C;&#x5408;&#x9002;&#x7EE7;&#x7EED;&#x804A;&#x4E0B;&#x53BB;&#xFF0C;&#x4E0D;&#x884C;&#x5C31;&#x62D2;&#x7EDD;&#x4E86;<br>2&#x3001;&#x81EA;&#x5DF1;&#x6839;&#x636E;&#x62DB;&#x8058;&#x7684;&#x8981;&#x6C42;&#xFF0C;&#x53BB;&#x8BBE;&#x8BA1;&#x95EE;&#x9898;&#xFF0C;&#x4ECE;&#x57FA;&#x7840;&#xFF0C;&#x5230;&#x9879;&#x76EE;&#x5E94;&#x7528;&#xFF0C;&#x5230;&#x5F00;&#x653E;&#x5F0F;&#x7684;&#x95EE;&#x9898;&#x6765;&#x5168;&#x9762;&#x8003;&#x5BDF;&#x4E00;&#x4E2A;&#x6C42;&#x804C;&#x4EBA;&#x7684;&#x7EFC;&#x5408;&#x7D20;&#x8D28;<br>3&#x3001;&#x9762;&#x8BD5;&#x4E2D;&#xFF0C;&#x968F;&#x673A;&#x5E94;&#x53D8;&#xFF0C;&#x6839;&#x636E;&#x9762;&#x8BD5;&#x8005;&#x56DE;&#x7B54;&#xFF0C;&#x8BBE;&#x8BA1;&#x95EE;&#x9898;&#xFF0C;&#x6DF1;&#x5165;&#x53BB;&#x6316;&#x6398;&#x9762;&#x8BD5;&#x8005;&#x80FD;&#x529B;<br>4&#x3001;&#x679C;&#x65AD;&#x7684;&#x62D2;&#x7EDD;&#x80FD;&#x529B;&#xFF0C;&#x5BF9;&#x4E8E;&#x4E0D;&#x884C;&#x7684;&#x9762;&#x8BD5;&#x8005;&#xFF0C;&#x679C;&#x65AD;&#x62D2;&#x7EDD;&#xFF0C;&#x4E0D;&#x4F1A;&#x4EC1;&#x6148;&#x8BA9;&#x5176;&#x8FDB;&#x5165;&#x4E8C;&#x9762;&#x3002;<br>5&#x3001;&#x5982;&#x4F55;&#x8BC4;&#x5224;&#x4E00;&#x4E2A;&#x6280;&#x672F;&#x4EBA;&#x7684;&#xFF0C;&#x6839;&#x636E;&#x9762;&#x8BD5;&#x8005;&#x7684;&#x56DE;&#x7B54;&#xFF0C;&#x5BF9;&#x9762;&#x8BD5;&#x8005;&#x7684;&#x6280;&#x672F;&#x80FD;&#x529B;&#xFF0C;&#x5E94;&#x7528;&#x80FD;&#x529B;&#xFF0C;&#x5B66;&#x4E60;&#x80FD;&#x529B;&#xFF0C;&#x968F;&#x673A;&#x5E94;&#x53D8;&#x80FD;&#x529B;&#x8FDB;&#x884C;&#x8003;&#x5BDF;&#x3002;</p>
<p>&#x81EA;&#x5DF1;&#x7684;&#x9762;&#x8BD5;&#x7ECF;&#x9A8C;&#x592A;&#x5C11;&#xFF0C;&#x53C2;&#x52A0;&#x5DE5;&#x4F5C;&#x5C31;&#x8FDB;&#x884C;&#x4E86;&#x4E24;&#x6B21;&#x9762;&#x8BD5;&#x5427;&#x3002;&#x6700;&#x540E;&#x6839;&#x636E;&#x4E00;&#x4E9B;&#x7ECF;&#x9A8C;&#xFF0C;&#x6539;&#x4E86;&#x6539;&#x81EA;&#x5DF1;&#x7684;&#x7B80;&#x5386;&#x3002;</p>
<h2 id="&#x8003;&#x7814;&#x590D;&#x4E60;&#x603B;&#x7ED3;"><a href="#&#x8003;&#x7814;&#x590D;&#x4E60;&#x603B;&#x7ED3;" class="headerlink" title="&#x8003;&#x7814;&#x590D;&#x4E60;&#x603B;&#x7ED3;"></a>&#x8003;&#x7814;&#x590D;&#x4E60;&#x603B;&#x7ED3;</h2><p>&#x672C;&#x6708;&#x590D;&#x4E60;&#x5B8C;&#x4E86;&#x4E00;&#x8F6E;&#x9AD8;&#x6570;&#xFF0C;&#x4F46;&#x662F;&#x611F;&#x89C9;&#x81EA;&#x5DF1;&#x5B9E;&#x5728;&#x590D;&#x4E60;&#x4E0D;&#x5B8C;&#x4E86;&#xFF0C;&#x6839;&#x636E;&#x81EA;&#x5DF1;&#x7684;&#x7279;&#x70B9;&#xFF0C;&#x6539;&#x6210;&#x4E86;&#x76F4;&#x63A5;&#x62A5;&#x8003;&#x5317;&#x822A;&#x8F6F;&#x4EF6;&#x5B66;&#x9662;&#x7684;&#x975E;&#x5168;&#x7814;&#x7A76;&#x751F;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x8003;&#x8BA1;&#x7B97;&#x673A;&#x5B66;&#x9662;&#xFF0C;&#x4E00;&#x4E0B;&#x5C06;&#x539F;&#x6765;&#x7684;&#x590D;&#x4E60;&#x8303;&#x56F4;&#x51CF;&#x5C11;&#x4E86;40%&#x5DE6;&#x53F3;&#xFF0C;&#x800C;&#x4E14;&#x4E13;&#x4E1A;&#x7531;961(&#x8BA1;&#x7B97;&#x673A;&#x57FA;&#x7840;&#x7EFC;&#x5408;)&#x53D8;&#x6210;991(&#x6570;&#x636E;&#x7ED3;&#x6784;&#x548C;C)&#xFF0C;&#x8FD9;&#x80FD;&#x63D0;&#x9AD8;&#x8003;&#x8FC7;&#x7684;&#x6982;&#x7387;&#x3002;<br>&#x672C;&#x6708;&#x5F00;&#x59CB;&#x4E86;&#x7EBF;&#x6027;&#x4EE3;&#x6570;&#x7684;&#x590D;&#x4E60;&#xFF0C;&#x4F46;&#x662F;&#x53EA;&#x590D;&#x4E60;&#x4E86;&#x4E00;&#x534A;&#xFF0C;&#x611F;&#x89C9;&#x6709;&#x70B9;&#x5403;&#x529B;&#x3002;&#x4E70;&#x4E86;&#x4E00;&#x5957;&#x82F1;&#x8BED;&#x89C6;&#x9891;&#x6559;&#x5B66;&#xFF0C;&#x51C6;&#x5907;&#x5728;&#x4E0A;&#x4E0B;&#x73ED;&#x8DEF;&#x4E0A;&#x542C;&#x3002;&#x8FB9;&#x4E0A;&#x73ED;&#x8FB9;&#x590D;&#x4E60;&#xFF0C;&#x8BA9;&#x6211;&#x7684;&#x751F;&#x6D3B;&#x5F88;&#x5145;&#x5B9E;&#x3002;</p>

      
    </div>

    

    
    
    

    

    

    

    <footer class="post-footer">
      

      
      
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2017/10/10/Hadoop的磁盘写入策略引发的问题/" rel="next" title="Hadoop的磁盘写入策略引发的问题">
                <i class="fa fa-chevron-left"></i> Hadoop的磁盘写入策略引发的问题
              </a>
            
          </div>

          <span class="post-nav-divider"></span>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2017/11/04/guava版本引起的问题/" rel="prev" title="问题--guava版本">
                问题--guava版本 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </div>
  
  
  
  </article>



    <div class="post-spread">
      
    </div>
  </div>


          </div>
          

  



        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap">
            Table of Contents
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview-wrap">
            Overview
          </li>
        </ul>
      

      <section class="site-overview-wrap sidebar-panel">
        <div class="site-overview">
          <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
            
              <p class="site-author-name" itemprop="name">Kavim</p>
              <p class="site-description motion-element" itemprop="description">生活不止眼前的苟且 还有诗和远方的田野</p>
          </div>

          
            <nav class="site-state motion-element">
              
                <div class="site-state-item site-state-posts">
                
                  <a href="/archives/">
                
                    <span class="site-state-item-count">44</span>
                    <span class="site-state-item-name">posts</span>
                  </a>
                </div>
              

              
                
                
                <div class="site-state-item site-state-categories">
                  <a href="/categories/index.html">
                    
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                    <span class="site-state-item-count">19</span>
                    <span class="site-state-item-name">categories</span>
                  </a>
                </div>
              

              
                
                
                <div class="site-state-item site-state-tags">
                  <a href="/tags/index.html">
                    
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                    <span class="site-state-item-count">18</span>
                    <span class="site-state-item-name">tags</span>
                  </a>
                </div>
              
            </nav>
          

          

          

          
          

          
          

          
            
          
          

        </div>
      </section>

      
      <!--noindex-->
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">

            
              
            

            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-2"><a class="nav-link" href="#《穷爸爸，富爸爸》"><span class="nav-number">1.</span> <span class="nav-text">《穷爸爸，富爸爸》</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#面试官还不如搞程序"><span class="nav-number">2.</span> <span class="nav-text">面试官还不如搞程序</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#考研复习总结"><span class="nav-number">3.</span> <span class="nav-text">考研复习总结</span></a></li></ol></div>
            

          </div>
        </section>
      <!--/noindex-->
      

      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright">&copy; <span itemprop="copyrightYear">2018</span>
  <span class="with-love" id="animate"> 
    <i class="fa fa-user"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">Kavim</span>

  

  
</div>




  <div class="powered-by">Powered by <a class="theme-link" target="_blank" href="https://hexo.io">Hexo</a></div>



  <span class="post-meta-divider">|</span>



  <div class="theme-info">Theme &mdash; <a class="theme-link" target="_blank" href="https://github.com/theme-next/hexo-theme-next">NexT.Gemini</a> v6.1.0</div>




        








        
      </div>
    </footer>

    
      <div class="back-to-top">
        <i class="fa fa-arrow-up"></i>
        
      </div>
    

    

  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>


























  
  
    <script type="text/javascript" src="/lib/jquery/index.js?v=2.1.3"></script>
  

  
  
    <script type="text/javascript" src="/lib/velocity/velocity.min.js?v=1.2.1"></script>
  

  
  
    <script type="text/javascript" src="/lib/velocity/velocity.ui.min.js?v=1.2.1"></script>
  


  


  <script type="text/javascript" src="/js/src/utils.js?v=6.1.0"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=6.1.0"></script>



  
  


  <script type="text/javascript" src="/js/src/affix.js?v=6.1.0"></script>

  <script type="text/javascript" src="/js/src/schemes/pisces.js?v=6.1.0"></script>



  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=6.1.0"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=6.1.0"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=6.1.0"></script>



  



	





  





  










  





  

  

  

  

  
  

  

  

  

  

</body>
</html>
