<!DOCTYPE html><html lang="zh-CN"><head><meta http-equiv="content-type" content="text/html; charset=utf-8"><meta content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=0" name="viewport"><meta content="yes" name="apple-mobile-web-app-capable"><meta content="black-translucent" name="apple-mobile-web-app-status-bar-style"><meta content="telephone=no" name="format-detection"><meta name="description" content="blog of xuxiaoping"><title>2016总结 | 许小平</title><link rel="stylesheet" type="text/css" href="//cdn.bootcss.com/normalize/5.0.0/normalize.min.css"><link rel="stylesheet" type="text/css" href="//cdn.bootcss.com/pure/0.6.0/pure-min.css"><link rel="stylesheet" type="text/css" href="//cdn.bootcss.com/pure/0.6.0/grids-responsive-min.css"><link rel="stylesheet" type="text/css" href="/css/style.css?v=0.0.0"><link rel="stylesheet" href="//cdn.bootcss.com/font-awesome/4.7.0/css/font-awesome.min.css"><script type="text/javascript" src="//cdn.bootcss.com/jquery/3.1.1/jquery.min.js"></script><link rel="Shortcut Icon" type="image/x-icon" href="/favicon.ico"><link rel="apple-touch-icon" href="/apple-touch-icon.png"><link rel="apple-touch-icon-precomposed" href="/apple-touch-icon.png"></head><body><div class="body_container"><div id="header"><div class="site-name"><h1 class="hidden">2016总结</h1><a id="logo" href="/.">许小平</a><p class="description">一点一滴积累</p></div><div id="nav-menu"><a href="/." class="current"><i class="fa fa-home"> 首页</i></a><a href="/archives/"><i class="fa fa-archive"> 归档</i></a><a href="/about/"><i class="fa fa-user"> 关于</i></a></div></div><div id="layout" class="pure-g"><div class="pure-u-1 pure-u-md-3-4"><div class="content_container"><div class="post"><h1 class="post-title">2016总结</h1><div class="post-meta">Jan 11, 2017<span> | </span><span class="category"><a href="/categories/个人思考/">个人思考</a></span><script src="https://dn-lbstatics.qbox.me/busuanzi/2.3/busuanzi.pure.mini.js" async></script><span id="busuanzi_container_page_pv"> | <span id="busuanzi_value_page_pv"></span><span> Hits</span></span></div><a data-thread-key="2017/01/11/2016总结/" href="/2017/01/11/2016总结/#comments" class="ds-thread-count"></a><div class="post-content"><p>2016&#x5E74;&#xFF0C;&#x6211;&#x7A76;&#x7ADF;&#x662F;&#x600E;&#x4E48;&#x8FC7;&#x6765;&#x7684;&#xFF1F;&#x4E00;&#x76F4;&#x90FD;&#x4E0D;&#x60F3;&#x53BB;&#x603B;&#x7ED3;&#x8FC7;&#x53BB;&#xFF0C;&#x4F46;&#x662F;&#x8FD8;&#x662F;&#x9700;&#x8981;&#x53BB;&#x56DE;&#x987E;&#x4E00;&#x4E0B;&#x3002;</p>
<p>2016&#x5E74;&#x5E72;&#x7684;&#x6700;&#x591A;&#x7684;&#x5C31;&#x662F;&#x5B9E;&#x4E60;&#x4E86;&#xFF0C;&#x5C31;&#x5148;&#x4ECE;&#x8FD9;&#x603B;&#x7ED3;&#x8D77;&#x5427;</p>
<h2 id="&#x5B9E;&#x4E60;&#x5DE5;&#x4F5C;"><a href="#&#x5B9E;&#x4E60;&#x5DE5;&#x4F5C;" class="headerlink" title="&#x5B9E;&#x4E60;&#x5DE5;&#x4F5C;"></a>&#x5B9E;&#x4E60;&#x5DE5;&#x4F5C;</h2><p>&#x4ECE;2016&#x5E74;4&#x6708;5&#x53F7;&#x5165;&#x804C;&#xFF0C;&#x5230;&#x73B0;&#x5728;&#x7D2F;&#x8BA1;&#x5B9E;&#x4E60;&#x5929;&#x6570;130&#x5929;&#x3002;&#x671F;&#x95F4;&#x4E3B;&#x8981;&#x5B8C;&#x6210;&#x4E86;2&#x4E2A;&#x9879;&#x76EE;&#x548C;&#x4E00;&#x4E2A;&#x6B63;&#x5728;&#x8FDB;&#x884C;&#x7684;&#x9879;&#x76EE;&#xFF0C;&#x5BF9;&#x5E94;&#x7684;&#x5C31;&#x5206;&#x4E3A;&#x4E86;3&#x4E2A;&#x9636;&#x6BB5;&#x5427;:</p>
<ol>
<li>&#x5305;&#x62EC;&#x5185;&#x90E8;&#x5DE5;&#x5177;&#x4EE5;&#x53CA;&#x6570;&#x636E;&#x5C55;&#x73B0;&#x7684;&#x5DE5;&#x4F5C;<br> &#x8BF4;&#x767D;&#x4E86;&#x5C31;&#x662F;&#x540E;&#x53F0;&#x7ED9;&#x6570;&#x636E;&#xFF0C;&#x6211;&#x8D1F;&#x8D23;&#x524D;&#x7AEF;&#x7684;&#x5C55;&#x73B0;&#x3002;&#x4E3B;&#x8981;&#x719F;&#x6089;&#x4E86;PHP&#xFF0C;ECharts&#x7684;&#x4F7F;&#x7528;&#x548C;&#x5DE9;&#x56FA;&#x4E86;html/css&#xFF0C;js&#x7684;&#x57FA;&#x7840;&#x77E5;&#x8BC6;&#x5427;&#x3002;</li>
<li>&#x7F51;&#x9875;&#x7248;&#x7684;app&#x5F00;&#x53D1;<br> &#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x5B8C;&#x6574;&#x7684;&#x9879;&#x76EE;&#xFF0C;&#x719F;&#x6089;&#x4E86;&#x9879;&#x76EE;&#x7684;&#x5F00;&#x53D1;&#xFF0C;&#x6D4B;&#x8BD5;&#xFF0C;&#x90E8;&#x7F72;&#xFF0C;&#x7EF4;&#x62A4;&#x7B49;&#x6D41;&#x7A0B;&#xFF0C;&#x5E76;&#x5B66;&#x4E60;&#x5230;&#x4E86;&#x5F88;&#x591A;&#x65B0;&#x7684;&#x77E5;&#x8BC6;&#x548C;&#x5F00;&#x53D1;&#x6280;&#x5DE7;&#xFF0C;&#x4F7F;&#x81EA;&#x5DF1;&#x7684;&#x5F00;&#x53D1;&#x6C34;&#x5E73;&#x548C;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x7684;&#x80FD;&#x529B;&#x63D0;&#x9AD8;&#x4E86;&#x4E00;&#x4E2A;&#x6863;&#x6B21;&#x3002;</li>
<li>&#x7EFC;&#x5408;&#x9879;&#x76EE;<br> &#x5177;&#x4F53;&#x7684;&#x9879;&#x76EE;&#x540D;&#x4FDD;&#x5BC6;&#xFF0C;&#x671F;&#x95F4;&#x4E3B;&#x8981;&#x7528;highchart&#x548C;vue&#x642D;&#x5EFA;&#x4E00;&#x4E2A;&#x56FE;&#x6807;&#x7CFB;&#x7EDF;&#x3002;&#x72EC;&#x7ACB;&#x5B8C;&#x6574;&#x7684;&#x642D;&#x5EFA;&#x9879;&#x76EE;&#x7684;&#x524D;&#x540E;&#x7AEF;&#x6846;&#x67B6;&#xFF0C;&#x670D;&#x52A1;&#x5668;&#x73AF;&#x5883;&#x90E8;&#x7F72;&#xFF0C;&#x6D4B;&#x8BD5;&#xFF0C;&#x4EE3;&#x7801;&#x81EA;&#x52A8;&#x66F4;&#x65B0;&#x7EF4;&#x62A4;&#x7B49;&#xFF0C;&#x671F;&#x95F4;&#x4E0D;&#x65AD;&#x7684;&#x53BB;&#x5C1D;&#x8BD5;&#xFF0C;&#x53BB;&#x8E29;&#x5404;&#x79CD;&#x5751;&#xFF0C;&#x53BB;&#x8BB0;&#x5F55;&#x79EF;&#x7D2F;&#xFF0C;&#x63D0;&#x9AD8;&#x4E86;&#x81EA;&#x5DF1;&#x6574;&#x4F53;&#x7EFC;&#x5408;&#x80FD;&#x529B;&#x3002;&#x601D;&#x8003;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#xFF0C;&#x6587;&#x6863;&#x8D8A;&#x5199;&#x8D8A;&#x591A;&#xFF0C;&#x4EE3;&#x7801;&#x8D8A;&#x5199;&#x8D8A;&#x5C11;&#x3002;</li>
</ol>
<p>&#x5728;&#x516C;&#x53F8;&#x5B9E;&#x73B0;9&#x4E2A;&#x6708;&#xFF0C;&#x81EA;&#x5DF1;&#x4ECE;&#x95EE;&#x9898;&#x7684;&#x5904;&#x7406;&#xFF0C;&#x7F16;&#x7A0B;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x804C;&#x4E1A;&#x7684;&#x7D20;&#x8D28;&#x7B49;&#x90FD;&#x6709;&#x5F88;&#x5927;&#x63D0;&#x9AD8;&#x3002;&#x516C;&#x53F8;&#x4E5F;&#x6709;&#x4E0D;&#x9519;&#x53D1;&#x5C55;&#x7684;&#x524D;&#x666F;&#xFF0C;&#x4ECE;&#x6211;&#x6700;&#x5F00;&#x59CB;&#x7684;10&#x6765;&#x4E2A;&#x4EBA;&#x53D1;&#x5C55;&#x5230;&#x73B0;&#x5728;60&#x6765;&#x4EBA;&#x5427;&#xFF0C;&#x4E1A;&#x52A1;&#x4E5F;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#xFF0C;&#x53D1;&#x5C55;&#x52BF;&#x5934;&#x5F88;&#x731B;&#xFF0C;&#x6269;&#x5F20;&#x7684;&#x4E5F;&#x5F88;&#x5FEB;&#x3002;&#x516C;&#x53F8;&#x7684;&#x6210;&#x957F;&#x4E5F;&#x5E26;&#x52A8;&#x7740;&#x6211;&#x7684;&#x6210;&#x957F;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x63A5;&#x7740;&#x804A;&#x804A;2016&#x5E74;&#x505A;&#x7684;&#x4E2A;&#x4EBA;&#x9879;&#x76EE;</p>
<h2 id="&#x4E2A;&#x4EBA;&#x9879;&#x76EE;"><a href="#&#x4E2A;&#x4EBA;&#x9879;&#x76EE;" class="headerlink" title="&#x4E2A;&#x4EBA;&#x9879;&#x76EE;"></a>&#x4E2A;&#x4EBA;&#x9879;&#x76EE;</h2><p>3d&#x714E;&#x997C;&#x6253;&#x5370;&#xFF0C;&#x8FD9;&#x4E2A;&#x9879;&#x76EE;&#x7EDD;&#x5BF9;&#x662F;&#x4E2A;&#x5751;&#x3001;&#x3001;&#x3001;&#x8D39;&#x4E86;2&#x4E2A;&#x6708;&#xFF0C;&#x505A;&#x7684;&#x4E5F;&#x4E0D;&#x597D;&#xFF0C;&#x5012;&#x662F;&#x5B66;&#x4E86;MFC&#x7F16;&#x7A0B;&#xFF0C;opencv&#x4F7F;&#x7528;&#x8FD9;&#x4E9B;&#x4E1C;&#x897F;&#x3002;&#x6211;&#x89C9;&#x5F97;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x4EF7;&#x503C;&#xFF0C;&#x8FD8;&#x4E0D;&#x5982;&#x6211;&#x4ED4;&#x7EC6;&#x7684;&#x770B;&#x770B;&#x4E66;&#xFF0C;&#x4E0D;&#x63D0;&#x4E86;&#x3002;</p>
<p>&#x4E9A;&#x9A6C;&#x900A;&#x68CB;&#xFF0C;&#x8FD9;&#x8FD8;&#x7B97;&#x662F;&#x6211;&#x505A;&#x7684;&#x6BD4;&#x8F83;&#x597D;&#x7684;&#x4E00;&#x4E2A;&#x9879;&#x76EE;&#xFF0C;&#x81EA;&#x5DF1;&#x7814;&#x7A76;&#x642D;&#x5EFA;&#x5BF9;&#x5F08;&#x5F15;&#x64CE;&#xFF0C;&#x7F16;&#x5199;&#x754C;&#x9762;&#xFF0C;&#x641C;&#x7D22;&#x51FD;&#x6570;&#xFF0C;&#x6D4B;&#x8BD5;&#x7B49;&#x3002;&#x6700;&#x7EC8;&#x6BD4;&#x8D5B;&#x5F97;&#x4E86;&#x4E2A;&#x4E8C;&#x7B49;&#x5956;&#x3002;&#x8FD8;&#x51C6;&#x5907;&#x5199;&#x4E00;&#x4E2A;<a href="https://xuxping.github.io/categories/%E4%BA%9A%E9%A9%AC%E9%80%8A%E6%A3%8B/">&#x4E9A;&#x9A6C;&#x900A;&#x68CB;&#x4E13;&#x9898;</a>&#x6765;&#x603B;&#x7ED3;&#x4E00;&#x4E0B;&#xFF0C;&#x73B0;&#x5728;&#x5199;&#x4E86;2&#x7BC7;&#x4E86;&#xFF0C;&#x5176;&#x5B83;&#x7684;&#x53C8;&#x62D6;&#x7740;&#x4E86;&#xFF0C;&#x51C6;&#x5907;&#x8FC7;&#x5E74;&#x7684;&#x65F6;&#x5019;&#x5199;&#x51FA;&#x4E86;&#x3002;</p>
<p>&#x5916;&#x5305;&#x7F51;&#x7AD9;&#xFF0C;&#x8FD9;&#x4E2A;&#x662F;&#x7ED9;&#x522B;&#x4EBA;&#x505A;&#x7684;&#x4E00;&#x4E2A;&#x7F51;&#x7AD9;&#xFF0C;&#x8FD9;&#x4E2A;&#x9879;&#x76EE;&#x6709;&#x4E9B;&#x62D6;&#x62C9;&#x4E86;&#xFF0C;&#x7B2C;&#x4E00;&#x6B21;&#x63A5;&#x5916;&#x5305;&#x9879;&#x76EE;&#xFF0C;&#x8E29;&#x4E86;&#x4E00;&#x4E9B;&#x5751;&#xFF0C;&#x8BB0;&#x5F55;&#x4E0B;&#x6765;&#x5438;&#x53D6;&#x7ECF;&#x9A8C;&#x2014; <a href="https://xuxping.github.io/2017/01/08/%E5%A4%96%E5%8C%85%E9%A1%B9%E7%9B%AE%E6%80%BB%E7%BB%93/">&#x4E00;&#x4E2A;&#x5C0F;&#x5916;&#x5305;&#x9879;&#x76EE;&#x7684;&#x603B;&#x7ED3;</a></p>
<p>&#x9664;&#x4E86;&#x8FD9;&#x4E09;&#x4E2A;&#x9879;&#x76EE;&#xFF0C;&#x8FD8;&#x53C2;&#x4E0E;&#x79E6;&#x7687;&#x5C9B;&#x5927;&#x578B;&#x6E2F;&#x5EFA;&#x9879;&#x76EE;&#x7684;&#x9700;&#x6C42;&#x8C03;&#x7814;&#x548C;&#x7ADE;&#x6807;&#x4E66;&#x64B0;&#x5199;&#xFF0C;&#x5728;&#x79E6;&#x7687;&#x5C9B;&#x7684;&#x5BBE;&#x9986;&#x4E2D;&#x5F85;&#x4E86;&#x63A5;&#x8FD1;4&#x5929;&#xFF0C;&#x5199;&#x5230;&#x767D;&#x5934;&#x53D1;&#x90FD;&#x51FA;&#x6765;&#x4E86;&#x3002;&#x8FD8;&#x5F88;&#x611F;&#x8C22;&#x8FD9;&#x6B21;&#x7ECF;&#x5386;&#xFF0C;&#x63D0;&#x9AD8;&#x4E86;&#x81EA;&#x5DF1;&#x7684;&#x9700;&#x6C42;&#x8C03;&#x7814;&#x3001;&#x5206;&#x6790;&#x6574;&#x5408;&#x3001;&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x3001;&#x6587;&#x6863;&#x7F16;&#x5199;&#x7B49;&#x6280;&#x80FD;&#x3002;&#x8FD8;&#x5E2E;&#x5973;&#x670B;&#x53CB;&#x7684;&#x516C;&#x53F8;&#x505A;&#x4E86;&#x4E2A;&#x5C0F;&#x5C0F;&#x7684;&#x9884;&#x7EA6;&#x7CFB;&#x7EDF;&#x3002;<br>&#x8FD8;&#x6709;&#x4E9B;&#x5C0F;&#x7684;&#x5C31;&#x4E0D;&#x8BF4;&#x4E86;&#xFF0C;&#x4E00;&#x76F4;&#x62D6;&#x7740;  </p>
<h2 id="&#x5B66;&#x4E60;"><a href="#&#x5B66;&#x4E60;" class="headerlink" title="&#x5B66;&#x4E60;"></a>&#x5B66;&#x4E60;</h2><p>&#x8FD9;&#x4E00;&#x5B9A;&#x8981;&#x5206;&#x4E00;&#x4E0B;&#xFF0C;&#x4E2A;&#x4EBA;&#x5B66;&#x4E60;&#x548C;&#x5B66;&#x4E1A;&#x8BFE;&#x7A0B;</p>
<h3 id="&#x4E2A;&#x4EBA;&#x5B66;&#x4E60;"><a href="#&#x4E2A;&#x4EBA;&#x5B66;&#x4E60;" class="headerlink" title="&#x4E2A;&#x4EBA;&#x5B66;&#x4E60;"></a>&#x4E2A;&#x4EBA;&#x5B66;&#x4E60;</h3><p>2015&#x5E74;&#x5E74;&#x672B;&#xFF0C;&#x6211;&#x653E;&#x5F03;&#x4E86;&#x7EE7;&#x7EED;&#x5B66;&#x4E60;android&#xFF0C;&#x8F6C;&#x800C;&#x6295;&#x5165;&#x5230;&#x4E86;PHP&#xFF0C;&#x73B0;&#x5728;&#x60F3;&#x60F3;&#x8FD9;&#x662F;&#x5BF9;&#x7684;&#x3002;&#x4ECA;&#x5E74;&#x5B66;&#x4E60;&#x4E3B;&#x8981;&#x5206;&#x4E3A;&#x4E24;&#x4E2A;&#x9636;&#x6BB5;&#xFF0C;web&#x5B66;&#x4E60;&#x548C;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x3002;</p>
<p>web&#x5B66;&#x4E60;&#x5360;&#x636E;&#x5927;&#x90E8;&#x5206;&#x65F6;&#x95F4;&#xFF0C;PHP&#x4ECE;ThinkPHP&#x8F6C;&#x5230;&#x9AD8;&#x5EA6;&#x4E0A;&#x7684;Laravel&#x6846;&#x67B6;&#xFF0C;&#x524D;&#x7AEF;&#x4ECE;&#x57FA;&#x672C;&#x7684;html/css&#xFF0C;&#x5230;js&#xFF0C;&#x5230;&#x5404;&#x79CD;js&#x63D2;&#x4EF6;&#x7684;&#x8FD0;&#x7528;&#xFF0C;&#x518D;&#x5230;nodejs&#xFF0C;&#x6700;&#x540E;&#x7EC8;&#x4E8E;&#x8F6C;&#x5230;Vue&#x5168;&#x5BB6;&#x6876;&#x4E0A;&#xFF0C;&#x5267;&#x7EC8;&#x4E86;&#x3002;&#x81EA;&#x8BA4;&#x4E3A;&#x8FDC;&#x8FDC;&#x4E0D;&#x591F;&#xFF0C;&#x4F46;&#x662F;&#x524D;&#x7AEF;&#x7684;&#x6280;&#x672F;&#x53D1;&#x5C55;&#x5B9E;&#x5728;&#x662F;&#x592A;&#x731B;&#xFF0C;&#x4E0D;&#x77E5;&#x9053;&#x660E;&#x5E74;&#x53C8;&#x4F1A;&#x51FA;&#x73B0;&#x4EC0;&#x4E48;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x7684;&#x9886;&#x5BFC;&#x8BF4;&#x7684;&#x5BF9;&#xFF0C;&#x4F60;&#x8FD9;&#x4E9B;&#x4E1C;&#x897F;&#x90FD;&#x73A9;&#x4E86;&#x4E00;&#x904D;&#xFF0C;&#x5927;&#x81F4;&#x600E;&#x4E48;&#x7528;&#x90FD;&#x4E86;&#x89E3;&#x5C31;&#x884C;&#x4E86;&#xFF0C;&#x57FA;&#x7840;&#x7684;&#x5B83;&#x4E0D;&#x4F1A;&#x53D8;&#x3002;</p>
<p>&#x5B66;&#x4E60;&#x8FDB;&#x5165;&#x4E0B;&#x534A;&#x573A;&#xFF0C;&#x6765;&#x5230;&#x4E86;&#x673A;&#x5668;&#x5B66;&#x4E60;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x5B66;&#x5B83;&#xFF0C;&#x56E0;&#x4E3A;&#x5185;&#x5FC3;&#x6050;&#x60E7;&#x3002;&#x6211;&#x5FC5;&#x987B;&#x77E5;&#x9053;&#x8FD9;&#x4E2A;&#x4E1C;&#x897F;&#x662F;&#x4EC0;&#x4E48;&#x539F;&#x7406;&#x624D;&#x80FD;&#x9762;&#x5BF9;&#x4E0D;&#x786E;&#x5B9A;&#x7684;&#x672A;&#x6765;&#x3002;&#x4E8E;&#x662F;&#x62A5;&#x4E86;&#x65AF;&#x5766;&#x798F;&#x7684;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x5165;&#x95E8;&#x8BFE;&#x7A0B;&#xFF0C;&#x7ECF;&#x8FC7;&#x5927;&#x6982;3&#x4E2A;&#x6708;&#xFF0C;12&#x5468;&#x7684;&#x5B66;&#x4E60;&#xFF0C;&#x7EC8;&#x4E8E;&#x62FF;&#x5230;&#x4E86;&#x8BC1;&#x4E66;&#x3002;&#x5728;&#x6211;&#x62FF;&#x5230;&#x8BC1;&#x4E66;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x7684;&#x9886;&#x5BFC;&#x544A;&#x8BC9;&#x6211;&#xFF0C;2017&#x5E74;&#x6211;&#x7684;&#x4E3B;&#x8981;&#x4EFB;&#x52A1;&#x5C31;&#x662F;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x76F8;&#x5173;&#x3002;&#x679C;&#x7136;&#x673A;&#x4F1A;&#x662F;&#x7559;&#x4E2A;&#x6709;&#x51C6;&#x5907;&#x7684;&#x4EBA;&#x7684;&#xFF0C;&#x5F00;&#x59CB;&#x4E86;&#x81EA;&#x5DF1;&#x6280;&#x672F;&#x7684;&#x8F6C;&#x578B;&#x3002;</p>
<p>&#x4ECA;&#x5E74;&#x8FD8;&#x770B;&#x4E86;10&#x51E0;&#x672C;&#x4E66;&#xFF0C;&#x6709;&#x6280;&#x672F;&#x7684;&#xFF0C;&#x5FC3;&#x7406;&#x7684;&#xFF0C;&#x601D;&#x7EF4;&#x7684;&#x3002;&#x4E66;&#x8FD8;&#x662F;&#x770B;&#x7684;&#x6BD4;&#x8F83;&#x5C11;</p>
<h3 id="&#x5B66;&#x4E1A;&#x8BFE;&#x7A0B;"><a href="#&#x5B66;&#x4E1A;&#x8BFE;&#x7A0B;" class="headerlink" title="&#x5B66;&#x4E1A;&#x8BFE;&#x7A0B;"></a>&#x5B66;&#x4E1A;&#x8BFE;&#x7A0B;</h3><p>&#x6211;&#x73B0;&#x5728;&#x4E0D;&#x77E5;&#x9053;&#x600E;&#x4E48;&#x4E0A;&#x8BFE;&#xFF0C;&#x8FD9;&#x4E00;&#x5E74;&#x7684;&#x8BFE;&#x57FA;&#x672C;&#x4E0A;&#x90FD;&#x6CA1;&#x600E;&#x4E48;&#x4E0A;&#x3002;&#x5F88;&#x591A;&#x8BFE;&#x90FD;&#x6C34;&#x8FC7;&#xFF0C;&#x4F5C;&#x4E1A;&#x4E5F;&#x6C34;&#x8FC7;&#xFF0C;&#x5206;&#x6570;&#x8FD8;&#x884C;&#x3002;&#x6211;&#x89C9;&#x5F97;&#x4E66;&#x90FD;&#x88AB;&#x6211;&#x53D8;&#x6210;&#x4E86;&#x5DE5;&#x5177;&#x4E66;&#xFF0C;&#x4E0A;&#x8BFE;&#x65F6;&#x7FFB;&#x4E00;&#x7FFB;&#x76EE;&#x5F55;&#x5565;&#x7684;&#xFF0C;&#x505A;&#x4F5C;&#x4E1A;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x76F4;&#x63A5;&#x5728;&#x4E66;&#x4E2D;&#x73B0;&#x5B66;&#x73B0;&#x7528;&#xFF0C;&#x5BF9;&#x5F85;&#x5B66;&#x4E1A;&#x8BFE;&#x7A0B;&#x7684;&#x6001;&#x5EA6;&#x4E0D;&#x597D;&#x3002;</p>
<h2 id="&#x611F;&#x60C5;&#x751F;&#x6D3B;"><a href="#&#x611F;&#x60C5;&#x751F;&#x6D3B;" class="headerlink" title="&#x611F;&#x60C5;&#x751F;&#x6D3B;"></a>&#x611F;&#x60C5;&#x751F;&#x6D3B;</h2><p>&#x5F88;&#x9AD8;&#x5174;&#x53BB;&#x5E74;&#x7684;&#x5F88;&#x5C11;&#x5435;&#x67B6;&#xFF0C;&#x603B;&#x7ED3;&#x51E0;&#x4E2A;&#x539F;&#x56E0;&#x5427;&#xFF1A;</p>
<ol>
<li>&#x5C31;&#x662F;&#x592A;&#x5FD9;&#xFF0C;&#x6CA1;&#x65F6;&#x95F4;&#x5435;</li>
<li>&#x8138;&#x8981;&#x539A;&#xFF0C;&#x8BA4;&#x9519;&#x8981;&#x5FEB;</li>
<li>&#x4E2A;&#x4EBA;&#x6001;&#x5EA6;&#x8F6C;&#x53D8;&#xFF0C;&#x770B;&#x91CD;&#x611F;&#x60C5;</li>
<li>&#x591A;&#x82B1;&#x70B9;&#x94B1;&#x6D88;&#x707E;</li>
</ol>
<p>&#x603B;&#x7ED3;&#xFF1A;&#x611F;&#x60C5;&#x9010;&#x6E10;&#x7A33;&#x5B9A;&#xFF0C;&#x5076;&#x5C14;&#x4E5F;&#x4F1A;&#x5435;&#x5435;&#xFF0C;&#x6B63;&#x5E38;&#x7684;&#x3002;&#x4F5C;&#x4E3A;&#x604B;&#x7231;&#x5F31;&#x52BF;&#x4E00;&#x65B9;&#x7684;&#x7537;&#x751F;&#xFF0C;&#x8981;&#x501F;&#x6B64;&#x673A;&#x4F1A;&#x591A;&#x7EC3;&#x81EA;&#x5DF1;&#x7684;&#x8010;&#x6027;&#x3002;</p>
<h2 id="&#x603B;&#x7ED3;"><a href="#&#x603B;&#x7ED3;" class="headerlink" title="&#x603B;&#x7ED3;"></a>&#x603B;&#x7ED3;</h2><ol>
<li>&#x4ECA;&#x5E74;&#x7D2F;&#x8BA1;&#x8D5A;&#x94B1;6&#x4E07;&#xFF0C;&#x5B9E;&#x73B0;&#x81EA;&#x7ED9;&#x81EA;&#x8DB3;&#xFF0C;&#x4E0D;&#x518D;&#x95EE;&#x7236;&#x6BCD;&#x8981;&#x94B1;  </li>
<li>&#x5B66;&#x4E60;&#x80FD;&#x529B;&#x5927;&#x5E45;&#x63D0;&#x5347;&#xFF0C;&#x8131;&#x79BB;&#x4F20;&#x7EDF;&#x5B66;&#x4E60;&#x65B9;&#x5F0F;&#xFF0C;&#x5B9E;&#x73B0;&#x9A71;&#x52A8;&#x5F0F;&#x5B66;&#x4E60;</li>
<li>&#x5DE5;&#x4F5C;&#x804C;&#x4E1A;&#x7D20;&#x517B;&#x63D0;&#x9AD8;&#xFF0C;&#x5177;&#x5907;&#x79BB;&#x5F00;&#x6821;&#x56ED;&#x8FDB;&#x5165;&#x793E;&#x4F1A;&#x7684;&#x6761;&#x4EF6;</li>
<li>&#x7D2F;&#x8BA1;&#x5B8C;&#x6210;&#x516C;&#x53F8;&#x4EE5;&#x53CA;&#x4E2A;&#x4EBA;&#x9879;&#x76EE;10&#x4F59;&#x4E2A;</li>
<li>&#x604B;&#x7231;&#x611F;&#x60C5;&#x7A33;&#x4E2D;&#x6709;&#x5347;</li>
<li>&#x4E2A;&#x4EBA;&#x7EFC;&#x5408;&#x80FD;&#x529B;&#x5927;&#x5E45;&#x63D0;&#x5347;</li>
<li>&#x5177;&#x6709;&#x4E00;&#x4E9B;&#x574F;&#x4E60;&#x60EF;&#xFF0C;&#x6BD4;&#x5982;&#x62D6;&#x62C9;&#xFF0C;&#x6CA1;&#x6709;&#x6539;&#x6B63;</li>
</ol>
<p>&#x611F;&#x89C9;&#x81EA;&#x5DF1;&#x8D8A;&#x6765;&#x8D8A;&#x50CF;&#x4E2A;&#x7A0B;&#x5E8F;&#x5458;&#x3002;</p>
</div><script type="text/javascript" src="/js/share.js?v=0.0.0" async></script><a data-url="https://xuxping.github.io/2017/01/11/2016总结/" data-id="cixt24yiu0000819kz03mlgpe" class="article-share-link">分享到</a><div class="tags"><a href="/tags/个人思考/">个人思考</a></div><div class="post-nav"><a href="/2017/01/11/磁盘挂载和格式化/" class="next">磁盘挂载和格式化</a></div><div data-thread-key="2017/01/11/2016总结/" data-title="2016总结" data-url="https://xuxping.github.io/2017/01/11/2016总结/" class="ds-share flat"><div class="ds-share-inline"><ul class="ds-share-icons-16"><li data-toggle="ds-share-icons-more"><a href="javascript:void(0);" class="ds-more">分享到：</a></li><li><a href="javascript:void(0);" data-service="weibo" class="ds-weibo">微博</a></li><li><a href="javascript:void(0);" data-service="qzone" class="ds-qzone">QQ空间</a></li><li><a href="javascript:void(0);" data-service="qqt" class="ds-qqt">腾讯微博</a></li><li><a href="javascript:void(0);" data-service="wechat" class="ds-wechat">微信</a></li></ul><div class="ds-share-icons-more"></div></div></div><div data-thread-key="2017/01/11/2016总结/" data-title="2016总结" data-url="https://xuxping.github.io/2017/01/11/2016总结/" data-author-key="1" class="ds-thread"></div></div></div></div><div class="pure-u-1-4 hidden_mid_and_down"><div id="sidebar"><div class="widget"><form action="//www.google.com/search" method="get" accept-charset="utf-8" target="_blank" class="search-form"><input type="text" name="q" maxlength="20" placeholder="Search"/><input type="hidden" name="sitesearch" value="https://xuxping.github.io"/></form></div><div class="widget"><form action="//www.baidu.com/baidu" method="get" accept-charset="utf-8" target="_blank" class="search-form"><input type="search" name="word" maxlength="20" placeholder="Search"/><input type="hidden" name="si" value="https://xuxping.github.io"/><input name="tn" type="hidden" value="bds"/><input name="cl" type="hidden" value="3"/><input name="ct" type="hidden" value="2097152"/><input name="s" type="hidden" value="on"/></form></div><div class="widget"><div class="widget-title"><i class="fa fa-folder-o"> 分类</i></div><ul class="category-list"><li class="category-list-item"><a class="category-list-link" href="/categories/Linux/">Linux</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/Nginx/">Nginx</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/javascript/">javascript</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/php/">php</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/project/">project</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/tools/">tools</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/个人思考/">个人思考</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/亚马逊棋/">亚马逊棋</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/大前端/">大前端</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/服务器/">服务器</a></li></ul></div><div class="widget"><div class="widget-title"><i class="fa fa-star-o"> 标签</i></div><div class="tagcloud"><a href="/tags/php/" style="font-size: 15px;">php</a> <a href="/tags/个人思考/" style="font-size: 15px;">个人思考</a> <a href="/tags/Nginx/" style="font-size: 15px;">Nginx</a> <a href="/tags/JavaScript/" style="font-size: 15px;">JavaScript</a> <a href="/tags/laravel/" style="font-size: 15px;">laravel</a> <a href="/tags/服务器/" style="font-size: 15px;">服务器</a> <a href="/tags/node/" style="font-size: 15px;">node</a> <a href="/tags/git/" style="font-size: 15px;">git</a> <a href="/tags/tools/" style="font-size: 15px;">tools</a> <a href="/tags/sass/" style="font-size: 15px;">sass</a> <a href="/tags/vue/" style="font-size: 15px;">vue</a> <a href="/tags/亚马逊棋/" style="font-size: 15px;">亚马逊棋</a> <a href="/tags/外包/" style="font-size: 15px;">外包</a> <a href="/tags/tips/" style="font-size: 15px;">tips</a> <a href="/tags/网站部署/" style="font-size: 15px;">网站部署</a> <a href="/tags/脑电波/" style="font-size: 15px;">脑电波</a></div></div><div class="widget"><div class="widget-title"><i class="fa fa-file-o"> 最新文章</i></div><ul class="post-list"><li class="post-list-item"><a class="post-list-link" href="/2017/01/11/2016总结/">2016总结</a></li><li class="post-list-item"><a class="post-list-link" href="/2017/01/11/磁盘挂载和格式化/">磁盘挂载和格式化</a></li><li class="post-list-item"><a class="post-list-link" href="/2017/01/08/脑电波数据采集/">脑电波数据采集</a></li><li class="post-list-item"><a class="post-list-link" href="/2017/01/08/外包项目总结/">一个小外包项目的总结</a></li><li class="post-list-item"><a class="post-list-link" href="/2017/01/05/summary-use-of-git/">git使用汇总</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/12/16/nmp的权限和selinux/">nmp的权限问题分析和selinux</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/12/13/项目进一步研究内容/">项目进一步研究内容</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/12/13/亚马逊的评估函数研究/">亚马逊的评估函数研究</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/12/13/亚马逊棋采用的搜索策略/">亚马逊棋采用的搜索策略</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/12/13/亚马逊棋项目的总体设计/">亚马逊棋项目的总体设计</a></li></ul></div><div class="widget"><div class="comments-title"><i class="fa fa-comment-o"> 最近评论</i></div><div data-num-items="5" data-show-avatars="0" data-show-time="1" data-show-admin="0" data-excerpt-length="32" data-show-title="1" class="ds-recent-comments"></div></div><div class="widget"><div class="widget-title"><i class="fa fa-external-link"> 友情链接</i></div><ul></ul><a href="http://www.example1.com/" title="site-name1" target="_blank">site-name1</a></div></div></div><div class="pure-u-1 pure-u-md-3-4"><div id="footer">© <a href="/." rel="nofollow">许小平.</a> Powered by<a rel="nofollow" target="_blank" href="https://hexo.io"> Hexo.</a><a rel="nofollow" target="_blank" href="https://github.com/tufu9441/maupassant-hexo"> Theme</a> by<a rel="nofollow" target="_blank" href="https://github.com/pagecho"> Cho.</a></div></div></div><a id="rocket" href="#top" class="show"></a><script type="text/javascript" src="/js/totop.js?v=0.0.0" async></script><script type="text/javascript" src="//cdn.bootcss.com/fancybox/2.1.5/jquery.fancybox.pack.js" async></script><script type="text/javascript" src="/js/fancybox.js?v=0.0.0" async></script><link rel="stylesheet" type="text/css" href="/css/jquery.fancybox.css?v=0.0.0"><script>var duoshuoQuery = {short_name:'xuxping'};
(function() {
    var ds = document.createElement('script');
    ds.type = 'text/javascript';ds.async = true;
    ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
    ds.charset = 'UTF-8';
    (document.getElementsByTagName('head')[0]
        || document.getElementsByTagName('body')[0]).appendChild(ds);
})();
</script><script type="text/javascript" src="/js/codeblock-resizer.js?v=0.0.0"></script><script type="text/javascript" src="/js/smartresize.js?v=0.0.0"></script></div></body></html>