<!DOCTYPE html>












  


<html class="theme-next pisces use-motion" lang="zh-CN">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge"/>
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=2"/>
<meta name="theme-color" content="#222"/>
























<link rel="stylesheet" href="/lib/font-awesome/css/font-awesome.min.css?v=4.6.2"/>

<link rel="stylesheet" href="/css/main.css?v=7.1.0"/>


  <link rel="apple-touch-icon" sizes="180x180" href="/images/apple-touch-icon-next.png?v=7.1.0">


  <link rel="icon" type="image/png" sizes="32x32" href="/images/favicon-32x32-next.png?v=7.1.0">


  <link rel="icon" type="image/png" sizes="16x16" href="/images/favicon-16x16-next.png?v=7.1.0">


  <link rel="mask-icon" href="/images/logo.svg?v=7.1.0" color="#222">







<script id="hexo.configurations">
  var NexT = window.NexT || {};
  var CONFIG = {
    root: '/',
    scheme: 'Pisces',
    version: '7.1.0',
    sidebar: {"position":"left","display":"post","offset":12,"onmobile":false,"dimmer":false},
    back2top: true,
    back2top_sidebar: false,
    fancybox: false,
    fastclick: false,
    lazyload: false,
    tabs: true,
    motion: {"enable":true,"async":false,"transition":{"post_block":"fadeIn","post_header":"slideDownIn","post_body":"slideDownIn","coll_header":"slideLeftIn","sidebar":"slideUpIn"}},
    algolia: {
      applicationID: '',
      apiKey: '',
      indexName: '',
      hits: {"per_page":10},
      labels: {"input_placeholder":"Search for Posts","hits_empty":"We didn't find any results for the search: ${query}","hits_stats":"${hits} results found in ${time} ms"}
    }
  };
</script>


  




  <meta name="description" content="8&amp;#x6708;&amp;#x5306;&amp;#x5306;&amp;#x8D70;&amp;#x8FC7;&amp;#xFF0C;&amp;#x51C9;&amp;#x723D;&amp;#x7684;&amp;#x79CB;&amp;#x98CE;&amp;#x9010;&amp;#x6E10;&amp;#x64B5;&amp;#x8D70;&amp;#x4E86;&amp;#x590F;&amp;#x65E5;&amp;#x7684;&amp;#x708E;&amp;#x70ED;&amp;#x3002;&amp;#x6BCF;&amp;#x6708;&amp;#x8BFB">
<meta property="og:type" content="article">
<meta property="og:title" content="2017年8月笔记">
<meta property="og:url" content="https://xuxping.github.io/2017/08/30/2017年8月笔记/index.html">
<meta property="og:site_name" content="Kavim">
<meta property="og:description" content="8&amp;#x6708;&amp;#x5306;&amp;#x5306;&amp;#x8D70;&amp;#x8FC7;&amp;#xFF0C;&amp;#x51C9;&amp;#x723D;&amp;#x7684;&amp;#x79CB;&amp;#x98CE;&amp;#x9010;&amp;#x6E10;&amp;#x64B5;&amp;#x8D70;&amp;#x4E86;&amp;#x590F;&amp;#x65E5;&amp;#x7684;&amp;#x708E;&amp;#x70ED;&amp;#x3002;&amp;#x6BCF;&amp;#x6708;&amp;#x8BFB">
<meta property="og:image" content="https://xuxping.github.io/2017/08/30/2017年8月笔记/5980472d47b39.jpg">
<meta property="og:image" content="https://xuxping.github.io/2017/08/30/2017年8月笔记/%E5%B1%8F%E5%B9%95%E5%BF%AB%E7%85%A7%202017-08-26%20%E4%B8%8B%E5%8D%882.39.28.png">
<meta property="og:image" content="https://xuxping.github.io/2017/08/30/2017年8月笔记/500px-%E4%B9%94%E5%B8%83%E6%96%AF%E5%8F%8A%E5%85%B6%E4%BA%A7%E5%93%81.gif">
<meta property="og:updated_time" content="2017-09-27T13:07:03.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="2017年8月笔记">
<meta name="twitter:description" content="8&amp;#x6708;&amp;#x5306;&amp;#x5306;&amp;#x8D70;&amp;#x8FC7;&amp;#xFF0C;&amp;#x51C9;&amp;#x723D;&amp;#x7684;&amp;#x79CB;&amp;#x98CE;&amp;#x9010;&amp;#x6E10;&amp;#x64B5;&amp;#x8D70;&amp;#x4E86;&amp;#x590F;&amp;#x65E5;&amp;#x7684;&amp;#x708E;&amp;#x70ED;&amp;#x3002;&amp;#x6BCF;&amp;#x6708;&amp;#x8BFB">
<meta name="twitter:image" content="https://xuxping.github.io/2017/08/30/2017年8月笔记/5980472d47b39.jpg">





  
  
  <link rel="canonical" href="https://xuxping.github.io/2017/08/30/2017年8月笔记/"/>



<script id="page.configurations">
  CONFIG.page = {
    sidebar: "",
  };
</script>

  <title>2017年8月笔记 | Kavim</title>
  












  <noscript>
  <style>
  .use-motion .motion-element,
  .use-motion .brand,
  .use-motion .menu-item,
  .sidebar-inner,
  .use-motion .post-block,
  .use-motion .pagination,
  .use-motion .comments,
  .use-motion .post-header,
  .use-motion .post-body,
  .use-motion .collection-title { opacity: initial; }

  .use-motion .logo,
  .use-motion .site-title,
  .use-motion .site-subtitle {
    opacity: initial;
    top: initial;
  }

  .use-motion .logo-line-before i { left: initial; }
  .use-motion .logo-line-after i { right: initial; }
  </style>
</noscript>

</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-CN">

  
  
    
  

  <div class="container sidebar-position-left page-post-detail">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-brand-wrapper">
  <div class="site-meta">
    

    <div class="custom-logo-site-title">
      <a href="/" class="brand" rel="start">
        <span class="logo-line-before"><i></i></span>
        <span class="site-title">Kavim</span>
        <span class="logo-line-after"><i></i></span>
      </a>
    </div>
    
      
        <p class="site-subtitle">一点一滴积累</p>
      
    
    
  </div>

  <div class="site-nav-toggle">
    <button aria-label="切换导航栏">
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
    </button>
  </div>
</div>



<nav class="site-nav">
  
    <ul id="menu" class="menu">
      
        
        
        
          
          <li class="menu-item menu-item-home">

    
    
    
      
    

    

    <a href="/" rel="section"><i class="menu-item-icon fa fa-fw fa-home"></i> <br/>首页</a>

  </li>
        
        
        
          
          <li class="menu-item menu-item-archives">

    
    
    
      
    

    

    <a href="/archives/" rel="section"><i class="menu-item-icon fa fa-fw fa-archive"></i> <br/>归档</a>

  </li>

      
      
    </ul>
  

  

  
</nav>



  



</div>
    </header>

    


    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          
            

          
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  

  
  
  

  

  <article class="post post-type-normal" itemscope itemtype="http://schema.org/Article">
  
  
  
  <div class="post-block">
    <link itemprop="mainEntityOfPage" href="https://xuxping.github.io/2017/08/30/2017年8月笔记/"/>

    <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
      <meta itemprop="name" content="Kavim"/>
      <meta itemprop="description" content="生活不止眼前的苟且 还有诗和远方的田野"/>
      <meta itemprop="image" content="/images/avatar.gif"/>
    </span>

    <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
      <meta itemprop="name" content="Kavim"/>
    </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">2017年8月笔记

              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">

            
            
            

            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              
                <span class="post-meta-item-text">发表于</span>
              

              
                
              

              <time title="创建时间：2017-08-30 21:12:29" itemprop="dateCreated datePublished" datetime="2017-08-30T21:12:29+08:00">2017-08-30</time>
            

            
              

              
                
                <span class="post-meta-divider">|</span>
                

                <span class="post-meta-item-icon">
                  <i class="fa fa-calendar-check-o"></i>
                </span>
                
                  <span class="post-meta-item-text">更新于</span>
                
                <time title="修改时间：2017-09-27 21:07:03" itemprop="dateModified" datetime="2017-09-27T21:07:03+08:00">2017-09-27</time>
              
            
          </span>

          
            <span class="post-category">
            
              <span class="post-meta-divider">|</span>
            
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              
                <span class="post-meta-item-text">分类于</span>
              
              
                <span itemprop="about" itemscope itemtype="http://schema.org/Thing"><a href="/categories/个人笔记/" itemprop="url" rel="index"><span itemprop="name">个人笔记</span></a></span>

                
                
              
            </span>
          

          
            
            
          

          
          

          

          

          

        </div>
      </header>
    

    
    
    
    <div class="post-body" itemprop="articleBody">

      
      

      
        <p><img src="/2017/08/30/2017&#x5E74;8&#x6708;&#x7B14;&#x8BB0;/5980472d47b39.jpg" alt=""><br>8&#x6708;&#x5306;&#x5306;&#x8D70;&#x8FC7;&#xFF0C;&#x51C9;&#x723D;&#x7684;&#x79CB;&#x98CE;&#x9010;&#x6E10;&#x64B5;&#x8D70;&#x4E86;&#x590F;&#x65E5;&#x7684;&#x708E;&#x70ED;&#x3002;&#x6BCF;&#x6708;&#x8BFB;&#x4E66;&#xFF0C;&#x5728;&#x708E;&#x70ED;&#x800C;&#x53C8;&#x6D6E;&#x8E81;&#x7684;8&#x6708;&#xFF0C;&#x7528;&#x4E66;&#x6765;&#x6170;&#x85C9;&#x81EA;&#x5DF1;&#x3002;&#x8FD9;&#x4E2A;&#x6708;&#x8BFB;&#x4E86;2&#x672C;&#x4E66;&#xFF0C;&#x6709;&#x89E6;&#x52A8;&#x5FC3;&#x7075;&#x7684;&#x300A;&#x6446;&#x6E21;&#x4EBA;&#x300B;&#xFF0C;&#x6709;&#x4F1F;&#x4EBA;&#x7684;&#x6210;&#x957F;&#x5386;&#x7A0B;&#x300A;&#x6210;&#x4E3A;&#x4E54;&#x5E03;&#x65AF;&#x300B;&#x3002;<br><a id="more"></a></p>
<h2 id="&#x300A;&#x6446;&#x6E21;&#x4EBA;&#x300B;"><a href="#&#x300A;&#x6446;&#x6E21;&#x4EBA;&#x300B;" class="headerlink" title="&#x300A;&#x6446;&#x6E21;&#x4EBA;&#x300B;"></a>&#x300A;&#x6446;&#x6E21;&#x4EBA;&#x300B;</h2><p><img src="/2017/08/30/2017&#x5E74;8&#x6708;&#x7B14;&#x8BB0;/%E5%B1%8F%E5%B9%95%E5%BF%AB%E7%85%A7%202017-08-26%20%E4%B8%8B%E5%8D%882.39.28.png" alt=""></p>
<p>&#x300A;&#x6446;&#x6E21;&#x4EBA;&#x300B;&#x63CF;&#x8FF0;&#x7684;&#x662F;&#x4E00;&#x4E2A;&#x5355;&#x4EB2;&#x5973;&#x5B69;&#x8FEA;&#x4F26;&#x5728;&#x53BB;&#x770B;&#x671B;&#x4E45;&#x672A;&#x8C0B;&#x9762;&#x7684;&#x7236;&#x4EB2;&#x7684;&#x8DEF;&#x4E0A;&#x53D1;&#x751F;&#x8F66;&#x7978;&#x8EAB;&#x4EA1;&#xFF0C;&#x6765;&#x5230;&#x4E86;&#x8352;&#x539F;&#xFF0C;&#x548C;&#x6446;&#x6E21;&#x4EBA;&#x5728;&#x8352;&#x539F;&#x53D1;&#x751F;&#x7684;&#x6545;&#x4E8B;&#x3002;&#x300A;&#x6446;&#x6E21;&#x4EBA;&#x300B;&#x4E0D;&#x662F;&#x65F6;&#x4E0B;&#x6D41;&#x884C;&#x7684;&#x8A00;&#x60C5;&#x5C0F;&#x8BF4;&#xFF0C;&#x800C;&#x662F;&#x4E00;&#x90E8;&#x5173;&#x4E8E;&#x5FC3;&#x7075;&#x63A2;&#x7D22;&#x7C7B;&#x7684;&#x5C0F;&#x8BF4;&#x3002;</p>
<p>&#x5728;&#x6574;&#x4E2A;&#x5267;&#x60C5;&#x4E2D;&#x8FEA;&#x4F26;&#x52C7;&#x6562;&#xFF0C;&#x6562;&#x4E8E;&#x9762;&#x5BF9;&#x81EA;&#x5DF1;&#x662F;&#x5728;&#x8F66;&#x7978;&#x4E2D;&#x552F;&#x4E00;&#x6B7B;&#x53BB;&#x7684;&#x4EBA;&#x2014;&#x8FD9;&#x4E2A;&#x6B8B;&#x9177;&#x65E0;&#x6BD4;&#x7684;&#x4E8B;&#x5B9E;&#xFF0C;&#x6562;&#x4E8E;&#x4E0E;&#x9B54;&#x9B3C;&#x505A;&#x6597;&#x4E89;&#x3002;&#x5979;&#x4FE1;&#x5FF5;&#x575A;&#x5B9A;&#xFF0C;&#x7EB5;&#x7136;&#x5927;&#x591A;&#x6570;&#x4EBA;&#x529D;&#x544A;&#x5979;&#xFF1A;&#x79BB;&#x5F00;&#x7684;&#x8BDD;&#xFF0C;&#x6216;&#x8BB8;&#x518D;&#x4E5F;&#x56DE;&#x4E0D;&#x6765;&#x4E86;&#x3002;&#x5979;&#x6BC5;&#x7136;&#x51B3;&#x7136;&#x5730;&#x72EC;&#x81EA;&#x8FD4;&#x56DE;&#x8352;&#x539F;&#xFF0C;&#x4E3A;&#x4E86;&#x56DE;&#x53BB;&#x627E;&#x5230;&#x81EA;&#x5DF1;&#x7684;&#x6446;&#x6E21;&#x4EBA;&#xFF0C;&#x5979;&#x72EC;&#x81EA;&#x7A7F;&#x8FC7;&#x5145;&#x6EE1;&#x9B54;&#x9B3C;&#x7684;&#x6E56;&#xFF0C;&#x987A;&#x5229;&#x9003;&#x8131;&#x9B54;&#x9B3C;&#x7684;&#x53EF;&#x6015;&#x9B54;&#x722A;&#xFF0C;&#x7EB5;&#x7136;&#x5DF2;&#x7CBE;&#x75B2;&#x529B;&#x5C3D;&#x3002;</p>
<p>&#x5728;&#x5EA6;&#x8FC7;&#x8352;&#x539F;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x5D14;&#x65AF;&#x5766;&#x59CB;&#x7EC8;&#x4FDD;&#x62A4;&#x7740;&#x8FEA;&#x4F26;&#xFF0C;&#x4E0E;&#x6BCF;&#x4E2A;&#x9636;&#x6BB5;&#x7684;&#x9B54;&#x9B3C;&#x6597;&#x4E89;&#xFF0C;&#x7EB5;&#x7136;&#x81EA;&#x5DF1;&#x904D;&#x4F53;&#x9CDE;&#x4F24;&#xFF0C;&#x4E5F;&#x8981;&#x5C06;&#x8FEA;&#x4F26;&#x5B89;&#x5168;&#x7684;&#x9001;&#x5230;&#x5B89;&#x5168;&#x5C4B;&#xFF0C;&#x9001;&#x5230;&#x8352;&#x539F;&#x7684;&#x7EC8;&#x70B9;&#x3002;&#x4ED6;&#x662F;&#x8FEA;&#x4F26;&#x7684;&#x4FDD;&#x62A4;&#x4F1E;&#xFF0C;&#x5475;&#x62A4;&#x7740;&#x8FEA;&#x4F26;&#x3002;&#x4F46;&#x5D14;&#x65AF;&#x5766;&#x9650;&#x4E8E;&#x81EA;&#x5DF1;&#x6446;&#x6E21;&#x4EBA;&#x7684;&#x8EAB;&#x4EFD;&#x548C;&#x4F7F;&#x547D;&#xFF0C;&#x5373;&#x4F7F;&#x5185;&#x5FC3;&#x6DF1;&#x7231;&#x7740;&#x8FEA;&#x4F26;&#xFF0C;&#x786E;&#x59CB;&#x7EC8;&#x4E0D;&#x6562;&#x53BB;&#x8FFD;&#x6C42;&#x81EA;&#x5DF1;&#x7231;&#x7684;&#x4EBA;&#x3002;&#x4F46;&#x770B;&#x5230;&#x8FEA;&#x4F26;&#x594B;&#x4E0D;&#x987E;&#x8EAB;&#x7684;&#x56DE;&#x6765;&#x627E;&#x81EA;&#x5DF1;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5D14;&#x65AF;&#x5766;&#x4E3A;&#x4E86;&#x8FEA;&#x4F26;&#xFF0C;&#x653E;&#x5F03;&#x81EA;&#x5DF1;&#x7684;&#x6446;&#x6E21;&#x4EBA;&#x7684;&#x8EAB;&#x4EFD;&#x548C;&#x4F7F;&#x547D;&#xFF0C;&#x548C;&#x8FEA;&#x4F26;&#x4E00;&#x8D77;&#x9003;&#x51FA;&#x4E86;&#x8352;&#x539F;&#x3002;</p>
<p>&#x8FD9;&#x662F;&#x4E00;&#x90E8;&#x4EE4;&#x4EBA;&#x6DF1;&#x6709;&#x611F;&#x89E6;&#x7684;&#x7231;&#x60C5;&#x6545;&#x4E8B;&#x3002;&#x4ECE;&#x6700;&#x5F00;&#x59CB;&#x4E24;&#x4EBA;&#x7ED3;&#x8BC6;&#xFF0C;&#x5230;&#x9010;&#x6E10;&#x719F;&#x6089;&#xFF0C;&#x5171;&#x540C;&#x7ECF;&#x5386;&#x8FC7;&#x5404;&#x79CD;&#x56F0;&#x96BE;&#xFF0C;&#x4ED6;&#x4E3A;&#x4E86;&#x5979;&#x594B;&#x4E0D;&#x987E;&#x8EAB;&#xFF0C;&#x5728;&#x5171;&#x60A3;&#x96BE;&#x7684;&#x8FC7;&#x7A0B;&#x9010;&#x6E10;&#x76F8;&#x604B;&#x3002;&#x5230;&#x7ECF;&#x5386;&#x79BB;&#x522B;&#x540E;&#xFF0C;&#x4E24;&#x4EBA;&#x4ECD;&#x7136;&#x76F8;&#x7231;&#x7740;&#xFF0C;&#x5979;&#x53C8;&#x4E3A;&#x4E86;&#x4ED6;&#x514B;&#x670D;&#x4E07;&#x96BE;&#xFF0C;&#x6700;&#x7EC8;&#x4E24;&#x4EBA;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x6709;&#x4E86;&#x7F8E;&#x597D;&#x7684;&#x7ED3;&#x5C40;&#x3002;&#x8FD9;&#x624D;&#x662F;&#x7231;&#x60C5;&#x5E94;&#x6709;&#x7684;&#x6837;&#x5B50;&#x3002;&#x4ED4;&#x7EC6;&#x54C1;&#x5473;&#x8FD9;&#x6BB5;&#x5386;&#x7A0B;&#xFF0C;&#x624D;&#x53D1;&#x73B0;&#x4F5C;&#x8005;&#x7684;&#x6DF1;&#x523B;&#x5BD3;&#x610F;&#x3002;</p>
<p><strong>&#x201C;&#x5982;&#x679C;&#x547D;&#x8FD0;&#x662F;&#x4E00;&#x6761;&#x5B64;&#x72EC;&#x7684;&#x6CB3;&#x6D41;&#xFF0C;&#x8C01;&#x4F1A;&#x662F;&#x4F60;&#x7684;&#x6446;&#x6E21;&#x4EBA;&#x201D;</strong>&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x4E0D;&#x65AD;&#x7684;&#x884C;&#x8D70;&#x4E2D;&#xFF0C;&#x53EA;&#x4E3A;&#x9047;&#x5230;&#x90A3;&#x4E2A;&#x4F60;&#x3002;<strong>&#x201C;&#x6446;&#x6E21;&#x4EBA;&#xFF0C;&#x7A76;&#x7ADF;&#x662F;&#x8C01;&#x6E21;&#x4E86;&#x8C01;&#x201D;</strong>&#xFF0C;&#x6211;&#x4EEC;&#x76F8;&#x4E92;&#x5F71;&#x54CD;&#xFF0C;&#x6210;&#x4E3A;&#x5F7C;&#x6B64;&#x5FC3;&#x4E2D;&#x6700;&#x597D;&#x7684;&#x4ED6;(&#x5979;)&#x3002;</p>
<h2 id="&#x300A;&#x6210;&#x4E3A;&#x4E54;&#x5E03;&#x65AF;&#x300B;"><a href="#&#x300A;&#x6210;&#x4E3A;&#x4E54;&#x5E03;&#x65AF;&#x300B;" class="headerlink" title="&#x300A;&#x6210;&#x4E3A;&#x4E54;&#x5E03;&#x65AF;&#x300B;"></a>&#x300A;&#x6210;&#x4E3A;&#x4E54;&#x5E03;&#x65AF;&#x300B;</h2><p><img src="/2017/08/30/2017&#x5E74;8&#x6708;&#x7B14;&#x8BB0;/500px-%E4%B9%94%E5%B8%83%E6%96%AF%E5%8F%8A%E5%85%B6%E4%BA%A7%E5%93%81.gif" alt=""></p>
<p>&#x300A;&#x6210;&#x4E3A;&#x4E54;&#x5E03;&#x65AF;&#x300B;&#x63CF;&#x8FF0;&#x4E86;&#x66F4;&#x52A0;&#x5168;&#x9762;&#x7684;&#x4E54;&#x5E03;&#x65AF;&#xFF0C;&#x521B;&#x5EFA;&#x82F9;&#x679C;&#xFF0C;&#x88AB;&#x64B5;&#xFF0C;next&#xFF0C;&#x76AE;&#x514B;&#x65AF;&#xFF0C;&#x6700;&#x7EC8;&#x56DE;&#x5F52;&#x5E26;&#x9886;&#x82F9;&#x679C;&#x8D70;&#x5411;&#x5DC5;&#x5CF0;&#x3002;&#x4ED6;&#x662F;&#x4E00;&#x4E2A;&#x559C;&#x6B22;&#x5954;&#x9A70;&#x5B9D;&#x9A6C;911&#xFF0C;&#x4E00;&#x4E2A;&#x6E34;&#x671B;&#x5F97;&#x5230;&#x5916;&#x754C;&#x8BA4;&#x540C;&#xFF0C;&#x4E00;&#x4E2A;&#x4E3A;&#x81EA;&#x5C0A;&#x5FC3;&#x800C;&#x6218;&#x7684;&#x5E73;&#x51E1;&#x4EBA;&#xFF0C;&#x4E5F;&#x662F;&#x4E00;&#x4E2A;&#x6562;&#x4E8E;&#x76F8;&#x4FE1;&#x81EA;&#x5DF1;&#x7684;&#x76F4;&#x89C9;&#xFF0C;&#x6709;&#x6BC5;&#x529B;&#x575A;&#x6301;&#x548C;&#x52AA;&#x529B;&#xFF0C;&#x62E5;&#x6709;&#x5929;&#x624D;&#x822C;&#x7684;&#x5546;&#x4E1A;&#x548C;&#x8425;&#x9500;&#x80FD;&#x529B;&#x7684;&#x5929;&#x624D;&#x3002;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x6210;&#x957F;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x4ECE;&#x4E00;&#x4E2A;&#x62E5;&#x6709;&#x5929;&#x624D;&#x667A;&#x6167;&#x7684;&#x6DF7;&#x86CB;&#x6210;&#x957F;&#x4E3A;&#x6210;&#x719F;&#x7684;&#x5546;&#x4E1A;&#x9886;&#x8896;&#xFF0C;&#x7528;&#x4ED6;&#x975E;&#x51E1;&#x7684;&#x5BA1;&#x7F8E;&#x54C1;&#x4F4D;&#xFF0C;&#x6267;&#x7740;&#x7684;&#x8FFD;&#x6C42;&#xFF0C;&#x6DF1;&#x523B;&#x7684;&#x6D1E;&#x5BDF;&#x529B;&#xFF0C;&#x8425;&#x9500;&#x5929;&#x8D4B;&#x5F15;&#x9886;&#x4E86;&#x4E2A;&#x4EBA;&#x7535;&#x8111;&#xFF0C;&#x624B;&#x673A;&#x7684;&#x53D8;&#x9769;&#x3002;</p>
<p>&#x5F00;&#x59CB;&#x8BFB;&#x8FD9;&#x672C;&#x4E66;&#x65F6;&#xFF0C;&#x5E26;&#x7740;&#x5BF9;&#x4F1F;&#x4EBA;&#x7684;&#x5D07;&#x656C;&#x4E4B;&#x5FC3;&#xFF0C;&#x4E0D;&#x4E45;&#x5C31;&#x4F1A;&#x4FBF;&#x4F1A;&#x75F4;&#x8FF7;&#x4E8E;&#x4E54;&#x5E03;&#x65AF;&#x7684;&#x7ECF;&#x5386;&#xFF0C;&#x4ED6;&#x7684;&#x4EBA;&#x751F;&#x4E0D;&#x53EF;&#x601D;&#x8BAE;&#xFF0C;&#x4E00;&#x4E2A;&#x4EBA;&#x5728;&#x88AB;&#x81EA;&#x5DF1;&#x521B;&#x5EFA;&#x7684;&#x516C;&#x53F8;&#x88C1;&#x6389;&#x4E4B;&#x540E;&#xFF0C;&#x6CA1;&#x6709;&#x88AB;&#x6253;&#x5012;&#xFF0C;&#x4F9D;&#x7136;&#x575A;&#x6301;&#x81EA;&#x5DF1;&#x70ED;&#x7231;&#x7684;&#x4E8B;&#x4E1A;&#xFF0C;&#x53C8;&#x662F;&#x9700;&#x8981;&#x591A;&#x5927;&#x7684;&#x51B3;&#x5FC3;&#xFF0C;&#x91CD;&#x56DE;&#x82F9;&#x679C;&#xFF0C;&#x62EF;&#x6551;&#x5944;&#x5944;&#x4E00;&#x606F;&#x7684;&#x82F9;&#x679C;&#x3002;&#x8BFB;&#x5B8C;&#x4E54;&#x5E03;&#x65AF;&#x7684;&#x7ECF;&#x5386;&#x540E;&#xFF0C;&#x9010;&#x6E10;&#x660E;&#x767D;&#xFF0C;&#x4E54;&#x5E03;&#x65AF;&#x4E5F;&#x5E76;&#x975E;&#x5723;&#x4EBA;&#xFF0C;&#x4ED6;&#x548C;&#x6211;&#x4EEC;&#x4E00;&#x6837;&#x90FD;&#x6709;&#x70ED;&#x7231;&#x7684;&#x4E8B;&#x7269;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x662F;&#xFF0C;&#x4ED6;&#x4E00;&#x76F4;&#x5728;&#x575A;&#x6301;&#x6301;&#x7EED;&#x4E0D;&#x65AD;&#x7684;&#x8FFD;&#x6C42;&#xFF0C;&#x800C;&#x6211;&#x4EEC;&#x4F3C;&#x4E4E;&#x5728;&#x4E0D;&#x65AD;&#x53D8;&#x5316;&#x8FFD;&#x6C42;&#xFF0C;&#x6CA1;&#x6709;&#x575A;&#x6301;&#x3002;&#x8FD9;&#x5C31;&#x662F;&#x4ED6;&#x4E3A;&#x4EC0;&#x4E48;&#x53EF;&#x4EE5;&#x6210;&#x4E3A;&#x4E54;&#x5E03;&#x65AF;&#xFF0C;&#x6211;&#x4EEC;&#x5927;&#x591A;&#x6570;&#x53EA;&#x80FD;&#x6210;&#x4E3A;&#x666E;&#x901A;&#x4EBA;&#x3002;</p>
<p>&#x8BFB;&#x4ED6;&#x5728;&#x65AF;&#x5766;&#x798F;&#x5927;&#x5B66;&#x7684;&#x6F14;&#x8BB2;&#x65F6;&#xFF0C;&#x7A81;&#x7136;&#x610F;&#x8BC6;&#x4ED6;&#xFF0C;&#x4E54;&#x5E03;&#x65AF;&#x5DF2;&#x7ECF;&#x662F;&#x4E00;&#x4E2A;&#x601D;&#x60F3;&#x5BB6;&#xFF0C;&#x54F2;&#x5B66;&#x5BB6;&#x3002;&#x4ED6;&#x5DF2;&#x7ECF;&#x6DF1;&#x523B;&#x7684;&#x9886;&#x609F;&#x4E86;&#x4EBA;&#x751F;&#xFF0C;&#x660E;&#x767D;&#x81EA;&#x5DF1;&#x60F3;&#x8981;&#x7684;&#xFF0C;&#x5982;&#x4F55;&#x5B9E;&#x73B0;&#x3002;</p>
<blockquote>
<p>&#x5C55;&#x671B;&#x672A;&#x6765;&#x65F6;&#xFF0C;&#x4F60;&#x4E0D;&#x53EF;&#x80FD;&#x9884;&#x77E5;&#x8FD9;&#x4E9B;&#x7247;&#x6BB5;&#x5C06;&#x5982;&#x4F55;&#x4E32;&#x8054;&#x8D77;&#x6765;&#xFF0C;&#x53EA;&#x6709;&#x5728;&#x56DE;&#x987E;&#x5F80;&#x4E8B;&#x65F6;&#x624D;&#x4F1A;&#x660E;&#x767D;&#x5176;&#x4E2D;&#x7684;&#x5173;&#x8054;&#x3002;&#x56E0;&#x6B64;&#x4F60;&#x5FC5;&#x987B;&#x76F8;&#x4FE1;&#x8FD9;&#x4E9B;&#x70B9;&#x70B9;&#x6EF4;&#x6EF4;&#x5728;&#x672A;&#x6765;&#x603B;&#x4F1A;&#x4EE5;&#x67D0;&#x79CD;&#x65B9;&#x5F0F;&#x4E32;&#x8054;&#x5728;&#x4E00;&#x8D77;&#x3002;&#x4F60;&#x5FC5;&#x987B;&#x8981;&#x76F8;&#x4FE1;&#x67D0;&#x4E9B;&#x4E1C;&#x897F;&#xFF0C;&#x6BD4;&#x5982;&#x52C7;&#x6C14;&#x3001;&#x547D;&#x8FD0;&#x3001;&#x751F;&#x547D;&#x3001;&#x56E0;&#x7F18;&#xFF0C;&#x7B49;&#x7B49;&#xFF0C;&#x56E0;&#x4E3A;&#x53EA;&#x6709;&#x76F8;&#x4FE1;&#x751F;&#x547D;&#x4E2D;&#x7684;&#x70B9;&#x6EF4;&#x5B9A;&#x4F1A;&#x5728;&#x672A;&#x6765;&#x76F8;&#x4E32;&#x8054;&#xFF0C;&#x4F60;&#x624D;&#x4F1A;&#x62E5;&#x6709;&#x542C;&#x4ECE;&#x81EA;&#x5DF1;&#x5185;&#x5FC3;&#x7684;&#x52C7;&#x6C14;&#xFF0C;&#x5373;&#x4F7F;&#x4F60;&#x7684;&#x5185;&#x5FC3;&#x5C06;&#x5F15;&#x5BFC;&#x4F60;&#x79BB;&#x5F00;&#x719F;&#x6089;&#x7684;&#x5BFB;&#x5E38;&#x4E4B;&#x8DEF;&#x3002;&#x8FD9;&#x5C06;&#x8BA9;&#x4F60;&#x53D8;&#x5F97;&#x4E0E;&#x4F17;&#x4E0D;&#x540C;&#x3002;  </p>
<p>&#x4F60;&#x4EEC;&#x7684;&#x65F6;&#x95F4;&#x6709;&#x9650;&#xFF0C;&#x522B;&#x6D6A;&#x8D39;&#x5728;&#x91CD;&#x590D;&#x5176;&#x4ED6;&#x4EBA;&#x7684;&#x751F;&#x6D3B;&#x4E0A;&#x3002;&#x4E0D;&#x8981;&#x88AB;&#x6559;&#x6761;&#x675F;&#x7F1A;&#xFF0C;&#x6559;&#x6761;&#x4F1A;&#x628A;&#x4F60;&#x56F0;&#x5728;&#x522B;&#x4EBA;&#x601D;&#x8003;&#x7684;&#x7ED3;&#x679C;&#x91CC;&#x3002;&#x4E0D;&#x8981;&#x8BA9;&#x5176;&#x4ED6;&#x4EBA;&#x7684;&#x89C2;&#x70B9;&#x63A9;&#x76D6;&#x4F60;&#x5185;&#x5FC3;&#x7684;&#x58F0;&#x97F3;&#x3002;&#x66F4;&#x91CD;&#x8981;&#x7684;&#x662F;&#xFF0C;&#x8981;&#x6709;&#x52C7;&#x6C14;&#x542C;&#x4ECE;&#x76F4;&#x89C9;&#x548C;&#x5185;&#x5FC3;&#x7684;&#x6307;&#x5F15;&#xFF0C;&#x5B83;&#x4EEC;&#x5728;&#x67D0;&#x79CD;&#x7A0B;&#x5EA6;&#x4E0A;&#x65E9;&#x5C31;&#x77E5;&#x9053;&#x4F60;&#x60F3;&#x6210;&#x4E3A;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x4EBA;&#xFF0C;&#x5176;&#x4ED6;&#x4E00;&#x5207;&#x90FD;&#x4E0D;&#x91CD;&#x8981;&#x3002;  </p>
<p>&#x4F60;&#x7684;&#x5DE5;&#x4F5C;&#x5C06;&#x4F1A;&#x5360;&#x636E;&#x751F;&#x6D3B;&#x4E2D;&#x5F88;&#x5927;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x3002;&#x4F60;&#x53EA;&#x6709;&#x76F8;&#x4FE1;&#x81EA;&#x5DF1;&#x6240;&#x505A;&#x7684;&#x662F;&#x4F1F;&#x5927;&#x7684;&#x5DE5;&#x4F5C;, &#x4F60;&#x624D;&#x80FD;&#x6021;&#x7136;&#x81EA;&#x5F97;&#x3002;&#x5982;&#x679C;&#x4F60;&#x73B0;&#x5728;&#x8FD8;&#x6CA1;&#x6709;&#x627E;&#x5230;, &#x90A3;&#x4E48;&#x7EE7;&#x7EED;&#x627E;&#x3001;&#x4E0D;&#x8981;&#x505C;&#x4E0B;&#x6765;&#x3001;&#x5168;&#x5FC3;&#x5168;&#x610F;&#x7684;&#x53BB;&#x627E;, &#x5F53;&#x4F60;&#x627E;&#x5230;&#x7684;&#x65F6;&#x5019;&#x4F60;&#x5C31;&#x4F1A;&#x77E5;&#x9053;&#x7684;&#x3002;&#x5C31;&#x50CF;&#x4EFB;&#x4F55;&#x771F;&#x8BDA;&#x7684;&#x5173;&#x7CFB;, &#x968F;&#x7740;&#x5C81;&#x6708;&#x7684;&#x6D41;&#x901D;&#x53EA;&#x4F1A;&#x8D8A;&#x6765;&#x8D8A;&#x7D27;&#x5BC6;&#x3002;&#x6240;&#x4EE5;&#x7EE7;&#x7EED;&#x627E;&#xFF0C;&#x76F4;&#x5230;&#x4F60;&#x627E;&#x5230;&#x5B83;&#xFF0C;&#x4E0D;&#x8981;&#x505C;&#x4E0B;&#x6765;!  </p>
</blockquote>
<p>&#x8FD9;&#x4E0D;&#x4EC5;&#x662F;&#x5BF9;&#x65AF;&#x5766;&#x798F;&#x5927;&#x5B66;&#x7684;&#x5B66;&#x751F;&#x7684;&#x5FE0;&#x544A;&#xFF0C;&#x4E5F;&#x662F;&#x5BF9;&#x81EA;&#x5DF1;&#x4E00;&#x751F;&#x7684;&#x603B;&#x7ED3;&#x5427;&#x3002;&#x53E5;&#x53E5;&#x5145;&#x6EE1;&#x4E86;&#x4EBA;&#x751F;&#x7684;&#x54F2;&#x5B66;&#xFF0C;&#x5F15;&#x4EBA;&#x601D;&#x8003;&#x3002;&#x5F53;&#x81EA;&#x5DF1;&#x7A81;&#x7136;&#x8FF7;&#x832B;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8BFB;&#x8FD9;&#x6BB5;&#x8BDD;&#xFF0C;&#x53C8;&#x4F1A;&#x91CD;&#x65B0;&#x71C3;&#x8D77;&#x6597;&#x5FD7;&#x3002;</p>
<p><strong>&#x8D28;&#x7591;&#x4E00;&#x5207;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x6743;&#x5A01;&#xFF1B;&#x52C7;&#x4E8E;&#x5C1D;&#x8BD5;&#xFF1B;&#x4E0A;&#x8DEF;&#x6D41;&#x6D6A;&#xFF1B;&#x65E0;&#x6240;&#x754F;&#x60E7;&#xFF1B;&#x521B;&#x9020;&#x4E00;&#x4E2A;&#x66F4;&#x7F8E;&#x597D;&#x7684;&#x4E16;&#x754C;&#x3002;</strong></p>

      
    </div>

    

    
    
    

    

    
      
    
    

    

    <footer class="post-footer">
      

      
      
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2017/08/21/Spark本地开发环境搭建与远程debug设置/" rel="next" title="（一）Spark本地开发环境搭建与远程debug设置">
                <i class="fa fa-chevron-left"></i> （一）Spark本地开发环境搭建与远程debug设置
              </a>
            
          </div>

          <span class="post-nav-divider"></span>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2017/09/07/HBase工具之BulkLoad/" rel="prev" title="（五）HBase工具之BulkLoad">
                （五）HBase工具之BulkLoad <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </div>
  
  
  
  </article>


  </div>


          </div>
          

  



        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap">
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview-wrap">
            站点概览
          </li>
        </ul>
      

      <div class="site-overview-wrap sidebar-panel">
        <div class="site-overview">
          <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
            
              <p class="site-author-name" itemprop="name">Kavim</p>
              <div class="site-description motion-element" itemprop="description">生活不止眼前的苟且 还有诗和远方的田野</div>
          </div>

          
            <nav class="site-state motion-element">
              
                <div class="site-state-item site-state-posts">
                
                  <a href="/archives/">
                
                    <span class="site-state-item-count">47</span>
                    <span class="site-state-item-name">日志</span>
                  </a>
                </div>
              

              
                
                
                <div class="site-state-item site-state-categories">
                  
                    
                      <a href="/categories/">
                    
                  
                    
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                    <span class="site-state-item-count">22</span>
                    <span class="site-state-item-name">分类</span>
                  </a>
                </div>
              

              
                
                
                <div class="site-state-item site-state-tags">
                  
                    
                      <a href="/tags/">
                    
                  
                    
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                    <span class="site-state-item-count">18</span>
                    <span class="site-state-item-name">标签</span>
                  </a>
                </div>
              
            </nav>
          

          

          

          

          

          
          

          
            
          
          

        </div>
      </div>

      
      <!--noindex-->
        <div class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">

            
            
            
            

            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-2"><a class="nav-link" href="#《摆渡人》"><span class="nav-number">1.</span> <span class="nav-text">《摆渡人》</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#《成为乔布斯》"><span class="nav-number">2.</span> <span class="nav-text">《成为乔布斯》</span></a></li></ol></div>
            

          </div>
        </div>
      <!--/noindex-->
      

      

    </div>
  </aside>
  


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright">&copy; <span itemprop="copyrightYear">2019</span>
  <span class="with-love" id="animate">
    <i class="fa fa-user"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">Kavim</span>

  

  
</div>


  <div class="powered-by">由 <a href="https://hexo.io" class="theme-link" rel="noopener" target="_blank">Hexo</a> 强力驱动 v3.2.2</div>



  <span class="post-meta-divider">|</span>



  <div class="theme-info">主题 – <a href="https://theme-next.org" class="theme-link" rel="noopener" target="_blank">NexT.Pisces</a> v7.1.0</div>




        








        
      </div>
    </footer>

    
      <div class="back-to-top">
        <i class="fa fa-arrow-up"></i>
        
      </div>
    

    

    

    
  </div>

  

<script>
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>


























  
  <script src="/lib/jquery/index.js?v=2.1.3"></script>

  
  <script src="/lib/velocity/velocity.min.js?v=1.2.1"></script>

  
  <script src="/lib/velocity/velocity.ui.min.js?v=1.2.1"></script>


  


  <script src="/js/utils.js?v=7.1.0"></script>

  <script src="/js/motion.js?v=7.1.0"></script>



  
  


  <script src="/js/affix.js?v=7.1.0"></script>

  <script src="/js/schemes/pisces.js?v=7.1.0"></script>



  
  <script src="/js/scrollspy.js?v=7.1.0"></script>
<script src="/js/post-details.js?v=7.1.0"></script>



  


  <script src="/js/next-boot.js?v=7.1.0"></script>


  

  

  

  


  


  




  

  

  

  

  

  

  

  

  

  

  

  

  

  

</body>
</html>
