<!DOCTYPE html>



  


<html class="theme-next gemini use-motion" lang="zh-Hans">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=2"/>
<meta name="theme-color" content="#222">












<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />






















<link href="/lib/font-awesome/css/font-awesome.min.css?v=4.6.2" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=6.1.0" rel="stylesheet" type="text/css" />


  <link rel="apple-touch-icon" sizes="180x180" href="/images/apple-touch-icon-next.png?v=6.1.0">


  <link rel="icon" type="image/png" sizes="32x32" href="/images/favicon-32x32-next.png?v=6.1.0">


  <link rel="icon" type="image/png" sizes="16x16" href="/images/favicon-16x16-next.png?v=6.1.0">


  <link rel="mask-icon" href="/images/logo.svg?v=6.1.0" color="#222">









<script type="text/javascript" id="hexo.configurations">
  var NexT = window.NexT || {};
  var CONFIG = {
    root: '/',
    scheme: 'Gemini',
    version: '6.1.0',
    sidebar: {"position":"left","display":"post","offset":12,"b2t":false,"scrollpercent":false,"onmobile":false},
    fancybox: false,
    fastclick: false,
    lazyload: false,
    tabs: true,
    motion: {"enable":true,"async":false,"transition":{"post_block":"fadeIn","post_header":"slideDownIn","post_body":"slideDownIn","coll_header":"slideLeftIn","sidebar":"slideUpIn"}},
    algolia: {
      applicationID: '',
      apiKey: '',
      indexName: '',
      hits: {"per_page":10},
      labels: {"input_placeholder":"Search for Posts","hits_empty":"We didn't find any results for the search: ${query}","hits_stats":"${hits} results found in ${time} ms"}
    }
  };
</script>


  




  <meta name="description" content="&amp;#x5317;&amp;#x4EAC;&amp;#x8FD9;&amp;#x51E0;&amp;#x5929;&amp;#x5B9E;&amp;#x5728;&amp;#x662F;&amp;#x592A;&amp;#x95F7;&amp;#x70ED;&amp;#x4E86;&amp;#xFF0C;&amp;#x6211;&amp;#x53BB;&amp;#x54C8;&amp;#x5C14;&amp;#x6EE8;&amp;#x53C2;&amp;#x52A0;&amp;#x4E00;&amp;#x4E0B;&amp;#x7B2C;&amp;#x4E03;&amp;#x5C4A">
<meta property="og:type" content="article">
<meta property="og:title" content="SMP2018参会见闻">
<meta property="og:url" content="https://xuxping.github.io/2018/08/06/SMP2018参会见闻/index.html">
<meta property="og:site_name" content="Kavim">
<meta property="og:description" content="&amp;#x5317;&amp;#x4EAC;&amp;#x8FD9;&amp;#x51E0;&amp;#x5929;&amp;#x5B9E;&amp;#x5728;&amp;#x662F;&amp;#x592A;&amp;#x95F7;&amp;#x70ED;&amp;#x4E86;&amp;#xFF0C;&amp;#x6211;&amp;#x53BB;&amp;#x54C8;&amp;#x5C14;&amp;#x6EE8;&amp;#x53C2;&amp;#x52A0;&amp;#x4E00;&amp;#x4E0B;&amp;#x7B2C;&amp;#x4E03;&amp;#x5C4A">
<meta property="og:image" content="https://xuxping.github.io/2018/08/06/SMP2018参会见闻/4D50C0D4-36D1-430B-8CFA-9C8D73726833.jpg">
<meta property="og:updated_time" content="2018-08-07T01:25:20.832Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="SMP2018参会见闻">
<meta name="twitter:description" content="&amp;#x5317;&amp;#x4EAC;&amp;#x8FD9;&amp;#x51E0;&amp;#x5929;&amp;#x5B9E;&amp;#x5728;&amp;#x662F;&amp;#x592A;&amp;#x95F7;&amp;#x70ED;&amp;#x4E86;&amp;#xFF0C;&amp;#x6211;&amp;#x53BB;&amp;#x54C8;&amp;#x5C14;&amp;#x6EE8;&amp;#x53C2;&amp;#x52A0;&amp;#x4E00;&amp;#x4E0B;&amp;#x7B2C;&amp;#x4E03;&amp;#x5C4A">
<meta name="twitter:image" content="https://xuxping.github.io/2018/08/06/SMP2018参会见闻/4D50C0D4-36D1-430B-8CFA-9C8D73726833.jpg">






  <link rel="canonical" href="https://xuxping.github.io/2018/08/06/SMP2018参会见闻/"/>



<script type="text/javascript" id="page.configurations">
  CONFIG.page = {
    sidebar: "",
  };
</script>

  <title>SMP2018参会见闻 | Kavim</title>
  









  <noscript>
  <style type="text/css">
    .use-motion .motion-element,
    .use-motion .brand,
    .use-motion .menu-item,
    .sidebar-inner,
    .use-motion .post-block,
    .use-motion .pagination,
    .use-motion .comments,
    .use-motion .post-header,
    .use-motion .post-body,
    .use-motion .collection-title { opacity: initial; }

    .use-motion .logo,
    .use-motion .site-title,
    .use-motion .site-subtitle {
      opacity: initial;
      top: initial;
    }

    .use-motion {
      .logo-line-before i { left: initial; }
      .logo-line-after i { right: initial; }
    }
  </style>
</noscript>

</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  
  
    
  

  <div class="container sidebar-position-left page-post-detail">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"> 

<div class="site-brand-wrapper">
  <div class="site-meta ">
    

    <div class="custom-logo-site-title">
      <a href="/" class="brand" rel="start">
        <span class="logo-line-before"><i></i></span>
        <span class="site-title">Kavim</span>
        <span class="logo-line-after"><i></i></span>
      </a>
    </div>
      
        <p class="site-subtitle">一点一滴积累</p>
      
  </div>

  <div class="site-nav-toggle">
    <button aria-label="Toggle navigation bar">
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
    </button>
  </div>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        
          
  <li class="menu-item menu-item-home">
    <a href="/" rel="section">
      <i class="menu-item-icon fa fa-fw fa-home"></i> <br />Home</a>
</li>

      
        
        
          
  <li class="menu-item menu-item-archives">
    <a href="/archives/" rel="section">
      <i class="menu-item-icon fa fa-fw fa-archive"></i> <br />Archives</a>
</li>

      

      
    </ul>
  

  

  
</nav>


  



 </div>
    </header>

    


    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          
            

          
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  

  
  
  

  

  <article class="post post-type-normal" itemscope itemtype="http://schema.org/Article">
  
  
  
  <div class="post-block">
    <link itemprop="mainEntityOfPage" href="https://xuxping.github.io/2018/08/06/SMP2018参会见闻/">

    <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
      <meta itemprop="name" content="Kavim">
      <meta itemprop="description" content="">
      <meta itemprop="image" content="/images/avatar.gif">
    </span>

    <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
      <meta itemprop="name" content="Kavim">
    </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">SMP2018参会见闻</h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              
                <span class="post-meta-item-text">Posted on</span>
              
              <time title="Post created" itemprop="dateCreated datePublished" datetime="2018-08-06T21:12:29+08:00">2018-08-06</time>
            

            
            

            
          </span>

          
            <span class="post-category" >
            
              <span class="post-meta-divider">|</span>
            
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              
                <span class="post-meta-item-text">In</span>
              
              
                <span itemprop="about" itemscope itemtype="http://schema.org/Thing"><a href="/categories/个人笔记/" itemprop="url" rel="index"><span itemprop="name">个人笔记</span></a></span>

                
                
              
            </span>
          

          
            
          

          
          

          

          

          

        </div>
      </header>
    

    
    
    
    <div class="post-body" itemprop="articleBody">

      
      

      
        <p><img src="/2018/08/06/SMP2018&#x53C2;&#x4F1A;&#x89C1;&#x95FB;/4D50C0D4-36D1-430B-8CFA-9C8D73726833.jpg" alt=""></p>
<p>&#x5317;&#x4EAC;&#x8FD9;&#x51E0;&#x5929;&#x5B9E;&#x5728;&#x662F;&#x592A;&#x95F7;&#x70ED;&#x4E86;&#xFF0C;&#x6211;&#x53BB;&#x54C8;&#x5C14;&#x6EE8;&#x53C2;&#x52A0;&#x4E00;&#x4E0B;&#x7B2C;&#x4E03;&#x5C4A;&#x5168;&#x56FD;&#x793E;&#x4F1A;&#x5A92;&#x4F53;&#x5904;&#x7406;&#x5927;&#x4F1A;&#xFF0C;&#x987A;&#x4FBF;&#x907F;&#x4E2A;&#x6691;&#x3002;&#x4E0B;&#x9762;&#x4E3B;&#x8981;&#x4ECB;&#x7ECD;&#x4E00;&#x4E0B;&#x8FD9;&#x51E0;&#x5929;&#x7684;&#x89C1;&#x95FB;&#x3002;<br><a id="more"></a></p>
<h2 id="&#x4F1A;&#x8BAE;&#x7B80;&#x4ECB;"><a href="#&#x4F1A;&#x8BAE;&#x7B80;&#x4ECB;" class="headerlink" title="&#x4F1A;&#x8BAE;&#x7B80;&#x4ECB;"></a>&#x4F1A;&#x8BAE;&#x7B80;&#x4ECB;</h2><p>&#x5168;&#x56FD;&#x793E;&#x4F1A;&#x5A92;&#x4F53;&#x5904;&#x7406;&#x5927;&#x4F1A;&#x4ECE;12&#x5E74;&#x5F00;&#x59CB;&#x4E3E;&#x529E;&#xFF0C;&#x81F3;&#x4ECA;&#x5DF2;&#x7ECF;&#x529E;&#x5230;&#x4E86;&#x7B2C;&#x4E03;&#x5C4A;&#xFF0C;&#x4E3B;&#x8981;&#x5173;&#x6CE8;&#x793E;&#x4F1A;&#x5A92;&#x4F53;&#xFF0C;&#x7ECF;&#x6D4E;&#x4E0E;&#x5927;&#x6570;&#x636E;&#x6280;&#x672F;&#x7B49;&#x8DE8;&#x5B66;&#x79D1;&#xFF0C;&#x8DE8;&#x9886;&#x57DF;&#x7684;&#x5408;&#x4F5C;&#x3002;&#x4ECA;&#x5E74;&#x7531;&#x4E2D;&#x56FD;&#x4E2D;&#x6587;&#x4FE1;&#x606F;&#x5B66;&#x4F1A;&#x793E;&#x4F1A;&#x5A92;&#x4F53;&#x5904;&#x7406;&#x4E13;&#x59D4;&#x4F1A;&#x4E3B;&#x529E;&#x3001;&#x54C8;&#x5C14;&#x6EE8;&#x5DE5;&#x4E1A;&#x5927;&#x5B66;&#x627F;&#x529E;&#x7684;&#x7B2C;&#x4E03;&#x5C4A;&#x5168;&#x56FD;&#x793E;&#x4F1A;&#x5A92;&#x4F53;&#x5904;&#x7406;&#x5927;&#x4F1A;&#xFF08;SMP2018&#xFF09;&#x5728;2018&#x5E74;8&#x6708;2-4&#x65E5;&#x5728;&#x54C8;&#x5C14;&#x6EE8;&#x53EC;&#x5F00;&#xFF0C;&#x672C;&#x6B21;&#x5927;&#x4F1A;&#x9080;&#x8BF7;&#x5230;&#x4E86;&#x591A;&#x4F4D;&#x56FD;&#x5185;&#x5916;&#x8457;&#x540D;&#x4E13;&#x5BB6;&#x5B66;&#x8005;&#x548C;&#x4E1A;&#x754C;&#x7FD8;&#x695A;&#x8FDB;&#x884C;&#x5927;&#x4F1A;&#x4E3B;&#x9898;&#x62A5;&#x544A;&#xFF0C;&#x53E6;&#x5916;&#x8FD8;&#x9080;&#x8BF7;&#x5230;&#x4E86;&#x60C5;&#x611F;&#x5206;&#x6790;&#x548C;&#x793E;&#x4F1A;&#x79D1;&#x5B66;&#x9886;&#x57DF;&#x7684;&#x8457;&#x540D;&#x4E13;&#x5BB6;&#x5B66;&#x8005;&#x8FDB;&#x884C;&#x5206;&#x8BBA;&#x575B;&#x62A5;&#x544A;&#x3002;</p>
<p>&#x5927;&#x4F1A;&#x5206;&#x4E3A;&#x8BB2;&#x4E60;&#x73ED;&#xFF0C;&#x7279;&#x9080;&#x62A5;&#x544A;&#xFF0C;&#x5206;&#x8BBA;&#x575B;&#x62A5;&#x544A;&#xFF0C;&#x6280;&#x672F;&#x8BC4;&#x6D4B;&#x3002;&#x8BB2;&#x4E60;&#x73ED;&#x4FA7;&#x91CD;&#x524D;&#x6CBF;&#x77E5;&#x8BC6;&#x5206;&#x4EAB;&#x548C;&#x79D1;&#x666E;&#xFF1B;&#x7279;&#x9080;&#x62A5;&#x544A;&#x9080;&#x8BF7;&#x793E;&#x4F1A;&#x5A92;&#x4F53;&#x9886;&#x57DF;&#x5185;&#x7684;&#x4E13;&#x5BB6;&#x5B66;&#x8005;&#x8FDB;&#x884C;&#x5206;&#x4EAB;&#xFF1B;&#x5206;&#x8BBA;&#x575B;&#x62A5;&#x544A;&#x4E3B;&#x8981;&#x662F;&#x4E0D;&#x540C;&#x9886;&#x57DF;&#x7C7B;&#x7684;&#x62A5;&#x544A;&#xFF0C;&#x4ECA;&#x5E74;&#x5206;&#x4E3A;&#x667A;&#x80FD;&#x91D1;&#x878D;&#xFF0C;&#x8BA1;&#x7B97;&#x673A;&#x4F20;&#x64AD;&#x5B66;&#xFF0C;&#x667A;&#x80FD;&#x53F8;&#x6CD5;&#xFF0C;&#x667A;&#x80FD;&#x6559;&#x80B2;&#xFF0C;&#x60C5;&#x611F;&#x5206;&#x6790;&#x7B49;&#x8BBA;&#x575B;&#xFF1B;&#x6280;&#x672F;&#x8BC4;&#x6D4B;&#x6211;&#x6CA1;&#x53C2;&#x52A0;&#xFF1B;&#x4ECA;&#x5E74;&#x53C2;&#x4F1A;&#x4EBA;&#x6570;&#x4F30;&#x6478;&#x7740;&#x4E5F;&#x6709;&#x8D85;&#x8FC7;600&#x4EBA;&#x3002;</p>
<h2 id="&#x7279;&#x9080;&#x62A5;&#x544A;&#x548C;&#x8BBA;&#x575B;"><a href="#&#x7279;&#x9080;&#x62A5;&#x544A;&#x548C;&#x8BBA;&#x575B;" class="headerlink" title="&#x7279;&#x9080;&#x62A5;&#x544A;&#x548C;&#x8BBA;&#x575B;"></a>&#x7279;&#x9080;&#x62A5;&#x544A;&#x548C;&#x8BBA;&#x575B;</h2><p>&#x6211;&#x53C2;&#x52A0;&#x4E86;&#x4E24;&#x5929;&#x4E0A;&#x5348;&#x7684;&#x7279;&#x9080;&#x62A5;&#x544A;&#x548C;&#x667A;&#x80FD;&#x91D1;&#x878D;&#xFF0C;&#x667A;&#x80FD;&#x6559;&#x80B2;&#xFF0C;&#x8BA1;&#x7B97;&#x673A;&#x4F20;&#x64AD;&#x5B66;&#x4E0E;&#x60C5;&#x611F;&#x5206;&#x6790;&#x8BBA;&#x575B;&#x3002;<br>&#x7279;&#x9080;&#x62A5;&#x544A;&#x6709;&#x4E24;&#x4E2A;&#x4E3B;&#x9898;&#x7ED9;&#x4E86;&#x6211;&#x6DF1;&#x523B;&#x7684;&#x5370;&#x8C61;&#xFF1A;&#x7B2C;&#x4E00;&#x4E2A;&#x662F;&#x674E;&#x5B87;&#x660E;&#x6559;&#x6388;&#x8BB2;&#x4E86;&#x4E16;&#x754C;&#x77E5;&#x8BC6;&#x7684;&#x4E2D;&#x6587;&#x8868;&#x8FBE;&#x95EE;&#x9898;&#x3002;&#x4E2D;&#x6587;&#x867D;&#x7136;&#x4F34;&#x968F;&#x7740;&#x4E2D;&#x56FD;&#x56FD;&#x529B;&#x7684;&#x63D0;&#x5347;&#xFF0C;&#x4E5F;&#x52A0;&#x5FEB;&#x4E86;&#x56FD;&#x9645;&#x4F20;&#x64AD;&#x7684;&#x6B65;&#x4F10;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x56FD;&#x9645;&#x79D1;&#x5B66;&#x6280;&#x672F;&#x9886;&#x57DF;&#x5374;&#x540C;&#x82F1;&#x8BED;&#x4E4B;&#x5916;&#x7684;&#x5176;&#x4ED6;&#x8BED;&#x8A00;&#x4E00;&#x6837;&#xFF0C;&#x88AB;&#x4E25;&#x91CD;&#x8FB9;&#x7F18;&#x5316;&#x3002;&#x5176;&#x6307;&#x51FA;&#x4E2D;&#x56FD;&#x73B0;&#x6709;&#x5927;&#x90E8;&#x5206;&#x53D1;&#x8868;&#x7684;&#x79D1;&#x7814;&#x8BBA;&#x6587;&#x90FD;&#x4E0D;&#x662F;&#x4E2D;&#x6587;&#x9996;&#x53D1;&#x800C;&#x662F;&#x82F1;&#x6587;&#x9996;&#x53D1;&#xFF0C;&#x5BFC;&#x81F4;&#x56FD;&#x4EBA;&#x5728;&#x83B7;&#x53D6;&#x77E5;&#x8BC6;&#x65F6;&#x53C8;&#x9700;&#x8981;&#x8F6C;&#x6362;&#x6210;&#x4E2D;&#x6587;&#x3002;&#x56FD;&#x4EBA;&#x53D1;&#x8868;&#x7684;&#x7814;&#x7A76;&#x6210;&#x679C;&#x5374;&#x4E0D;&#x80FD;&#x9996;&#x5148;&#x7528;&#x4E8E;&#x56FD;&#x5185;&#xFF0C;&#x8FD9;&#x5C06;&#x5BF9;&#x56FD;&#x4EBA;&#x83B7;&#x53D6;&#x4E16;&#x754C;&#x79D1;&#x6280;&#x77E5;&#x8BC6;&#x5F62;&#x6210;&#x4E25;&#x91CD;&#x969C;&#x788D;&#xFF0C;&#x5C06;&#x5BF9;&#x4E2D;&#x534E;&#x6587;&#x5316;&#x7684;&#x53D1;&#x5C55;&#x5F3A;&#x76DB;&#x5E26;&#x6765;&#x4E25;&#x91CD;&#x5F71;&#x54CD;&#x3002;</p>
<p>&#x7B2C;&#x4E8C;&#x4E2A;&#x662F;&#x5F20;&#x6D2A;&#x5FE0;&#x6559;&#x6388;&#x7684;&#x300A;&#x5F02;&#x7C7B;&#x8FD8;&#x662F;&#x5171;&#x751F;&#xFF1A;&#x793E;&#x4EA4;&#x7F51;&#x7EDC;&#x4E2D;&#x4EBA;&#x4E0E;AI&#x7684;&#x5173;&#x7CFB;&#x63A2;&#x8BA8;&#x7684;&#x62A5;&#x544A;&#x300B;&#xFF0C;&#x5982;&#x4ECA;&#x793E;&#x4EA4;&#x7F51;&#x7EDC;&#x4E0A;&#x5B58;&#x5728;&#x7740;&#x5927;&#x91CF;&#x7684;&#x673A;&#x5668;&#x4EBA;&#xFF0C;&#x6709;&#x670D;&#x52A1;&#x6027;&#x673A;&#x5668;&#x4EBA;&#xFF0C;&#x6709;&#x804A;&#x5929;&#x6027;&#x673A;&#x5668;&#x4EBA;&#xFF0C;&#x5F53;&#x7136;&#x4E5F;&#x6709;&#x64CD;&#x63A7;&#x793E;&#x4EA4;&#x7B49;&#x6709;&#x5BB3;&#x7684;&#x673A;&#x5668;&#x4EBA;&#x3002;&#x800C;&#x5F53;&#x524D;&#x7684;AI&#x673A;&#x5668;&#x4EBA;&#x7814;&#x7A76;&#x7684;&#x4E24;&#x4E2A;&#x7279;&#x70B9;&#xFF1A;&#x4E00;&#x662F;&#x8BA1;&#x7B97;&#x673A;&#x79D1;&#x5B66;&#x5BB6;&#x4EEC;&#x66F4;&#x591A;&#x4ECE;&#x6280;&#x672F;&#x89D2;&#x5EA6;&#x51FA;&#x53D1;&#xFF0C;&#x5173;&#x6CE8;AI&#x673A;&#x5668;&#x4EBA;&#x7684;&#x8BC6;&#x522B;&#x3001;&#x6392;&#x9664;&#x4E0E;&#x5236;&#x9020;&#x7B49;&#x95EE;&#x9898;&#xFF1B;&#x4E8C;&#x662F;&#x793E;&#x4F1A;&#x79D1;&#x5B66;&#x7814;&#x7A76;&#x8005;&#x5219;&#x5C06;AI&#x673A;&#x5668;&#x4EBA;&#x89C6;&#x4E3A;&#x865A;&#x5047;&#x7684;&#x4FE1;&#x606F;&#x6E90;&#x3001;&#x5E72;&#x6270;&#x6027;&#x7684;&#x4FE1;&#x606F;&#x5185;&#x5BB9;&#xFF0C;&#x770B;&#x4F5C;&#x793E;&#x4EA4;&#x5A92;&#x4F53;&#x4E2D;&#x7684;&#x566A;&#x97F3;&#x548C;&#x6742;&#x8D28;&#xFF0C;&#x4E3B;&#x5F20;&#x5BF9;AI&#x673A;&#x5668;&#x4EBA;&#x8FDB;&#x884C;&#x6279;&#x5224;&#x6216;&#x4E88;&#x4EE5;&#x5FFD;&#x89C6;&#x3002;&#x4ECE;&#x672C;&#x8D28;&#x4E0A;&#x770B;&#xFF0C;&#x4E24;&#x7C7B;&#x5B66;&#x8005;&#x4EEC;&#x90FD;&#x5C06;AI&#x673A;&#x5668;&#x4EBA;&#x89C6;&#x4E3A;&#x793E;&#x4F1A;&#x7F51;&#x7EDC;&#x4E2D;&#x7684;&#x201C;&#x5F02;&#x7C7B;&#x201D;&#x3002;&#x672A;&#x6765;&#x6211;&#x4EEC;&#x5C06;&#x4E0D;&#x5F97;&#x4E0D;&#x9762;&#x5BF9;&#x8FD9;&#x79CD;&#x4EBA;&#x4E0E;AI&#x5728;&#x793E;&#x4EA4;&#x7F51;&#x7EDC;&#x4E0A;&#x5171;&#x5B58;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x667A;&#x80FD;&#x91D1;&#x878D;&#x4E3B;&#x8981;&#x8BB2;&#x4E86;&#x4ECE;&#x5927;&#x6570;&#x636E;&#xFF0C;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x5230;&#x91D1;&#x878D;&#x79D1;&#x6280;&#x7684;&#x53D1;&#x5C55;&#xFF0C;&#x591A;&#x9886;&#x57DF;&#x7684;&#x7ED3;&#x5408;&#x3002;&#x6B66;&#x6C49;&#x5927;&#x5B66;&#x7684;&#x5F6D;&#x654F;&#x8001;&#x5E08;&#x4ECB;&#x7ECD;&#x4E86;&#x4ED6;&#x4EEC;&#x7814;&#x53D1;&#x7684;&#x667A;&#x80FD;&#x91CF;&#x5316;&#x4EA4;&#x6613;&#x7684;&#x81EA;&#x9002;&#x5E94;&#x91CF;&#x5316;&#x7CFB;&#x7EDF;SAQ&#xFF0C;&#x5176;&#x4E2D;&#x90E8;&#x5206;&#x8981;&#x70B9;&#x5BF9;&#x516C;&#x53F8;&#x7684;&#x91CF;&#x5316;&#x7814;&#x7A76;&#x5177;&#x6709;&#x4E00;&#x4E9B;&#x542F;&#x53D1;&#x3002;&#x817E;&#x8BAF;&#x516C;&#x53F8;&#x9648;&#x57F9;&#x70AB;&#x9AD8;&#x7EA7;&#x5DE5;&#x7A0B;&#x5E08;&#x4ECB;&#x7ECD;&#x4E86;&#x793E;&#x4EA4;&#x7F51;&#x7EDC;&#x6280;&#x672F;&#x5728;&#x91D1;&#x878D;&#x98CE;&#x63A7;&#x9886;&#x57DF;&#x7684;&#x5E94;&#x7528;&#xFF0C;&#x5F53;&#x7136;&#x8FD9;&#x4E2A;&#x53EA;&#x6709;&#x817E;&#x8BAF;&#x8FD9;&#x6837;&#x62E5;&#x6709;&#x6D77;&#x91CF;&#x7684;&#x793E;&#x4EA4;&#x7F51;&#x7EDC;&#x624D;&#x80FD;&#x5E94;&#x7528;&#x5230;&#x91D1;&#x878D;&#x98CE;&#x63A7;&#x9886;&#x57DF;&#x3002;&#x6700;&#x540E;&#x54C8;&#x5C14;&#x6EE8;&#x5DE5;&#x4E1A;&#x5927;&#x5B66;SCIR&#x4E01;&#x6548;&#x4ECB;&#x7ECD;&#x4E86;&#x4ED6;&#x4EEC;&#x63D0;&#x51FA;&#x7684;&#x4E8B;&#x7406;&#x56FE;&#x8C31;&#xFF0C;&#x5E76;&#x4E14;&#x5728;&#x6B64;&#x57FA;&#x7840;&#x4E0A;,&#xFF0C;&#x5229;&#x7528;&#x5F3A;&#x5316;&#x5B66;&#x4E60;&#x6765;&#x9884;&#x6D4B;&#x80A1;&#x5E02;&#x7684;&#x6DA8;&#x8DCC;&#x3002;&#x867D;&#x7136;&#x51C6;&#x786E;&#x7387;&#x4E0D;&#x662F;&#x5F88;&#x9AD8;&#xFF0C;&#x4F46;&#x6211;&#x5BF9;&#x8FD9;&#x4E2A;&#x6280;&#x672F;&#x7279;&#x522B;&#x5F88;&#x611F;&#x5174;&#x8DA3;&#xFF0C;&#x8DDF;&#x6211;&#x4EE5;&#x540E;&#x60F3;&#x505A;&#x7684;&#x6709;&#x70B9;&#x7C7B;&#x4F3C;&#x3002;</p>
<p>&#x667A;&#x80FD;&#x6559;&#x80B2;&#x8BBA;&#x575B;&#xFF0C;&#x5317;&#x4EAC;&#x8BED;&#x8A00;&#x667A;&#x80FD;&#x7814;&#x7A76;&#x9662;&#x7684;&#x5F20;&#x8DC3;&#x4ECB;&#x7ECD;&#x4E86;&#x4ED6;&#x4EEC;&#x7814;&#x53D1;&#x7684;&#x5C0F;&#x5B66;&#x82F1;&#x8BED;&#x4F5C;&#x6587;&#x667A;&#x80FD;&#x6279;&#x6539;&#x7CFB;&#x7EDF;&#xFF0C;&#x82F1;&#x8BED;&#x4F5C;&#x6587;&#x5B9E;&#x65F6;&#x63D0;&#x4EA4;&#xFF0C;&#x7ACB;&#x5373;&#x53CD;&#x9988;&#xFF0C;&#x5E76;&#x80FD;&#x63D0;&#x4F9B;&#x6539;&#x8FDB;&#x5EFA;&#x8BAE;&#x3002;&#x6211;&#x89C9;&#x5F97;&#x8FD9;&#x4EEC;&#x6280;&#x672F;&#x80FD;&#x591F;&#x63D0;&#x9AD8;&#x5B66;&#x751F;&#x7684;&#x82F1;&#x6587;&#x4F5C;&#x6587;&#x80FD;&#x529B;&#xFF0C;&#x63D0;&#x9AD8;&#x8001;&#x5E08;&#x7684;&#x6559;&#x5B66;&#x6548;&#x7387;&#xFF0C;&#x56E0;&#x6750;&#x65BD;&#x6559;&#xFF0C;&#x5E76;&#x4E14;&#x80FD;&#x591F;&#x4FC3;&#x8FDB;&#x6559;&#x80B2;&#x516C;&#x5E73;&#x3002;&#x8FD9;&#x5957;&#x7CFB;&#x7EDF;&#x4E0A;&#x7EBF;&#x540E;&#x53D6;&#x5F97;&#x4E86;&#x5F88;&#x4E0D;&#x9519;&#x7684;&#x6210;&#x7EE9;&#x3002;&#x6211;&#x76F8;&#x4FE1;&#x6280;&#x672F;&#x4E0E;&#x6559;&#x80B2;&#x7684;&#x7ED3;&#x5408;&#xFF0C;&#x80FD;&#x591F;&#x6539;&#x53D8;&#x4E2D;&#x56FD;&#x7684;&#x6559;&#x80B2;&#x6A21;&#x5F0F;&#xFF0C;&#x8BA9;&#x6BCF;&#x4E2A;&#x4EBA;&#x65E0;&#x8BBA;&#x8D2B;&#x5BCC;&#x90FD;&#x80FD;&#x66F4;&#x52A0;&#x516C;&#x5E73;&#x7684;&#x83B7;&#x53D6;&#x77E5;&#x8BC6;&#xFF0C;&#x63A5;&#x53D7;&#x826F;&#x597D;&#x7684;&#x6559;&#x80B2;&#x3002;</p>
<p>&#x8BA1;&#x7B97;&#x673A;&#x4F20;&#x64AD;&#x5B66;&#x8BBA;&#x575B;&#x4E2D;&#xFF0C;&#x6211;&#x7684;&#x8001;&#x5E08;&#x8BB2;&#x4E86;&#x7F51;&#x7EDC;&#x4FE1;&#x606F;&#x4E0E;&#x60C5;&#x7EEA;&#x4F20;&#x64AD;&#x7814;&#x7A76;&#xFF0C;&#x5185;&#x5BB9;&#x6709;&#x4E24;&#x70B9;&#xFF1A;1&#x3001;&#x666E;&#x901A;&#x6C11;&#x4F17;&#x7684;&#x53C2;&#x4E0E;&#x5BF9;&#x793E;&#x4EA4;&#x5A92;&#x4F53;&#x6D41;&#x884C;&#x8D8B;&#x52BF;&#x7684;&#x5F62;&#x6210;&#x6709;&#x51B3;&#x5B9A;&#x6027;&#x7684;&#x4F5C;&#x7528;&#xFF1B;2&#x3001;&#x6124;&#x6012;&#x662F;&#x7F51;&#x7EDC;&#x4E0A;&#x6700;&#x5BB9;&#x6613;&#x4F20;&#x64AD;&#x7684;&#x60C5;&#x7EEA;&#xFF0C;&#x7136;&#x540E;&#x5206;&#x6790;&#x6124;&#x6012;&#x60C5;&#x7EEA;&#x7684;&#x4F20;&#x64AD;&#x673A;&#x7406;&#x5E76;&#x4ECE;&#x5386;&#x53F2;&#x548C;&#x793E;&#x4F1A;&#x7684;&#x89C6;&#x89D2;&#x6765;&#x770B;&#x7FA4;&#x4F53;&#x60C5;&#x7EEA;&#x7684;&#x5F62;&#x6210;&#x53CA;&#x5176;&#x5F71;&#x54CD;&#x3002;&#x53E4;&#x4EBA;&#x7684;&#x4E00;&#x53E5;&#x7ECF;&#x9A8C;&#x201C;&#x597D;&#x4E8B;&#x4E0D;&#x51FA;&#x95E8;&#xFF0C;&#x574F;&#x4E8B;&#x4F20;&#x5343;&#x91CC;&#x201D;&#x5728;&#x73B0;&#x4EE3;&#xFF0C;&#x6211;&#x4EEC;&#x80FD;&#x591F;&#x5229;&#x7528;&#x5927;&#x6570;&#x636E;&#x6280;&#x672F;&#x53BB;&#x8BC1;&#x5B9E;&#x3002;&#x5927;&#x6570;&#x636E;&#x6280;&#x672F;&#x5728;&#x793E;&#x4F1A;&#x4F20;&#x64AD;&#x5B66;&#x7684;&#x7814;&#x7A76;&#x8005;&#x8D8A;&#x6765;&#x8D8A;&#x5360;&#x636E;&#x91CD;&#x8981;&#x7684;&#x5730;&#x4F4D;&#x3002;&#x524D;&#x9762;&#x90FD;&#x662F;&#x504F;&#x5411;&#x57FA;&#x4E8E;&#x6570;&#x636E;&#x7684;&#x7406;&#x8BBA;&#x7814;&#x7A76;&#xFF0C;&#x540E;&#x9762;&#x7EC8;&#x4E8E;&#x6765;&#x4E86;&#x4E2A;&#x63A5;&#x5730;&#x6C14;&#x7684;&#xFF0C;&#x8BB2;&#x5927;&#x89C4;&#x6A21;&#x7684;&#x793E;&#x4F1A;&#x5A92;&#x4F53;&#x6570;&#x636E;&#x722C;&#x53D6;&#xFF0C;&#x5206;&#x4EAB;&#x5438;&#x5F15;&#x4E86;&#x5F88;&#x591A;&#x4EBA;&#x53C2;&#x4E0E;&#xFF0C;&#x6BD5;&#x7ADF;&#x6CA1;&#x6709;&#x6570;&#x636E;&#xFF0C;&#x79D1;&#x7814;&#x4EBA;&#x5458;&#x90FD;&#x6CA1;&#x6CD5;&#x641E;&#x7814;&#x7A76;&#x3002;</p>
<p>&#x60C5;&#x611F;&#x5206;&#x6790;&#x8BBA;&#x575B;&#x76F8;&#x5BF9;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x610F;&#x601D;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x90FD;&#x662F;&#x5728;&#x8BB2;&#x7406;&#x8BBA;&#xFF0C;&#x6BD4;&#x8F83;&#x67AF;&#x71E5;&#x3002;&#x6211;&#x4E5F;&#x6CA1;&#x600E;&#x4E48;&#x542C;&#x61C2;&#xFF0C;&#x5C31;&#x4E0D;&#x63D0;&#x4E86;&#x3002;</p>
<h2 id="&#x5176;&#x5B83;&#x89C1;&#x95FB;"><a href="#&#x5176;&#x5B83;&#x89C1;&#x95FB;" class="headerlink" title="&#x5176;&#x5B83;&#x89C1;&#x95FB;"></a>&#x5176;&#x5B83;&#x89C1;&#x95FB;</h2><p>&#x8FD9;&#x91CC;&#x4E3B;&#x8981;&#x662F;&#x5728;&#x5176;&#x5B83;&#x5206;&#x4EAB;&#x4E2D;&#x603B;&#x7ED3;&#x7684;&#x4E00;&#x4E9B;&#x70B9;<br>1&#x3001;&#x8BA1;&#x7B97;&#x793E;&#x4F1A;&#x79D1;&#x5B66;&#xFF0C;&#x7528;&#x5927;&#x6570;&#x636E;&#x5206;&#x6790;&#x6765;&#x63CF;&#x8FF0;&#x793E;&#x4F1A;&#x73B0;&#x8C61;&#xFF0C;&#x7528;&#x5C0F;&#x6570;&#x636E;&#x6765;&#x5206;&#x6790;&#x56E0;&#x679C;&#x5173;&#x7CFB;<br>2&#x3001;&#x4ECE;&#x6570;&#x636E;&#x53EF;&#x89C6;&#x5316;&#x4E2D;&#x5BFB;&#x627E;&#x9884;&#x5148;&#x4E0D;&#x77E5;&#x7684;&#x4EF7;&#x503C;&#x548C;&#x7ED3;&#x8BBA;<br>3&#x3001;&#x5728;&#x7ECF;&#x6D4E;&#x5B66;&#x4E2D;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;&#x706F;&#x5149;&#x6570;&#x636E;&#x6D4B;&#x91CF;&#x56FD;&#x5BB6;&#x7684;GDP&#xFF0C;&#x5206;&#x6790;GDP&#x9020;&#x5047;&#x7B49;&#x60C5;&#x51B5;<br>4&#x3001;&#x5B66;&#x79D1;&#x4EA4;&#x53C9;&#x662F;&#x79D1;&#x7814;&#x7684;&#x5927;&#x8D8B;&#x52BF;&#xFF0C;&#x8981;&#x6293;&#x4F4F;&#x65F6;&#x4EE3;&#x7684;&#x673A;&#x9047;&#xFF0C;&#x7528;&#x6280;&#x672F;&#x63D0;&#x9AD8;&#x751F;&#x4EA7;&#x529B;<br>5&#x3001;&#x5E7D;&#x9ED8;&#x4E5F;&#x53EF;&#x4EE5;&#x7528;&#x8BA1;&#x7B97;&#x65B9;&#x5F0F;&#x8FDB;&#x884C;&#x6D4B;&#x91CF;&#xFF0C;&#x5E76;&#x4E14;&#x80FD;&#x591F;&#x8FD0;&#x7528;&#x4E8E;&#x751F;&#x6210;&#x6BB5;&#x5B50;&#x548C;&#x5E7F;&#x544A;<br>6&#x3001;&#x901A;&#x8FC7;&#x624B;&#x673A;&#x7684;&#x4F7F;&#x7528;&#x884C;&#x4E3A;&#x53EF;&#x4EE5;&#x533A;&#x5206;&#x7A77;&#x4EBA;&#x548C;&#x5BCC;&#x4EBA;&#x7684;&#x4F7F;&#x7528;&#x504F;&#x5411;<br>7&#x3001;&#x4EBA;&#x771F;&#x662F;&#x8D8A;&#x8001;&#x8D8A;&#x6562;&#x5C06;&#x771F;&#x8BDD;&#xFF0C;&#x8BB2;&#x8D1F;&#x8D23;&#x7684;&#x8BDD;&#xFF0C;&#x8D8A;&#x5177;&#x6709;&#x70B9;&#x7406;&#x60F3;&#x4E3B;&#x4E49;&#x3002;<br>&#x5F53;&#x7136;&#x8FD8;&#x6709;&#x5F88;&#x591A;&#x5176;&#x5B83;&#x7684;&#x89C1;&#x95FB;&#xFF0C;&#x65B0;&#x5947;&#x7684;&#x4E8B;&#xFF0C;&#x6211;&#x8FD9;&#x5C31;&#x53EA;&#x5217;&#x4E3E;&#x8FD9;&#x51E0;&#x70B9;&#x3002;</p>
<p>&#x603B;&#x7684;&#x6765;&#x8BF4;&#xFF0C;SMP&#x5927;&#x4F1A;&#x4E3E;&#x529E;&#x7684;&#x5F88;&#x597D;&#xFF0C;&#x8BF7;&#x6765;&#x7684;&#x5B66;&#x8005;&#x90FD;&#x662F;&#x9886;&#x57DF;&#x5185;&#x6216;&#x8005;&#x884C;&#x4E1A;&#x5185;&#x7684;&#x7FD8;&#x695A;&#xFF0C;&#x5E26;&#x6765;&#x7684;&#x5206;&#x4EAB;&#x90FD;&#x662F;&#x5404;&#x81EA;&#x6700;&#x65B0;&#x7684;&#x7814;&#x7A76;&#x6210;&#x679C;&#xFF0C;&#x8BA9;&#x4EBA;&#x6536;&#x83B7;&#x6EE1;&#x6EE1;&#x3002;&#x53E6;&#x5916;&#x54C8;&#x5C14;&#x6EE8;&#x53CB;&#x8C0A;&#x5BAB;&#x7684;&#x81EA;&#x52A9;&#x9910;&#x4E0D;&#x9519;&#xFF0C;&#x54C8;&#x5C14;&#x6EE8;&#x7684;&#x5929;&#x6C14;&#x4E5F;&#x662F;&#x6781;&#x5176;&#x8212;&#x9002;&#x3002;</p>

      
    </div>

    

    
    
    

    

    

    

    <footer class="post-footer">
      

      
      
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2018/07/11/踏入社会这一年——焦虑相伴/" rel="next" title="踏入社会这一年——焦虑相伴">
                <i class="fa fa-chevron-left"></i> 踏入社会这一年——焦虑相伴
              </a>
            
          </div>

          <span class="post-nav-divider"></span>

          <div class="post-nav-prev post-nav-item">
            
          </div>
        </div>
      

      
      
    </footer>
  </div>
  
  
  
  </article>



    <div class="post-spread">
      
    </div>
  </div>


          </div>
          

  



        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap">
            Table of Contents
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview-wrap">
            Overview
          </li>
        </ul>
      

      <section class="site-overview-wrap sidebar-panel">
        <div class="site-overview">
          <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
            
              <p class="site-author-name" itemprop="name">Kavim</p>
              <p class="site-description motion-element" itemprop="description">生活不止眼前的苟且 还有诗和远方的田野</p>
          </div>

          
            <nav class="site-state motion-element">
              
                <div class="site-state-item site-state-posts">
                
                  <a href="/archives/">
                
                    <span class="site-state-item-count">46</span>
                    <span class="site-state-item-name">posts</span>
                  </a>
                </div>
              

              
                
                
                <div class="site-state-item site-state-categories">
                  <a href="/categories/index.html">
                    
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                    <span class="site-state-item-count">20</span>
                    <span class="site-state-item-name">categories</span>
                  </a>
                </div>
              

              
                
                
                <div class="site-state-item site-state-tags">
                  <a href="/tags/index.html">
                    
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                    <span class="site-state-item-count">18</span>
                    <span class="site-state-item-name">tags</span>
                  </a>
                </div>
              
            </nav>
          

          

          

          
          

          
          

          
            
          
          

        </div>
      </section>

      
      <!--noindex-->
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">

            
              
            

            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-2"><a class="nav-link" href="#会议简介"><span class="nav-number">1.</span> <span class="nav-text">会议简介</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#特邀报告和论坛"><span class="nav-number">2.</span> <span class="nav-text">特邀报告和论坛</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#其它见闻"><span class="nav-number">3.</span> <span class="nav-text">其它见闻</span></a></li></ol></div>
            

          </div>
        </section>
      <!--/noindex-->
      

      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright">&copy; <span itemprop="copyrightYear">2018</span>
  <span class="with-love" id="animate"> 
    <i class="fa fa-user"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">Kavim</span>

  

  
</div>




  <div class="powered-by">Powered by <a class="theme-link" target="_blank" href="https://hexo.io">Hexo</a></div>



  <span class="post-meta-divider">|</span>



  <div class="theme-info">Theme &mdash; <a class="theme-link" target="_blank" href="https://github.com/theme-next/hexo-theme-next">NexT.Gemini</a> v6.1.0</div>




        








        
      </div>
    </footer>

    
      <div class="back-to-top">
        <i class="fa fa-arrow-up"></i>
        
      </div>
    

    

  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>


























  
  
    <script type="text/javascript" src="/lib/jquery/index.js?v=2.1.3"></script>
  

  
  
    <script type="text/javascript" src="/lib/velocity/velocity.min.js?v=1.2.1"></script>
  

  
  
    <script type="text/javascript" src="/lib/velocity/velocity.ui.min.js?v=1.2.1"></script>
  


  


  <script type="text/javascript" src="/js/src/utils.js?v=6.1.0"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=6.1.0"></script>



  
  


  <script type="text/javascript" src="/js/src/affix.js?v=6.1.0"></script>

  <script type="text/javascript" src="/js/src/schemes/pisces.js?v=6.1.0"></script>



  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=6.1.0"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=6.1.0"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=6.1.0"></script>



  



	





  





  










  





  

  

  

  

  
  

  

  

  

  

</body>
</html>
