<!DOCTYPE html>












  


<html class="theme-next pisces use-motion" lang="zh-CN">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge"/>
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=2"/>
<meta name="theme-color" content="#222"/>
























<link rel="stylesheet" href="/lib/font-awesome/css/font-awesome.min.css?v=4.6.2"/>

<link rel="stylesheet" href="/css/main.css?v=7.1.0"/>


  <link rel="apple-touch-icon" sizes="180x180" href="/images/apple-touch-icon-next.png?v=7.1.0">


  <link rel="icon" type="image/png" sizes="32x32" href="/images/favicon-32x32-next.png?v=7.1.0">


  <link rel="icon" type="image/png" sizes="16x16" href="/images/favicon-16x16-next.png?v=7.1.0">


  <link rel="mask-icon" href="/images/logo.svg?v=7.1.0" color="#222">







<script id="hexo.configurations">
  var NexT = window.NexT || {};
  var CONFIG = {
    root: '/',
    scheme: 'Pisces',
    version: '7.1.0',
    sidebar: {"position":"left","display":"post","offset":12,"onmobile":false,"dimmer":false},
    back2top: true,
    back2top_sidebar: false,
    fancybox: false,
    fastclick: false,
    lazyload: false,
    tabs: true,
    motion: {"enable":true,"async":false,"transition":{"post_block":"fadeIn","post_header":"slideDownIn","post_body":"slideDownIn","coll_header":"slideLeftIn","sidebar":"slideUpIn"}},
    algolia: {
      applicationID: '',
      apiKey: '',
      indexName: '',
      hits: {"per_page":10},
      labels: {"input_placeholder":"Search for Posts","hits_empty":"We didn't find any results for the search: ${query}","hits_stats":"${hits} results found in ${time} ms"}
    }
  };
</script>


  




  <meta name="description" content="&amp;#x6BD5;&amp;#x4E1A;&amp;#x4E00;&amp;#x5E74;&amp;#xFF0C;&amp;#x4E5F;&amp;#x662F;&amp;#x5DE5;&amp;#x4F5C;&amp;#x4E00;&amp;#x5E74;&amp;#xFF0C;&amp;#x603B;&amp;#x662F;&amp;#x8FC7;&amp;#x7740;&amp;#x9636;&amp;#x6BB5;&amp;#x6027;&amp;#x7684;&amp;#x7126;&amp;#x8651;&amp;#x751F;&amp;#x6D3B;&amp;#xFF0C;">
<meta property="og:type" content="article">
<meta property="og:title" content="踏入社会这一年——焦虑相伴">
<meta property="og:url" content="https://xuxping.github.io/2018/07/11/踏入社会这一年——焦虑相伴/index.html">
<meta property="og:site_name" content="Kavim">
<meta property="og:description" content="&amp;#x6BD5;&amp;#x4E1A;&amp;#x4E00;&amp;#x5E74;&amp;#xFF0C;&amp;#x4E5F;&amp;#x662F;&amp;#x5DE5;&amp;#x4F5C;&amp;#x4E00;&amp;#x5E74;&amp;#xFF0C;&amp;#x603B;&amp;#x662F;&amp;#x8FC7;&amp;#x7740;&amp;#x9636;&amp;#x6BB5;&amp;#x6027;&amp;#x7684;&amp;#x7126;&amp;#x8651;&amp;#x751F;&amp;#x6D3B;&amp;#xFF0C;">
<meta property="og:updated_time" content="2018-07-16T08:47:22.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="踏入社会这一年——焦虑相伴">
<meta name="twitter:description" content="&amp;#x6BD5;&amp;#x4E1A;&amp;#x4E00;&amp;#x5E74;&amp;#xFF0C;&amp;#x4E5F;&amp;#x662F;&amp;#x5DE5;&amp;#x4F5C;&amp;#x4E00;&amp;#x5E74;&amp;#xFF0C;&amp;#x603B;&amp;#x662F;&amp;#x8FC7;&amp;#x7740;&amp;#x9636;&amp;#x6BB5;&amp;#x6027;&amp;#x7684;&amp;#x7126;&amp;#x8651;&amp;#x751F;&amp;#x6D3B;&amp;#xFF0C;">





  
  
  <link rel="canonical" href="https://xuxping.github.io/2018/07/11/踏入社会这一年——焦虑相伴/"/>



<script id="page.configurations">
  CONFIG.page = {
    sidebar: "",
  };
</script>

  <title>踏入社会这一年——焦虑相伴 | Kavim</title>
  












  <noscript>
  <style>
  .use-motion .motion-element,
  .use-motion .brand,
  .use-motion .menu-item,
  .sidebar-inner,
  .use-motion .post-block,
  .use-motion .pagination,
  .use-motion .comments,
  .use-motion .post-header,
  .use-motion .post-body,
  .use-motion .collection-title { opacity: initial; }

  .use-motion .logo,
  .use-motion .site-title,
  .use-motion .site-subtitle {
    opacity: initial;
    top: initial;
  }

  .use-motion .logo-line-before i { left: initial; }
  .use-motion .logo-line-after i { right: initial; }
  </style>
</noscript>

</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-CN">

  
  
    
  

  <div class="container sidebar-position-left page-post-detail">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-brand-wrapper">
  <div class="site-meta">
    

    <div class="custom-logo-site-title">
      <a href="/" class="brand" rel="start">
        <span class="logo-line-before"><i></i></span>
        <span class="site-title">Kavim</span>
        <span class="logo-line-after"><i></i></span>
      </a>
    </div>
    
      
        <p class="site-subtitle">一点一滴积累</p>
      
    
    
  </div>

  <div class="site-nav-toggle">
    <button aria-label="切换导航栏">
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
    </button>
  </div>
</div>



<nav class="site-nav">
  
    <ul id="menu" class="menu">
      
        
        
        
          
          <li class="menu-item menu-item-home">

    
    
    
      
    

    

    <a href="/" rel="section"><i class="menu-item-icon fa fa-fw fa-home"></i> <br/>首页</a>

  </li>
        
        
        
          
          <li class="menu-item menu-item-archives">

    
    
    
      
    

    

    <a href="/archives/" rel="section"><i class="menu-item-icon fa fa-fw fa-archive"></i> <br/>归档</a>

  </li>

      
      
    </ul>
  

  

  
</nav>



  



</div>
    </header>

    


    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          
            

          
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  

  
  
  

  

  <article class="post post-type-normal" itemscope itemtype="http://schema.org/Article">
  
  
  
  <div class="post-block">
    <link itemprop="mainEntityOfPage" href="https://xuxping.github.io/2018/07/11/踏入社会这一年——焦虑相伴/"/>

    <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
      <meta itemprop="name" content="Kavim"/>
      <meta itemprop="description" content="生活不止眼前的苟且 还有诗和远方的田野"/>
      <meta itemprop="image" content="/images/avatar.gif"/>
    </span>

    <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
      <meta itemprop="name" content="Kavim"/>
    </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">踏入社会这一年——焦虑相伴

              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">

            
            
            

            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              
                <span class="post-meta-item-text">发表于</span>
              

              
                
              

              <time title="创建时间：2018-07-11 22:33:20" itemprop="dateCreated datePublished" datetime="2018-07-11T22:33:20+08:00">2018-07-11</time>
            

            
              

              
                
                <span class="post-meta-divider">|</span>
                

                <span class="post-meta-item-icon">
                  <i class="fa fa-calendar-check-o"></i>
                </span>
                
                  <span class="post-meta-item-text">更新于</span>
                
                <time title="修改时间：2018-07-16 16:47:22" itemprop="dateModified" datetime="2018-07-16T16:47:22+08:00">2018-07-16</time>
              
            
          </span>

          
            <span class="post-category">
            
              <span class="post-meta-divider">|</span>
            
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              
                <span class="post-meta-item-text">分类于</span>
              
              
                <span itemprop="about" itemscope itemtype="http://schema.org/Thing"><a href="/categories/个人笔记/" itemprop="url" rel="index"><span itemprop="name">个人笔记</span></a></span>

                
                
              
            </span>
          

          
            
            
          

          
          

          

          

          

        </div>
      </header>
    

    
    
    
    <div class="post-body" itemprop="articleBody">

      
      

      
        <p>&#x6BD5;&#x4E1A;&#x4E00;&#x5E74;&#xFF0C;&#x4E5F;&#x662F;&#x5DE5;&#x4F5C;&#x4E00;&#x5E74;&#xFF0C;&#x603B;&#x662F;&#x8FC7;&#x7740;&#x9636;&#x6BB5;&#x6027;&#x7684;&#x7126;&#x8651;&#x751F;&#x6D3B;&#xFF0C;&#x4E00;&#x6765;&#x662F;&#x60F3;&#x4E0D;&#x6E05;&#x540E;&#x9762;&#x7684;&#x8DEF;&#x600E;&#x4E48;&#x8D70;&#xFF0C;&#x76EE;&#x6807;&#x5728;&#x54EA;&#xFF0C;&#x672A;&#x6765;&#x8981;&#x6210;&#x4E3A;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x4EBA;&#x3002;&#x4E8C;&#x662F;&#x5DE5;&#x4F5C;&#x4EFB;&#x52A1;&#x7684;&#x9636;&#x6BB5;&#x6027;&#xFF0C;&#x6447;&#x6446;&#x6027;&#x5BFC;&#x81F4;&#x59CB;&#x7EC8;&#x4E0D;&#x80FD;&#x4E13;&#x6CE8;&#x4E8E;&#x67D0;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x5BFC;&#x81F4;&#x4E2A;&#x4EBA;&#x6280;&#x672F;&#x5B9A;&#x4F4D;&#x65B9;&#x9762;&#x7684;&#x7126;&#x8651;&#x3002;&#x4E09;&#x662F;&#x5BF9;&#x4E2A;&#x4EBA;&#x73B0;&#x72B6;&#x7684;&#x7126;&#x8651;&#xFF0C;&#x6CA1;&#x94B1;&#xFF0C;&#x6CA1;&#x8D44;&#x6E90;&#xFF0C;&#x6CA1;&#x4EBA;&#x8109;&#x3002;&#x56DB;&#x662F;&#x4E24;&#x4E2A;&#x90FD;&#x5F88;&#x5014;&#x7684;&#x4EBA;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x611F;&#x60C5;&#x751F;&#x6D3B;&#x65F6;&#x597D;&#x65F6;&#x4E0D;&#x597D;&#xFF0C;&#x8C01;&#x90FD;&#x4E0D;&#x80AF;&#x8BA9;&#x6B65;&#x3002;<br><a id="more"></a></p>
<p>&#x6211;&#x53BB;&#x767B;&#x8FC7;&#x6CF0;&#x5C71;&#xFF0C;&#x60F3;&#x4ECE;&#x767B;&#x5C71;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x5B66;&#x5230;&#x4E9B;&#x4EC0;&#x4E48;&#xFF0C;&#x81F3;&#x5C11;&#x80FD;&#x591F;&#x5B66;&#x5230;&#x76EE;&#x6807;&#x660E;&#x786E;&#xFF08;&#x5C71;&#x9876;&#xFF09;&#xFF0C;&#x5916;&#x5728;&#x5E72;&#x6270;&#x5C11;&#xFF08;&#x665A;&#x4E0A;&#x767B;&#x5C71;&#xFF0C;&#x65E0;&#x5FC3;&#x987E;&#x53CA;&#x98CE;&#x666F;&#xFF0C;&#x5FC3;&#x4E2D;&#x53EA;&#x6709;&#x76EE;&#x6807;&#xFF09;&#xFF0C;&#x78E8;&#x70BC;&#x610F;&#x5FD7;&#x529B;&#xFF08;&#x5728;&#x4F53;&#x529B;&#x8981;&#x8017;&#x5C3D;&#x65F6;&#x7528;&#x610F;&#x5FD7;&#x529B;&#x652F;&#x6491;&#x81EA;&#x5DF1;&#x7EE7;&#x7EED;&#xFF09;&#x3002;&#x53EF;&#x5B9E;&#x9645;&#x4E0A;&#x6211;&#x80FD;&#x767B;&#x4E0A;&#x5C71;&#x9876;&#xFF0C;&#x5374;&#x5728;&#x751F;&#x6D3B;&#x4E2D;&#x8FF7;&#x5931;&#x4E86;&#x76EE;&#x6807;&#x3002;&#x4E0D;&#x77E5;&#x9053;&#x81EA;&#x5DF1;&#x9700;&#x8981;&#x5236;&#x5B9A;&#x4E00;&#x4E2A;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x957F;&#x8FDC;&#x76EE;&#x6807;&#xFF0C;&#x5373;&#x4F7F;&#x80FD;&#x591F;&#x786E;&#x5B9A;&#x4E00;&#x4E2A;&#x5927;&#x81F4;&#x7684;&#x65B9;&#x5411;&#xFF0C;&#x4F46;&#x662F;&#x5468;&#x56F4;&#x7684;&#x5E72;&#x6270;&#x4F55;&#x5176;&#x7684;&#x591A;&#xFF0C;&#x81EA;&#x5DF1;&#x80FD;&#x591F;&#x575A;&#x6301;&#x4E0B;&#x6765;&#x5417;&#x3002;&#x6211;&#x653E;&#x5F03;&#x4E86;&#x5236;&#x5B9A;&#x957F;&#x8FDC;&#x76EE;&#x6807;&#x7684;&#x6253;&#x7B97;&#xFF0C;&#x9009;&#x62E9;&#x4E86;&#x4ECE;&#x77ED;&#x671F;&#x76EE;&#x6807;&#x51FA;&#x53D1;&#xFF0C;&#x5C31;&#x50CF;&#x4E0D;&#x77E5;&#x9053;&#x5C71;&#x9876;&#x5728;&#x54EA;&#xFF0C;&#x6709;&#x591A;&#x9AD8;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x5148;&#x5230;&#x8FBE;&#x4E00;&#x4E2A;&#x5C0F;&#x76EE;&#x6807;&#x4F4D;&#x7F6E;&#x5427;&#xFF0C;&#x540E;&#x7EED;&#x518D;&#x505A;&#x6253;&#x7B97;&#x628A;&#x3002;</p>
<p>&#x4E0B;&#x5C71;&#x540E;&#xFF0C;&#x6211;&#x51B3;&#x5B9A;&#x8003;&#x7814;&#x4E86;&#xFF0C;&#x7531;&#x4E8E;&#x516C;&#x53F8;&#x7684;&#x539F;&#x56E0;&#xFF0C;&#x6211;&#x9009;&#x62E9;&#x4E86;&#x5317;&#x822A;&#x7684;&#x8F6F;&#x4EF6;&#x5B66;&#x9662;&#x3002;&#x6B64;&#x65F6;&#x5DF2;&#x7ECF;&#x662F;9&#x6708;&#x4E86;&#xFF0C;&#x79BB;&#x8003;&#x8BD5;&#x8FD8;&#x6709;3&#x4E2A;&#x6708;&#x591A;&#x70B9;&#xFF0C;&#x8003;&#x7814;&#x515A;&#x90FD;&#x5F00;&#x59CB;&#x51B2;&#x523A;&#x9636;&#x6BB5;&#xFF0C;&#x6211;&#x9009;&#x62E9;&#x5F00;&#x59CB;&#x590D;&#x4E60;&#x3002;&#x5728;&#x5F00;&#x59CB;&#x4E4B;&#x524D;&#x6211;&#x82B1;&#x4E86;&#x51E0;&#x5929;&#x8003;&#x4E86;&#x4E00;&#x4E2A;&#x57FA;&#x91D1;&#x4ECE;&#x4E1A;&#x8D44;&#x683C;&#x8BC1;&#xFF0C;&#x6B63;&#x5F0F;&#x5F00;&#x59CB;&#x590D;&#x4E60;&#x5DF2;&#x7ECF;&#x662F;9&#x6708;16&#x53F7;&#x4E86;&#x5427;&#x3002;&#x6211;&#x8DDF;&#x6211;&#x5927;&#x5B66;&#x5BA4;&#x53CB;&#x5728;&#x64CD;&#x573A;&#x8D70;&#x7740;&#xFF0C;&#x76D8;&#x7B97;&#x7740;&#x600E;&#x4E48;&#x590D;&#x4E60;&#xFF0C;&#x6BCF;&#x4E2A;&#x79D1;&#x76EE;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x590D;&#x4E60;&#xFF0C;&#x8981;&#x82B1;&#x591A;&#x5C11;&#x65F6;&#x95F4;&#xFF0C;&#x76EE;&#x6807;&#x5206;&#x6570;&#x5927;&#x6982;&#x662F;&#x591A;&#x5C11;&#x3002;&#x6709;&#x4E9B;&#x4E8B;&#x60C5;&#x771F;&#x662F;&#x5F00;&#x59CB;&#x76D8;&#x7B97;&#x7740;&#x597D;&#x597D;&#x7684;&#xFF0C;&#x5B9E;&#x9645;&#x53BB;&#x505A;&#x5374;&#x4E0D;&#x662F;&#x90A3;&#x4E48;&#x56DE;&#x4E8B;&#xFF0C;&#x9884;&#x8BA1;&#x7684;&#x8BDD;&#x5927;&#x7EA6;500&#x4E2A;&#x5C0F;&#x65F6;&#x590D;&#x4E60;&#xFF0C;&#x6700;&#x7EC8;&#x53EA;&#x82B1;&#x4E86;&#x4E0D;&#x5230;250&#x4E2A;&#x5C0F;&#x65F6;&#xFF0C;&#x5F00;&#x59CB;&#x51C6;&#x5907;&#x8003;&#x7684;&#x6570;&#x5B66;&#x4E00;&#xFF0C;&#x90FD;&#x590D;&#x4E60;&#x5B8C;&#x4E86;&#xFF0C;&#x6700;&#x7EC8;&#x59A5;&#x534F;&#x6362;&#x4E86;&#x5B66;&#x9662;&#x8003;&#x6570;&#x5B66;&#x4E8C;&#x3002;&#x767D;&#x5929;&#x8981;&#x5DE5;&#x4F5C;&#xFF0C;&#x665A;&#x4E0A;&#x548C;&#x65E9;&#x4E0A;&#x8981;&#x590D;&#x4E60;&#xFF0C;&#x56DE;&#x5230;&#x5BB6;&#x90FD;&#x7D2F;&#x4E86;&#xFF0C;&#x773C;&#x955C;&#x7279;&#x522B;&#x7D2F;&#xFF0C;&#x7761;&#x4E00;&#x5C0F;&#x4F1A;&#xFF0C;&#x8D77;&#x6765;&#x63A5;&#x7740;&#x5E72;&#x3002;&#x73B0;&#x5728;&#x8FD1;&#x89C6;&#x52A0;&#x91CD;&#x5C31;&#x662F;&#x90A3;&#x65F6;&#x5019;&#x9020;&#x6210;&#x7684;&#x3002;</p>
<p>&#x603B;&#x5171;&#x5927;&#x6982;3&#x4E2A;&#x6708;&#xFF0C;&#x4E2D;&#x95F4;&#x4E00;&#x5EA6;&#x60F3;&#x653E;&#x5F03;&#xFF0C;&#x8003;&#x5B8C;&#x540E;&#xFF0C;&#x5FD0;&#x5FD1;&#x7684;&#x8FC7;&#x4E86;&#x4E24;&#x4E2A;&#x591A;&#x6708;&#xFF0C;&#x6700;&#x7EC8;&#x62FF;&#x5230;&#x4E86;&#x5317;&#x822A;&#x7684;&#x5F55;&#x53D6;&#x901A;&#x77E5;&#x4E66;&#x3002;&#x590D;&#x4E60;&#x5230;&#x8003;&#x8BD5;&#x7684;&#x4E09;&#x4E2A;&#x6708;&#x4E86;&#x6211;&#x8FC7;&#x7684;&#x5F88;&#x5145;&#x5B9E;&#xFF0C;&#x6CA1;&#x5047;&#x671F;&#xFF0C;&#x6CA1;&#x5468;&#x672B;&#xFF0C;&#x6BCF;&#x5929;&#x90FD;&#x6709;&#x4E8B;&#x5E72;&#xFF0C;&#x4EBA;&#x5C31;&#x4E0D;&#x4F1A;&#x7126;&#x8651;&#x3002;&#x4F46;&#x662F;&#x4E00;&#x65E6;&#x95F2;&#x4E0B;&#x6765;&#xFF0C;&#x7126;&#x8651;&#x53C8;&#x56DE;&#x6765;&#x4E86;&#xFF0C;&#x5982;&#x679C;&#x6CA1;&#x8003;&#x4E0A;&#x600E;&#x4E48;&#x529E;&#xFF1F;&#x5206;&#x6570;&#x51FA;&#x6765;&#x540E;&#xFF0C;&#x6211;&#x60CA;&#x559C;&#x4E86;&#x4E00;&#x4E0B;&#xFF0C;&#x4F46;&#x662F;&#x770B;&#x5230;&#x5386;&#x5C4A;&#x7684;&#x6570;&#x5B66;&#x5355;&#x79D1;&#x5206;&#x6570;&#x7EBF;&#xFF0C;&#x4E0A;&#x5929;&#x597D;&#x50CF;&#x7ED9;&#x6211;&#x5F00;&#x4E86;&#x4E00;&#x4E2A;&#x73A9;&#x7B11;&#xFF0C;&#x5C31;&#x50CF;&#x53CA;&#x683C;&#x7EBF;&#x662F;60&#xFF0C;&#x800C;&#x6211;&#x8003;&#x4E86;59&#x4E00;&#x6837;&#x3002;&#x6709;&#x53EF;&#x80FD;&#x4E00;&#x5206;&#x4E4B;&#x5DEE;&#x8BA9;&#x6211;&#x7684;&#x52AA;&#x529B;&#x5C31;&#x767D;&#x8D39;&#x4E86;&#xFF0C;&#x90A3;&#x4E00;&#x5929;&#xFF0C;&#x5B66;&#x6821;&#x516C;&#x5E03;&#x6210;&#x7EE9;&#x662F;&#x4E0B;&#x5348;&#xFF0C;&#x6211;&#x4E0A;&#x5348;&#x5C31;&#x901A;&#x77E5;&#x4E86;&#x8001;&#x7238;&#xFF0C;&#x8BF4;&#x6211;&#x6CA1;&#x620F;&#x4E86;&#xFF0C;&#x4E00;&#x5206;&#x4E4B;&#x5DEE;&#x3002;&#x4E0B;&#x5348;&#x5C31;&#x7ED9;&#x6211;&#x6765;&#x4E86;&#x4E2A;&#x60CA;&#x559C;&#x3002;&#x8FD9;&#x4F30;&#x8BA1;&#x662F;&#x6211;20&#x591A;&#x5E74;&#x7684;&#x8003;&#x8BD5;&#x751F;&#x6DAF;&#x4E2D;&#x7B2C;&#x4E00;&#x6B21;&#x611F;&#x53D7;&#x5230;&#x5DE8;&#x5927;&#x7684;&#x8F6C;&#x6298;&#x5427;&#xFF0C;&#x4ECE;&#x5730;&#x72F1;&#x5230;&#x5929;&#x5802;&#x3002;</p>
<p>&#x5728;&#x8FD9;&#x4E24;&#x4E2A;&#x591A;&#x6708;&#x91CC;&#xFF0C;&#x6211;&#x611F;&#x89C9;&#x5230;&#x81EA;&#x5DF1;&#x4ECA;&#x5E74;&#x57FA;&#x672C;&#x6CA1;&#x620F;&#x4E86;&#xFF0C;&#x5728;&#x516C;&#x53F8;&#x597D;&#x50CF;&#x6CA1;&#x6709;&#x591A;&#x5927;&#x7684;&#x53D1;&#x5C55;&#x524D;&#x9014;&#x4E86;&#xFF0C;&#x4EFB;&#x52A1;&#x7684;&#x9636;&#x6BB5;&#x6027;&#xFF0C;&#x4E0D;&#x8FDE;&#x7EED;&#x6027;&#xFF0C;&#x4F7F;&#x6211;&#x81EA;&#x5DF1;&#x4E0D;&#x65AD;&#x7684;&#x53BB;&#x5426;&#x5B9A;&#x6211;&#x4E4B;&#x524D;&#x5B9A;&#x7684;&#x4E00;&#x4E9B;&#x81EA;&#x5DF1;&#x8981;&#x8D70;&#x7684;&#x6280;&#x672F;&#x8DEF;&#x7EBF;&#x3002;&#x8FD9;&#x4E9B;&#x4F7F;&#x6211;&#x4EA7;&#x751F;&#x4E86;&#x5BF9;&#x672A;&#x6765;&#x4E2A;&#x4EBA;&#x6280;&#x672F;&#x53D1;&#x5C55;&#x65B9;&#x9762;&#x7684;&#x7126;&#x8651;&#xFF0C;&#x6211;&#x51B3;&#x5B9A;3&#x6708;&#x6216;&#x8005;4&#x6708;&#x79BB;&#x804C;&#x4E86;&#x3002;&#x4E8E;&#x662F;&#x6211;&#x4ECE;1&#x6708;&#x4E0B;&#x65EC;&#x5F00;&#x59CB;&#x5C31;&#x5728;&#x51C6;&#x5907;&#x68B3;&#x7406;&#x4E00;&#x4E0B;&#x81EA;&#x5DF1;&#x4E4B;&#x524D;&#x505A;&#x8FC7;&#x7684;&#x9879;&#x76EE;&#xFF0C;&#x7528;&#x5230;&#x7684;&#x6280;&#x672F;&#xFF0C;&#x7A81;&#x51FB;&#x4E00;&#x4E0B;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x65B9;&#x9762;&#x7684;&#x77E5;&#x8BC6;&#xFF0C;&#x5E76;&#x4E14;&#x66F4;&#x65B0;&#x4E86;&#x81EA;&#x5DF1;&#x7684;&#x7B80;&#x5386;&#x3002;&#x60F3;&#x60F3;&#x81EA;&#x5DF1;&#x4E5F;&#x6CA1;&#x6709;&#x53C2;&#x52A0;&#x8FC7;&#x6821;&#x62DB;&#xFF0C;&#x66F4;&#x6CA1;&#x5565;&#x9762;&#x8BD5;&#x7ECF;&#x9A8C;&#xFF0C;&#x51FA;&#x53BB;&#x9762;&#x4E00;&#x9762;&#x4E5F;&#x662F;&#x597D;&#x4E8B;&#x3002;&#x6211;&#x53BB;&#x4E86;&#x8DA3;&#x5E97;&#x96C6;&#x56E2;&#x9762;&#x8BD5;&#x4E86;&#x4E00;&#x6B21;&#xFF0C;&#x611F;&#x89C9;&#x4ED6;&#x4EEC;&#x4E00;&#x76F4;&#x6293;&#x7740;&#x6211;&#x7684;&#x5F31;&#x70B9;&#x5728;&#x6253;&#xFF0C;&#x4E13;&#x6311;&#x6211;&#x6D89;&#x53CA;&#x8FC7;&#x4E00;&#x4E9B;&#xFF0C;&#x4F46;&#x53C8;&#x4E0D;&#x64C5;&#x957F;&#x7684;&#x5185;&#x5BB9;&#x95EE;&#xFF0C;&#x6302;&#x4E86;&#x7684;&#x7ED3;&#x679C;&#x53EF;&#x60F3;&#x800C;&#x77E5;&#x3002;&#x56DE;&#x6765;&#x4ED4;&#x7EC6;&#x60F3;&#x60F3;&#xFF0C;&#x81EA;&#x5DF1;&#x786E;&#x5B9E;&#x6CA1;&#x6709;&#x5565;&#x4E13;&#x7684;&#x65B9;&#x9762;&#xFF0C;&#x90FD;&#x662F;&#x8FD9;&#x641E;&#x641E;&#xFF0C;&#x90A3;&#x641E;&#x641E;&#x3002;&#x6211;&#x4E5F;&#x4E0D;&#x60F3;&#x554A;&#xFF0C;&#x73B0;&#x5728;&#x516C;&#x53F8;&#x7684;&#x4E1A;&#x52A1;&#x9700;&#x6C42;&#x5C31;&#x662F;&#x8FD9;&#x6837;&#x554A;&#x3002;&#x867D;&#x7136;&#x73B0;&#x5728;&#x8FD8;&#x662F;&#x60F3;&#x79BB;&#x804C;&#xFF0C;&#x53BB;&#x4E13;&#x6CE8;&#x67D0;&#x4E00;&#x4E2A;&#x65B9;&#x5411;&#xFF0C;&#x4F46;&#x662F;&#x88AB;&#x516C;&#x53F8;&#x53CC;&#x91CD;&#x5957;&#x7262;&#x4E86;&#x3002;&#x3002;&#x53EA;&#x6709;&#x7B49;&#x5F85;&#x660E;&#x5E74;&#x4E86;&#xFF0C;&#x5728;&#x5DE5;&#x4F5C;&#x8FD9;&#x4EF6;&#x4E8B;&#x8FD8;&#x5F97;&#x518D;&#x7126;&#x8651;&#x4E2A;&#x4E00;&#x5E74;&#x3002;</p>
<p>&#x4E00;&#x4E2A;&#x666E;&#x901A;&#x4EBA;&#x5728;&#x521A;&#x8E0F;&#x5165;&#x793E;&#x4F1A;&#x771F;&#x7684;&#x662F;&#x4F53;&#x4F1A;&#x5230;&#x4E86;&#x6CA1;&#x94B1;&#xFF0C;&#x6CA1;&#x8D44;&#x6E90;&#xFF0C;&#x6CA1;&#x4EBA;&#x8109;&#x7684;&#x75DB;&#x82E6;&#x3002;&#x867D;&#x7136;&#x5DE5;&#x8D44;&#x4E00;&#x5E74;&#x4E5F;&#x6709;10&#x51E0;&#x4E07;&#xFF0C;&#x53EA;&#x80FD;&#x8BF4;&#x52C9;&#x5F3A;&#x591F;&#x7528;&#xFF0C;&#x5374;&#x6491;&#x4E0D;&#x8D77;&#x81EA;&#x5DF1;&#x7684;&#x4E00;&#x4E9B;&#x60F3;&#x5E72;&#x7684;&#x4E8B;&#xFF0C;&#x7ED9;&#x81EA;&#x5DF1;&#x6362;&#x8863;&#x670D;&#xFF0C;&#x6362;&#x978B;&#xFF0C;&#x60F3;&#x53BB;&#x65C5;&#x6E38;&#xFF0C;&#x60F3;&#x53BB;&#x5B66;&#x597D;&#x82F1;&#x8BED;&#xFF0C;&#x60F3;&#x53BB;&#x7EC3;&#x4E60;&#x6F14;&#x8BB2;&#xFF0C;&#x60F3;&#x53BB;&#x5065;&#x8EAB;&#xFF0C;&#x60F3;&#x4E70;&#x4E00;&#x53F0;mac&#x7535;&#x8111;&#xFF0C;&#x6362;&#x4E00;&#x4E2A;&#x624B;&#x673A;&#xFF0C;&#x60F3;&#x53BB;&#x6295;&#x8D44;&#x7B49;&#x7B49;&#x3002;&#x6BCF;&#x5929;&#x90FD;&#x5728;&#x52D2;&#x7D27;&#x88E4;&#x8170;&#x5E26;&#x8FC7;&#x65E5;&#x5B50;&#xFF0C;&#x8FD8;&#x56E0;&#x4E3A;&#x9AD8;&#x604B;&#x7231;&#x6D88;&#x8D39;&#x8DDF;&#x5973;&#x670B;&#x53CB;&#x751F;&#x8FC7;&#x51E0;&#x6B21;&#x6C14;&#xFF0C;&#x90FD;&#x611F;&#x89C9;&#x627F;&#x53D7;&#x4E0D;&#x8D77;&#x4E86;&#x3002; &#x6700;&#x7A77;&#x7684;&#x65F6;&#x5019;&#x8EAB;&#x4E0A;&#x4F30;&#x8BA1;&#x603B;&#x5171;&#x8FD8;&#x5269;1000&#x591A;&#x5427;&#x3002;&#x5728;&#x4E00;&#x4E2A;&#x5C0F;&#x516C;&#x53F8;&#x5F85;&#x4E45;&#x4E86;&#xFF0C;&#x8D8A;&#x53D1;&#x611F;&#x89C9;&#x4EBA;&#x8109;&#x62D3;&#x5C55;&#x6709;&#x9650;&#xFF0C;&#x8D44;&#x6E90;&#x6709;&#x9650;&#xFF0C;&#x5BF9;&#x4E2A;&#x4EBA;&#x7A81;&#x7834;&#x4E0D;&#x4F1A;&#x6709;&#x592A;&#x5927;&#x5E2E;&#x52A9;&#x3002;</p>
<p>&#x4E24;&#x4E2A;&#x4EBA;&#x5728;&#x4E00;&#x8D77;&#x751F;&#x6D3B;&#x4E45;&#x4E86;&#xFF0C;&#x5C31;&#x4F1A;&#x4EA7;&#x751F;&#x5404;&#x79CD;&#x6469;&#x64E6;&#xFF0C;&#x4F1A;&#x751F;&#x6C14;&#xFF0C;&#x4F1A;&#x5435;&#x67B6;&#xFF0C;&#x751A;&#x81F3;&#x4F1A;&#x79BB;&#x5BB6;&#x51FA;&#x8D70;&#xFF0C;&#x6216;&#x8005;&#x50CF;&#x4EC7;&#x4EBA;&#x4E00;&#x6837;&#x51E0;&#x5929;&#x4E0D;&#x8BF4;&#x8BDD;&#x3002;&#x6211;&#x751F;&#x6C14;&#x7684;&#x5730;&#x65B9;&#x4E3B;&#x8981;&#x96C6;&#x4E2D;&#x5728;&#xFF1A;&#x4E2A;&#x4EBA;&#x627F;&#x62C5;&#x7684;&#x604B;&#x7231;&#x7ECF;&#x8D39;&#x8FC7;&#x9AD8;&#xFF0C;&#x9650;&#x5236;&#x4E86;&#x6211;&#x5728;&#x5176;&#x5B83;&#x65B9;&#x9762;&#x53D1;&#x5C55;&#x9700;&#x8981;&#x7528;&#x94B1;&#xFF0C;&#x5979;&#x4E5F;&#x4E0D;&#x4F1A;&#x4E3A;&#x6211;&#x8003;&#x8651;&#x8FD9;&#x65B9;&#x9762;&#xFF0C;&#x641E;&#x5F97;&#x597D;&#x50CF;&#x90FD;&#x8BE5;&#x6211;&#x4ED8;&#x94B1;&#x4F3C;&#x7684;&#xFF1B;&#x751F;&#x6D3B;&#x8D8A;&#x6765;&#x8D8A;&#x6765;&#x61D2;&#xFF0C;&#x4E0D;&#x60F3;&#x505A;&#x996D;&#x4E0D;&#x60F3;&#x6D17;&#x7897;&#xFF0C;&#x4E0D;&#x60F3;&#x6D17;&#x8863;&#x670D;&#xFF0C;&#x5F20;&#x53E3;&#x8981;&#x5403;&#x996D;&#xFF0C;&#x8981;&#x559D;&#x6C34;&#xFF0C;&#x8981;&#x8FD9;&#x8981;&#x90A3;&#xFF0C;&#x50CF;&#x5927;&#x7237;&#x4E00;&#x6837;&#x7684;&#x4F3A;&#x5019;&#xFF1B;&#x8001;&#x7231;&#x73A9;&#x624B;&#x673A;&#xFF0C;&#x5403;&#x996D;&#x73A9;&#x624B;&#x673A;&#x5B8C;&#x5168;&#x4E0D;&#x7406;&#x4F1A;&#x6211;&#xFF1B;&#x5DE5;&#x4F5C;&#x7D2F;&#xFF0C;&#x5FC3;&#x7D2F;&#xFF0C;&#x592A;&#x70E6;&#x4EBA;&#xFF0C;&#x4E0D;&#x7ED9;&#x4EBA;&#x4E00;&#x70B9;&#x81EA;&#x5DF1;&#x4F11;&#x606F;&#x7684;&#x65F6;&#x95F4;&#x3002;&#x5979;&#x751F;&#x6C14;&#x4E3B;&#x8981;&#x96C6;&#x4E2D;&#x5728;&#x6211;&#x662F;&#x4E2A;&#x76F4;&#x7537;&#xFF0C;&#x4E0D;&#x592A;&#x4F1A;&#x8BF4;&#x8BDD;&#xFF0C;&#x603B;&#x6311;&#x5979;&#x6BDB;&#x75C5;&#x3002;&#x5C31;&#x8FD9;&#x6837;&#x53CD;&#x590D;&#x5435;&#x95F9;&#x548C;&#x597D;&#xFF0C;&#x5728;&#x4E00;&#x5E74;&#x7684;&#x7ED3;&#x675F;&#x65F6;&#x5206;&#x624B;&#x4E86;&#x3002;&#x4EE5;&#x4E3A;&#x81EA;&#x5DF1;&#x80FD;&#x591F;&#x72E0;&#x5FC3;&#x7ED3;&#x675F;&#xFF0C;&#x5948;&#x4F55;4&#x5E74;&#x611F;&#x60C5;&#x592A;&#x6DF1;&#xFF0C;&#x53C8;&#x8FFD;&#x56DE;&#xFF0C;&#x662F;&#x8981;&#x544A;&#x522B;&#x8FC7;&#x53BB;&#xFF0C;&#x5F00;&#x59CB;&#x4E24;&#x4EBA;&#x65B0;&#x7684;&#x604B;&#x7231;&#x9636;&#x6BB5;&#x3002;&#x7231;&#x60C5;&#x8FD9;&#x4E1C;&#x897F;&#xFF0C;&#x6216;&#x8BB8;&#x771F;&#x4F1A;&#x50CF;&#x7535;&#x89C6;&#x5267;&#x300A;&#x8001;&#x7537;&#x5B69;&#x300B;&#x91CC;&#x9762;&#x8BF4;&#x7684;&#x90A3;&#x53E5;&#x8BDD;:&#x201C;&#x5E74;&#x5C11;&#x4E0D;&#x77E5;&#x7231;&#xFF0C;&#x77E5;&#x7231;&#x4E0D;&#x5C11;&#x5E74;&#x201D;&#x3002;</p>
<p>&#x8FD9;&#x4E00;&#x5E74;&#x57FA;&#x672C;&#x4E0A;&#x7126;&#x8651;&#x9A71;&#x52A8;&#x7740;&#x6211;&#x5411;&#x524D;&#x8D70;&#xFF0C;&#x9A71;&#x52A8;&#x7740;&#x6211;&#x8FD9;&#x4E2A;&#x6CA1;&#x6709;&#x957F;&#x8FDC;&#x76EE;&#x6807;&#x7684;&#x4EBA;&#x3002;&#x77ED;&#x671F;&#x76EE;&#x6807;&#x5BF9;&#x6211;&#x6765;&#x8BF4;&#x662F;&#x73B0;&#x5728;&#x8FD9;&#x4E2A;&#x9636;&#x6BB5;&#x6700;&#x597D;&#x7684;&#x9009;&#x62E9;&#x5427;&#xFF0C;&#x8D70;&#x4E00;&#x6B65;&#x770B;&#x4E00;&#x6B65;&#x3002;&#x6216;&#x8BB8;&#x6709;&#x4E00;&#x5929;&#x6211;&#x5C31;&#x77E5;&#x9053;&#x81EA;&#x5DF1;&#x672A;&#x6765;&#x8981;&#x6210;&#x4E3A;&#x4E00;&#x4E2A;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x4EBA;&#xFF0C;&#x8FBE;&#x6210;&#x4E00;&#x4E2A;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x76EE;&#x6807;&#x3002;&#x5F53;&#x7136;&#x8FD9;&#x4E00;&#x5E74;&#x8FD8;&#x662F;&#x6709;&#x5F88;&#x591A;&#x6536;&#x83B7;&#x7684;&#xFF0C;&#x6280;&#x672F;&#x4E0A;&#x66F4;&#x52A0;&#x5BBD;&#x4E00;&#x70B9;&#xFF0C;&#x540E;&#x7EED;&#x53EF;&#x4EE5;&#x627E;&#x5230;&#x4E00;&#x4E2A;&#x70B9;&#x7A81;&#x7834;&#xFF1B;&#x5FC3;&#x7406;&#x4E0A;&#x66F4;&#x52A0;&#x6210;&#x719F;&#xFF0C;&#x80FD;&#x591F;&#x9690;&#x5FCD;&#xFF0C;&#x63A7;&#x5236;&#x4E00;&#x90E8;&#x5206;&#x60C5;&#x7EEA;&#xFF1B;&#x8EAB;&#x4F53;&#x4E0A;&#xFF0C;&#x7531;&#x4E8E;&#x5065;&#x8EAB;&#x4E5F;&#x6BD4;&#x4E4B;&#x524D;&#x5F3A;&#x58EE;&#x4E00;&#x4E9B;&#x3002;&#x8BFB;&#x7814;&#xFF0C;&#x4E5F;&#x8BA9;&#x6211;&#x672A;&#x6765;&#x7684;&#x4E24;&#x5E74;&#x91CC;&#x6709;&#x4E86;&#x4E8B;&#x60C5;&#x53EF;&#x505A;&#xFF0C;&#x53BB;&#x5B66;&#x4E60;&#x66F4;&#x591A;&#x7684;&#x77E5;&#x8BC6;&#x6280;&#x80FD;&#xFF0C;&#x4E0D;&#x4F1A;&#x663E;&#x5F97;&#x90A3;&#x4E48;&#x65B9;&#x5411;&#x4E0D;&#x660E;&#xFF0C;&#x7B97;&#x662F;&#x7ED9;&#x4E86;&#x6211;&#x4E24;&#x5E74;&#x7684;&#x7F13;&#x51B2;&#x671F;&#x5427;&#x3002;&#x5E0C;&#x671B;&#x81EA;&#x5DF1;&#x4EE5;&#x540E;&#x4E0D;&#x8981;&#x6574;&#x5929;&#x6D3B;&#x5728;&#x4E00;&#x79CD;&#x7126;&#x8651;&#x7684;&#x72B6;&#x6001;&#x91CC;&#x3002;</p>

      
    </div>

    

    
    
    

    

    
      
    
    

    

    <footer class="post-footer">
      

      
      
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2018/04/08/2018年3月笔记/" rel="next" title="2018年3月笔记">
                <i class="fa fa-chevron-left"></i> 2018年3月笔记
              </a>
            
          </div>

          <span class="post-nav-divider"></span>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2018/08/06/SMP2018参会见闻/" rel="prev" title="SMP2018参会见闻">
                SMP2018参会见闻 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </div>
  
  
  
  </article>


  </div>


          </div>
          

  



        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      

      <div class="site-overview-wrap sidebar-panel sidebar-panel-active">
        <div class="site-overview">
          <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
            
              <p class="site-author-name" itemprop="name">Kavim</p>
              <div class="site-description motion-element" itemprop="description">生活不止眼前的苟且 还有诗和远方的田野</div>
          </div>

          
            <nav class="site-state motion-element">
              
                <div class="site-state-item site-state-posts">
                
                  <a href="/archives/">
                
                    <span class="site-state-item-count">47</span>
                    <span class="site-state-item-name">日志</span>
                  </a>
                </div>
              

              
                
                
                <div class="site-state-item site-state-categories">
                  
                    
                      <a href="/categories/">
                    
                  
                    
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                    <span class="site-state-item-count">21</span>
                    <span class="site-state-item-name">分类</span>
                  </a>
                </div>
              

              
                
                
                <div class="site-state-item site-state-tags">
                  
                    
                      <a href="/tags/">
                    
                  
                    
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                    <span class="site-state-item-count">18</span>
                    <span class="site-state-item-name">标签</span>
                  </a>
                </div>
              
            </nav>
          

          

          

          

          

          
          

          
            
          
          

        </div>
      </div>

      

      

    </div>
  </aside>
  


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright">&copy; <span itemprop="copyrightYear">2019</span>
  <span class="with-love" id="animate">
    <i class="fa fa-user"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">Kavim</span>

  

  
</div>


  <div class="powered-by">由 <a href="https://hexo.io" class="theme-link" rel="noopener" target="_blank">Hexo</a> 强力驱动 v3.2.2</div>



  <span class="post-meta-divider">|</span>



  <div class="theme-info">主题 – <a href="https://theme-next.org" class="theme-link" rel="noopener" target="_blank">NexT.Pisces</a> v7.1.0</div>




        








        
      </div>
    </footer>

    
      <div class="back-to-top">
        <i class="fa fa-arrow-up"></i>
        
      </div>
    

    

    

    
  </div>

  

<script>
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>


























  
  <script src="/lib/jquery/index.js?v=2.1.3"></script>

  
  <script src="/lib/velocity/velocity.min.js?v=1.2.1"></script>

  
  <script src="/lib/velocity/velocity.ui.min.js?v=1.2.1"></script>


  


  <script src="/js/utils.js?v=7.1.0"></script>

  <script src="/js/motion.js?v=7.1.0"></script>



  
  


  <script src="/js/affix.js?v=7.1.0"></script>

  <script src="/js/schemes/pisces.js?v=7.1.0"></script>



  
  <script src="/js/scrollspy.js?v=7.1.0"></script>
<script src="/js/post-details.js?v=7.1.0"></script>



  


  <script src="/js/next-boot.js?v=7.1.0"></script>


  

  

  

  


  


  




  

  

  

  

  

  

  

  

  

  

  

  

  

  

</body>
</html>
